[{"_id":7613186,"authors":[{"name":"Seung-Chan Kim","affiliation":["Samsung Advanced Institute of Technology (SAIT), Suwon, Gyeonggi-do, Korea"],"bio":{"graphic":"/mediastore_new/IEEE/content/freeimages/30/7613181/7613186/7613186-photo-1-source-small.gif","p":["Seung-Chan Kim received his BS degree in mechanical engineering from the Yonsei University, Seoul, Korea, in 2005, his MS and PhD degrees in mechanical engineering from the Korea Advanced Institute of Science and Technology (KAIST), Daejeon, Korea, in 2007 and 2013, respectively. From 2011 to 2012, he was a research associate in the IDD (Interaction Design at Disney) group at Disney Research, Pittsburgh, led by Dr. Ivan Poupyrev. In 2014, he joined the Samsung Advanced Institute of Technology (SAIT) as a research staff member. His current research interests include haptics, SLAM, and AR."]},"firstName":"Seung-Chan","lastName":"Kim","id":"37085896859"},{"name":"Soo-Chul Lim","affiliation":["Dept. of Mechanical, Robotics, and Energy Engineering, Dongguk Univ., Seoul, Korea"],"bio":{"graphic":"/mediastore_new/IEEE/content/freeimages/30/7613181/7613186/7613186-photo-2-source-small.gif","p":["Soo-Chul Lim received his BS, MS, and PhD degrees in mechanical engineering from the Korea Advanced Institute of Science and Technology (KAIST), Daejeon, Korea, in 2001, 2003, and 2011, respectively. From 2006–2009, he was a full-time lecturer in the Department of Mechanical Engineering at the Korea Military Academy. From 2011–2015, he was a research staff member at the Samsung Advanced Institute of Technology (SAIT). In 2016, he joined the Department of Mechanical, Robotics, and Energy Engineering, Dongguk University, Seoul, Korea, as an Assistant Professor. His current research interests include human-computer interaction, human-robot interface, surgical robot, and haptics."]},"firstName":"Soo-Chul","lastName":"Lim","id":"37085889936"},{"name":"Jungsoon Shin","affiliation":["ZeeAnn Co., Ltd., Hanam-si, Gyeonggi-do, Korea"],"bio":{"graphic":"/mediastore_new/IEEE/content/freeimages/30/7613181/7613186/7613186-photo-3-source-small.gif","p":["Jungsoon Shin received his BS and MS degrees in electrical engineering from the Korea Advanced Institute of Science and Technology (KAIST), Daejeon, Korea, in 1997 and 1999, respectively. From 1999–2000, he worked for LG Semiconductor, ChungJu, Korea, where he was engaged in researching CCD image sensors. From 2000–2009, he was a member of the research laboratory at Pixelplus Corporation, Suwon, Korea, where he worked on the development of various types of CMOS image sensors and imager systems. From 2009–2011, he worked for Aptina Imaging Korea, Seoul, Korea, where he was engaged in the development of high-end CMOS imagers. From 2011–2015, he was a research staff member at the Samsung Advanced Institute of Technology (SAIT), where he was working on the development of CMOS imagers for 3-D image capturing. In 2016, he joined ZeeAnn Corporation, Hanam, Korea. His current research interests include CMOS imaging, VLSI circuit design, and 3-D imaging."]},"firstName":"Jungsoon","lastName":"Shin","id":"37072847100"},{"name":"Jaehyuk Choi","affiliation":["Department of Semiconductor Systems Engineering, Sungkyunkwan University, Suwon, Gyeonggi-do, Korea"],"bio":{"graphic":"/mediastore_new/IEEE/content/freeimages/30/7613181/7613186/7613186-photo-4-source-small.gif","p":["Jaehyuk Choi (S'07-M'13) received a BS degree in electrical engineering from the Yonsei University, Seoul, Korea, in 2004, an MS degree in electrical engineering and computer science from the Korea Advanced Institute of Science and Technology (KAIST), Daejeon, Korea, in 2006, an MS degree in electrical and computer engineering from the University of Minnesota, Minneapolis, MN, USA, in 2008, and a PhD degree from the University of Michigan, Ann Arbor, MI, USA, in 2013. From 2013–2015, he was a research staff member at the Samsung Advanced Institute of Technology (SAIT), Samsung Electronics, Suwon, Korea, where he was engaged in researching depth sensors and low power image sensors. In 2016, he joined the Department of Semiconductor Systems Engineering, Sungkyunkwan University, Suwon, Korea, as an Assistant Professor. His research interests include low-power circuits, CMOS sensors, and mixed-signal integrated circuits."]},"firstName":"Jaehyuk","lastName":"Choi","id":"37066872300"}],"issn":[{"format":"Print ISSN","value":"0098-3063"},{"format":"Electronic ISSN","value":"1558-4127"}],"articleNumber":"7613186","dbTime":"16 ms","metrics":{"citationCountPaper":3,"citationCountPatent":0,"totalDownloads":1350},"sponsors":[{"packageNumber":0,"name":"IEEE Consumer Electronics Society","url":"http://www.ewh.ieee.org/soc/ces/index.html"}],"keywords":[{"type":"IEEE Keywords","kwd":["Electronics packaging","Transistors","Biometrics (access control)","CMOS image sensors","Prototypes","Temperature sensors","Authentication"]},{"type":"INSPEC: Controlled Indexing","kwd":["authorisation","biometrics (access control)","CMOS image sensors","domestic appliances","readout electronics"]},{"type":"INSPEC: Non-Controlled Indexing","kwd":["human biometrics","electronic eyes","system authentication","embedded CMOS image sensor","home appliances","column component","fixed pattern noise","embedded system","correlated double sampling process","readout scheme","CIS-based identification","consumer electronics"]},{"type":"Author Keywords ","kwd":["Device biometrics","CIS","FPN","Column FPN"]}],"abstract":"Identically designed electronic devices such as transistors may have random variations in their physical quantities. Inspired by human biometrics, this paper presents a novel approach that enables home appliances to have unique identities based on the intrinsic features of a CMOS image sensor (CIS) embedded in their electronic eyes (i.e., inbuilt cameras). More specifically, the column component of the fixed pattern noise (FPN) that inevitably exists in most modern CISs is utilized as a unique feature of the CIS for describing a unique ID for the embedded system. To practically capture column FPNs that were originally canceled out by a correlated double sampling (CDS) process, this paper also proposes a novel readout scheme. The feasibility of the proposed CIS-based identification is assessed with real measurements using 12 CIS prototypes. In conclusion, a set of applications requiring unique device identifications are presented for demonstrating the utility of the proposed approach in the domain of consumer electronics.\n<sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">1</sup>","doi":"10.1109/TCE.2016.7613186","publicationTitle":"IEEE Transactions on Consumer Electronics","displayPublicationTitle":"IEEE Transactions on Consumer Electronics","pdfPath":"/iel7/30/7613181/07613186.pdf","doiLink":"https://doi.org/10.1109/TCE.2016.7613186","issueLink":"/xpl/tocresult.jsp?isnumber=7613181","startPage":"209","endPage":"215","formulaStrippedArticleTitle":"Biometrics for electronic eyes: system authentication with embedded CMOS image sensor","pdfUrl":"/stamp/stamp.jsp?tp=&arnumber=7613186","pubTopics":[{"name":"Power, Energy and Industry Applications"},{"name":"Components, Circuits, Devices and Systems"},{"name":"Fields, Waves and Electromagnetics"}],"publisher":"IEEE","displayDocTitle":"Biometrics for electronic eyes: system authentication with embedded CMOS image sensor","chronOrPublicationDate":"August  2016","htmlAbstractLink":"/document/7613186/","journalDisplayDateOfPublication":"26 October 2016","isJournal":true,"isStaticHtml":true,"volume":"62","issue":"3","publicationDate":"August 2016","accessionNumber":"16411068","dateOfInsertion":"26 October 2016","htmlLink":"/document/7613186/","xploreDocumentType":"Journals & Magazine","isDynamicHtml":true,"openAccessFlag":"F","title":"Biometrics for electronic eyes: system authentication with embedded CMOS image sensor","sourcePdf":"p209-kim.pdf","content_type":"Journals & Magazines","mlTime":"PT0.073842S","chronDate":"August  2016","xplore-pub-id":"30","isNumber":"7613181","rightsLinkFlag":"1","contentType":"periodicals","publicationNumber":"30","citationCount":"3","xplore-issue":"7613181","articleId":"7613186","contentTypeDisplay":"Journals","publicationYear":"2016","subType":"IEEE Transaction","_value":"IEEE","lastupdate":"2021-10-11"},{"_id":7613189,"authors":[{"name":"Adriana C. Luna","affiliation":["Department of Energy Technology, Aalborg University, Denmark"],"bio":{"graphic":"/mediastore_new/IEEE/content/freeimages/30/7613181/7613189/7613189-photo-1-source-small.gif","p":["A. C. Luna (S'06) received the B.S. degree in electronic engineering in 2006 and M.S. degree in Industrial Automation in 2011, both from Universidad Nacional de Colombia. She is currently working toward the Ph.D degree in the Department of Energy Technology at Aalborg University, Aalborg, Denmark.","Her research work focuses on energy management systems of microgrids, and specifically on architectures and algorithms for scheduling and optimization for operation level in microgrids."]},"firstName":"Adriana C.","lastName":"Luna","id":"37085369812"},{"name":"Nelson L. Diaz","affiliation":["Universidad Distrital F. J. C., Bogota, Colombia","Department of Energy Technology, Aalborg University, Denmark"],"bio":{"graphic":"/mediastore_new/IEEE/content/freeimages/30/7613181/7613189/7613189-photo-2-source-small.gif","p":["N. L. Diaz (S'09) received the B.S degree in Electronic Engineering from the Universidad Distrital F.J.C in 2008, and the M.S. degree in Industrial Automation from the Universidad Nacional de Colombia in 2011, Bogota, Colombia. He is currently pursuing the Ph.D. degree from the Department of Energy Technology, Aalborg University, Aalborg, Denmark. He is member of the Research Laboratory of Alternative Energy Sources, Universidad Distrital F.J.C. and Microgrid Research Group, Aalborg University.","His current research interests include microgrids and power converters control."]},"firstName":"Nelson L.","lastName":"Diaz","id":"37409779000"},{"name":"Moises Graells","affiliation":["Chemical Engineering Department, Universitat Politècnica de Catalunya"],"bio":{"graphic":"/mediastore_new/IEEE/content/freeimages/30/7613181/7613189/7613189-photo-3-source-small.gif","p":["M. Graells (Moisès Graells is Associate Professor of Chemical Engineering at Universitat Politècnica de Catalunya (UPC). He holds a degree in Chemical Science from Universitat Autònoma de Barcelona (UAB, 1989) and he obtained his Ph.D. in 1996 at UPC.","His research interests have focused on the modeling, integration and optimization of chemical processes, especially batch processes. Regarding methodological aspects, his interests are the modeling and optimization techniques, computer aided tools for decision making, information management and standardization.","Recently, his investigation also includes the modeling of complex chemical systems and the study of renewable energy systems"]},"firstName":"Moises","lastName":"Graells","id":"38500546300"},{"name":"Juan C. Vasquez","affiliation":["Department of Energy Technology, Aalborg University, Denmark"],"bio":{"graphic":"/mediastore_new/IEEE/content/freeimages/30/7613181/7613189/7613189-photo-4-source-small.gif","p":["J. C. Vasquez (M'12-SM'14) received the B.S. degree in electronics engineering from the Autonomous University of Manizales, Manizales, Colombia, and the Ph.D. degree in automatic control, robotics, and computer vision from the Technical University of Catalonia, Barcelona, Spain, in 2004 and 2009, respectively. He was with the Autonomous University of Manizales working as a teaching assistant and the Technical University of Catalonia as a Post-Doctoral Assistant in 2005 and 2008 respectively. In 2011, he was Assistant Professor and from 2014 he is working as an Associate Professor at the Department of Energy Technology, Aalborg University, Denmark where he is the Vice Programme Leader of the Microgrids Research Program. From Feb. 2015 to April. 2015 he was a Visiting Scholar at the Center of Power Electronics Systems (CPES) at Virginia Tech. His current research interests include operation, advanced hierarchical and cooperative control, optimization and energy management applied to distributed generation in AC and DC microgrids. He has authored and coauthored more than 100 technical papers only in Microgrids in international IEEE conferences and journals.","Dr. Vasquez is currently a member of the IEC System Evaluation Group SEG4 on LVDC Distribution and Safety for use in Developed and Developing Economies, the Renewable Energy Systems Technical Committee TC-RES in IEEE Industrial Electronics, PELS, IAS, and PES Societies."]},"firstName":"Juan C.","lastName":"Vasquez","id":"38497192700"},{"name":"Josep M. Guerrero","affiliation":["Department of Energy Technology, Aalborg University, Denmark"],"bio":{"graphic":"/mediastore_new/IEEE/content/freeimages/30/7613181/7613189/7613189-photo-5-source-small.gif","p":["J. M. Guerrero (S'01-M'04-SM'08-FM'15) received the B.S. degree in telecommunications engineering, the M.S. degree in electronics engineering, and the Ph.D. degree in power electronics from the Technical University of Catalonia, Barcelona, in 1997, 2000 and 2003, respectively. Since 2011, he has been a Full Professor with the Department of Energy Technology, Aalborg University, Denmark, where he is responsible for the Microgrid Research Program. From 2012 he is a guest Professor at the Chinese Academy of Science and the Nanjing University of Aeronautics and Astronautics; from 2014 he is chair Professor in Shandong University; from 2015 he is a distinguished guest Professor in Hunan University; and from 2016 he is a visiting professor fellow at Aston University, UK.","His research interests is oriented to different microgrid aspects, including power electronics, distributed energy-storage systems, hierarchical and cooperative control, energy management systems, smart metering and the internet of things for AC/DC microgrid clusters and islanded minigrids; recently specially focused on maritime microgrids for electrical ships, vessels, ferries and seaports. Prof. Guerrero is an Associate Editor for the IEEE TRANSACTIONS ON POWER ELECTRONICS, the IEEE TRANSACTIONS ON INDUSTRIAL ELECTRONICS, and the IEEE Industrial Electronics Magazine, and an Editor for the IEEE TRANSACTIONS on SMART GRID and IEEE TRANSACTIONS on ENERGY CONVERSION. He has been Guest Editor of the IEEE TRANSACTIONS ON POWER ELECTRONICS Special Issues: Power Electronics for Wind Energy Conversion and Power Electronics for Microgrids; the IEEE TRANSACTIONS ON INDUSTRIAL ELECTRONICS Special Sections: Uninterruptible Power Supplies systems, Renewable Energy Systems, Distributed Generation and Microgrids, and Industrial Applications and Implementation Issues of the Kalman Filter; the IEEE TRANSACTIONS on SMART GRID Special Issues: Smart DC Distribution Systems and Power Quality in Smart Grids; the IEEE TRANSACTIONS on ENERGY CONVERSION Special Issue on Energy Conversion in Next-generation Electric Ships. He was the chair of the Renewable Energy Systems Technical Committee of the IEEE Industrial Electronics Society. He received the best paper award of the IEEE Transactions on Energy Conversion for the period 2014–2015. In 2014 and 2015 he was awarded by Thomson Reuters as Highly Cited Researcher, and in 2015 he was elevated as IEEE Fellow for his contributions on “distributed power systems and microgrids.”"]},"firstName":"Josep M.","lastName":"Guerrero","id":"37274692200"}],"issn":[{"format":"Print ISSN","value":"0098-3063"},{"format":"Electronic ISSN","value":"1558-4127"}],"articleNumber":"7613189","dbTime":"3 ms","metrics":{"citationCountPaper":42,"citationCountPatent":0,"totalDownloads":1179},"sponsors":[{"packageNumber":0,"name":"IEEE Consumer Electronics Society","url":"http://www.ewh.ieee.org/soc/ces/index.html"}],"pdfUrl":"/stamp/stamp.jsp?tp=&arnumber=7613189","keywords":[{"type":"IEEE Keywords","kwd":["Batteries","Home appliances","Power systems","Renewable energy sources","Optimization"]},{"type":"INSPEC: Controlled Indexing","kwd":["domestic appliances","energy management systems","power grids","renewable energy sources"]},{"type":"INSPEC: Non-Controlled Indexing","kwd":["cooperative energy management","households prosumer cluster","electrical appliances","electronic appliances","residential consumers","energy demand","energy requirements","renewable energy sources","power grid","autonomous operation","distributed household prosumers","neighborhood environment"]},{"type":"Author Keywords ","kwd":["Cluster of Prosumers","Cooperative Management","Energy Manage System","Household Prosumer"]}],"abstract":"The increment of electrical and electronic appliances for improving the lifestyle of residential consumers had led to a larger demand of energy. In order to supply their energy requirements, the consumers have changed the paradigm by integrating renewable energy sources to their power grid. Therefore, consumers become prosumers in which they internally generate and consume energy looking for an autonomous operation. This paper proposes an energy management system for coordinating the operation of distributed household prosumers. It was found that better performance is achieved when cooperative operation with other prosumers in a neighborhood environment is achieved. Simulation and experimental results validate the proposed strategy by comparing the performance of islanded prosumers with the operation in cooperative mode\n<sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">1</sup>\n.","doi":"10.1109/TCE.2016.7613189","issueLink":"/xpl/tocresult.jsp?isnumber=7613181","doiLink":"https://doi.org/10.1109/TCE.2016.7613189","publicationTitle":"IEEE Transactions on Consumer Electronics","displayPublicationTitle":"IEEE Transactions on Consumer Electronics","pdfPath":"/iel7/30/7613181/07613189.pdf","startPage":"235","endPage":"242","formulaStrippedArticleTitle":"Cooperative energy management for a cluster of households prosumers","pubTopics":[{"name":"Power, Energy and Industry Applications"},{"name":"Components, Circuits, Devices and Systems"},{"name":"Fields, Waves and Electromagnetics"}],"publisher":"IEEE","isDynamicHtml":true,"journalDisplayDateOfPublication":"26 October 2016","displayDocTitle":"Cooperative energy management for a cluster of households prosumers","volume":"62","issue":"3","chronOrPublicationDate":"August  2016","dateOfInsertion":"26 October 2016","isJournal":true,"isStaticHtml":true,"htmlLink":"/document/7613189/","publicationDate":"August 2016","accessionNumber":"16411065","htmlAbstractLink":"/document/7613189/","xploreDocumentType":"Journals & Magazine","openAccessFlag":"F","title":"Cooperative energy management for a cluster of households prosumers","sourcePdf":"p235-luna.pdf","content_type":"Journals & Magazines","mlTime":"PT0.10415S","chronDate":"August  2016","xplore-pub-id":"30","isNumber":"7613181","rightsLinkFlag":"1","contentType":"periodicals","publicationNumber":"30","citationCount":"42","xplore-issue":"7613181","articleId":"7613189","contentTypeDisplay":"Journals","publicationYear":"2016","subType":"IEEE Transaction","_value":"IEEE","lastupdate":"2021-09-19"},{"_id":7613193,"authors":[{"name":"Chao Sun","affiliation":["Department of Electrical, Electronic, and Communication Engineering, Chuo University, Tokyo, Japan"],"bio":{"graphic":"/mediastore_new/IEEE/content/freeimages/30/7613181/7613193/7613193-photo-1-source-small.gif","p":["Chao Sun (S'12-M'16) received the B.S. and M.S. degrees in Electrical Engineering and Automation from Harbin Institute of Technology, Harbin, China, in 2009, 2011, respectively. In 2014, he received the Ph.D. degree in Electrical Engineering and Information System from the University of Tokyo, Tokyo, Japan. He was an Assistant Professor in Chuo University, Tokyo, Japan, from 2014 to 2015. Currently, he is a Research Staff Member (Principal Engineer-Storage Architect) in Western Digital San Jose Research Center, CA, USA and a visiting researcher in Chuo University. His current research interests are high performance storage architecture design."]},"firstName":"Chao","lastName":"Sun","id":"38466841700"},{"name":"Shun Okamoto","affiliation":["Department of Electrical, Electronic, and Communication Engineering, Chuo University, Tokyo, Japan"],"bio":{"graphic":"/mediastore_new/IEEE/content/freeimages/30/7613181/7613193/7613193-photo-2-source-small.gif","p":["Shun Okamoto received the B.S. and M.S. degree in Department of Electrical, Electronic, Communication Engineering, Faculty of Science and Engineering from Chuo University, Tokyo, Japan in 2013 and 2015, respectively. He is currently working in Toshiba Corporation Semiconductor & Storage Products."]},"firstName":"Shun","lastName":"Okamoto","id":"37085388791"},{"name":"Shogo Hachiya","affiliation":["Department of Electrical, Electronic, and Communication Engineering, Chuo University, Tokyo, Japan"],"bio":{"graphic":"/mediastore_new/IEEE/content/freeimages/30/7613181/7613193/7613193-photo-3-source-small.gif","p":["Shogo Hachiya graduated from Higashi Okayama Technical High School, Okayama, Japan, in 1998. Since 1998, he has been working in several semiconductor disciplines, including mixed signal large scale integrated circuit (LSI) design and marketing. He is currently a Researcher in Chuo University, Tokyo, Japan. He is engaged in the storage system design of nonvolatile memories."]},"firstName":"Shogo","lastName":"Hachiya","id":"37085554792"},{"name":"Tomoaki Yamada","affiliation":["Department of Electrical, Electronic, and Communication Engineering, Chuo University, Tokyo, Japan"],"bio":{"graphic":"/mediastore_new/IEEE/content/freeimages/30/7613181/7613193/7613193-photo-4-source-small.gif","p":["Tomoaki Yamada received the B.E. degree from Chuo University, Tokyo, Japan, 2015, where he is currently working toward the M.S. degree. He is engaged in the storage system design of nonvolatile memories."]},"firstName":"Tomoaki","lastName":"Yamada","id":"37085381829"},{"name":"Ken Takeuchi","affiliation":["Department of Electrical, Electronic, and Communication Engineering, Chuo University, Tokyo, Japan"],"bio":{"graphic":"/mediastore_new/IEEE/content/freeimages/30/7613181/7613193/7613193-photo-5-source-small.gif","p":["Ken Takeuchi (M'10) is currently a Professor at the Department of Electrical, Electronic, and Communication Engineering, Faculty of Science and Engineering of Chuo University. He is now working on the database storage system for big-data application, VLSI circuit design, signal processing and device such as the emerging non-volatile memories, 3D-integrated SSDs, low-power 3D-LSI circuits and ultra low-voltage SRAMs. He received the B.S. and M.S. degrees in Applied Physics and the Ph.D. degree in Electric Engineering from the University of Tokyo in 1991, 1993 and 2006, respectively. In 2003, he also received the M.B.A. degree from Stanford University. Since he joined Toshiba in 1993, he had been leading Toshiba's NAND flash memory circuit design for fourteen years. He was an Associate Professor at the Department of Electrical Engineering and Information Systems, Graduate School of Engineering of the University of Tokyo from 2007 till 2012. In 2012, he joined Chuo University. He designed six world's highest density NAND flash memory products such as 0.7um 16Mbit, 0.4um 64Mbit, 0.25um 256Mbit, 0.16um 1Gbit, 0.13um 2Gbit and 56nm 8Gbit NAND flash memories. He holds 228 patents worldwide including 124 U.S. patents. Especially, with his invention, “multipage cell architecture”, presented at Symposium on VLSI Circuits in 1997, he successfully commercialized world's first multi-level cell NAND flash memory in 2001. He has authored numerous technical papers, one of which won the Takuo Sugano Award for Outstanding Paper at ISSCC 2007. He has served on the program committee member of International Solid-State Circuits Conference (ISSCC), Symposium on VLSI Circuits, Asian Solid-State Circuits Conference (A-SSCC), International Memory Workshop (IMW), International Conference on Solid State Devices and Materials (SSDM) and Non-Volatile Memory Technology Symposium (NVMTS). He served as a tutorial speaker at ISSCC 2008, SSD forum organizer at ISSCC 2009, 3D-LSI forum organizer at ISSCC 2010, Ultra-low voltage LSI forum organizer at ISSCC 2011 and Robust VLSI System forum organizer at ISSCC 2012."]},"firstName":"Ken","lastName":"Takeuchi","id":"37085364918"}],"issn":[{"format":"Print ISSN","value":"0098-3063"},{"format":"Electronic ISSN","value":"1558-4127"}],"articleNumber":"7613193","dbTime":"4 ms","metrics":{"citationCountPaper":4,"citationCountPatent":0,"totalDownloads":935},"sponsors":[{"packageNumber":0,"name":"IEEE Consumer Electronics Society","url":"http://www.ewh.ieee.org/soc/ces/index.html"}],"keywords":[{"type":"IEEE Keywords","kwd":["Flash memories","Random access memory","Nonvolatile memory","Algorithm design and analysis","File systems","Metadata","Memory management"]},{"type":"INSPEC: Controlled Indexing","kwd":["DRAM chips","flash memories","meta data","NAND circuits"]},{"type":"INSPEC: Non-Controlled Indexing","kwd":["storage class memory","flash hybrid solid-state drive","system architecture","workload characteristic","NAND flash memories","bandwidth gap","DRAM flash","solid storage performance","file system metadata","physical mapping tables","write-back nonvolatile memory based cache","SCM chip latency","memory device","circuit design","data management","SCM interface","capacity requirement","NAND flash-only SSD speed"]},{"type":"Author Keywords ","kwd":["Storage Class Memory","Solid-State Drive","NAND Flash Memory","Data Management Algorithm"]}],"pdfUrl":"/stamp/stamp.jsp?tp=&arnumber=7613193","abstract":"Solid-state drives (SSDs), composed of NAND flash memories, are replacing hard disk drives (HDDs) rapidly. In addition, storage class memories (SCMs) bridge the bandwidth gap between DRAM and NAND flash, thus introducing SCM to SSD further improves the solid storage performance. Different from schemes that use SCM to store file system metadata or logical to physical mapping tables, two architectures 1) use SCM as a write-back non-volatile memory (NVM) based cache, 2) use SCM as a storage device are presented in this paper. Since SCM chip latency varies due to memory device and circuit design, three SSD data management algorithms are evaluated under five SCM chip design scenarios to provide useful design guidelines of SCM/NAND flash hybrid SSD. SCM interface and capacity requirement are also analyzed. From the experimental results, less than 10% of the SCM/NAND flash capacity ratio is enough for SCM chips with 500 ns read and 5 μs write latency to boost NAND flash-only SSD speed by over 10 times when workloads own high IO skew\n<sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">1</sup>\n.","doi":"10.1109/TCE.2016.7613193","publicationTitle":"IEEE Transactions on Consumer Electronics","displayPublicationTitle":"IEEE Transactions on Consumer Electronics","pdfPath":"/iel7/30/7613181/07613193.pdf","startPage":"267","endPage":"274","doiLink":"https://doi.org/10.1109/TCE.2016.7613193","issueLink":"/xpl/tocresult.jsp?isnumber=7613181","formulaStrippedArticleTitle":"Design guidelines of storage class memory/flash hybrid solid-state drive considering system architecture, algorithm and workload characteristic","pubTopics":[{"name":"Power, Energy and Industry Applications"},{"name":"Components, Circuits, Devices and Systems"},{"name":"Fields, Waves and Electromagnetics"}],"publisher":"IEEE","journalDisplayDateOfPublication":"26 October 2016","displayDocTitle":"Design guidelines of storage class memory/flash hybrid solid-state drive considering system architecture, algorithm and workload characteristic","volume":"62","issue":"3","dateOfInsertion":"26 October 2016","accessionNumber":"16411066","isJournal":true,"publicationDate":"August 2016","isStaticHtml":true,"htmlLink":"/document/7613193/","htmlAbstractLink":"/document/7613193/","xploreDocumentType":"Journals & Magazine","chronOrPublicationDate":"August  2016","isDynamicHtml":true,"openAccessFlag":"F","title":"Design guidelines of storage class memory/flash hybrid solid-state drive considering system architecture, algorithm and workload characteristic","sourcePdf":"p267-sun.pdf","content_type":"Journals & Magazines","mlTime":"PT0.064608S","chronDate":"August  2016","xplore-pub-id":"30","isNumber":"7613181","rightsLinkFlag":"1","contentType":"periodicals","publicationNumber":"30","citationCount":"4","xplore-issue":"7613181","articleId":"7613193","contentTypeDisplay":"Journals","publicationYear":"2016","subType":"IEEE Transaction","_value":"IEEE","lastupdate":"2021-09-19"},{"_id":7613201,"authors":[{"name":"Dongsik Jo","affiliation":["Electronics and Telecommunications Research Institute, Korea University, Daejeon, Korea"],"bio":{"graphic":"/mediastore_new/IEEE/content/freeimages/30/7613181/7613201/7613201-photo-1-source-small.gif","p":["Dongsik Jo received his MS degree in computer engineering from POSTECH in 2003. In 2004, he joined the virtual reality team, Electronics and Telecommunications Research Institute (ETRI), Daejeon, Korea. Since 2014, he has been a graduate student of the department of computer science and engineering, Korea University. His research interests include virtual reality, augmented reality, IoT sensing, scene matching, avatar motion, collaborative virtual environment, and immersive visualization."]},"firstName":"Dongsik","lastName":"Jo","id":"37602903600"},{"name":"Gerard Jounghyun Kim","affiliation":["Department of Computer Science and Engineering, Korea University, Seoul, Korea"],"bio":{"graphic":"/mediastore_new/IEEE/content/freeimages/30/7613181/7613201/7613201-photo-2-source-small.gif","p":["Gerard J. Kim received his BS in electrical and computer engineering from Carnegie Mellon University (1987) and MS, PhD in Computer Science at the University of Southern California (1994). He is currently a professor of computer science at Korea University. Gerard's main research interests are human computer interaction, virtual/mixed reality, and computer music."]},"firstName":"Gerard Jounghyun","lastName":"Kim","id":"37404469800"}],"issn":[{"format":"Print ISSN","value":"0098-3063"},{"format":"Electronic ISSN","value":"1558-4127"}],"articleNumber":"7613201","dbTime":"6 ms","metrics":{"citationCountPaper":39,"citationCountPatent":0,"totalDownloads":2194},"sponsors":[{"packageNumber":0,"name":"IEEE Consumer Electronics Society","url":"http://www.ewh.ieee.org/soc/ces/index.html"}],"pdfUrl":"/stamp/stamp.jsp?tp=&arnumber=7613201","keywords":[{"type":"INSPEC: Controlled Indexing","kwd":["augmented reality","domestic appliances","Internet of Things","tracking","user interfaces"]},{"type":"INSPEC: Non-Controlled Indexing","kwd":["Internet of Things appliances","augmented reality","ARIoT approach","user proximal target objects","feature information tracking","generic interactive contents","conventional single serveror client","visual in-situ AR interface"]},{"type":"Author Keywords ","kwd":["Internet of Things (IoT)","Augmented Reality (AR)","Tracking","Interactivity","Scalability"]}],"abstract":"This paper proposes a scalable Augmented Reality (AR) framework enabled by a simple extension to the Internet of Things (IoT) infrastructure, called the \"ARIoT.\" Through ARIoT (1) potential user-proximal target objects are dynamically identified in any IoT-enabled space, (2) tracking feature information is directly obtained from the IoT objects enabling fast recognition and tracking (independent of the number of the total IoT objects everywhere), and (3) generic interactive contents are augmented as an IoT service to the AR client. To further improve the AR tracking performance, which often depends on feature appearances, this paper introduces a method in which the preferred tracking method is determined by the very IoT object in hand. The proposed concept of ARIoT is demonstrated, and its performance is evaluated and compared with the conventional single serveror client-based AR implementation. In addition, a pilot usability test is conducted between a spatially registered visual in-situ AR interface using ARIoT and a conventional interface based only on an online connection, and the results are then compared. This study shows how AR and IoT can be complementary to each other: AR as an attractive visual insitu interface for IoT objects and IoT as a basis for scalable AR\n<sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">1</sup>\n.","doi":"10.1109/TCE.2016.7613201","doiLink":"https://doi.org/10.1109/TCE.2016.7613201","startPage":"334","endPage":"340","publicationTitle":"IEEE Transactions on Consumer Electronics","displayPublicationTitle":"IEEE Transactions on Consumer Electronics","pdfPath":"/iel7/30/7613181/07613201.pdf","issueLink":"/xpl/tocresult.jsp?isnumber=7613181","formulaStrippedArticleTitle":"ARIoT: scalable augmented reality framework for interacting with Internet of Things appliances everywhere","pubTopics":[{"name":"Power, Energy and Industry Applications"},{"name":"Components, Circuits, Devices and Systems"},{"name":"Fields, Waves and Electromagnetics"}],"publisher":"IEEE","isDynamicHtml":true,"htmlAbstractLink":"/document/7613201/","chronOrPublicationDate":"August  2016","journalDisplayDateOfPublication":"26 October 2016","displayDocTitle":"ARIoT: scalable augmented reality framework for interacting with Internet of Things appliances everywhere","volume":"62","issue":"3","isJournal":true,"dateOfInsertion":"26 October 2016","accessionNumber":"16411077","publicationDate":"August 2016","htmlLink":"/document/7613201/","isStaticHtml":true,"xploreDocumentType":"Journals & Magazine","openAccessFlag":"F","title":"ARIoT: scalable augmented reality framework for interacting with Internet of Things appliances everywhere","sourcePdf":"p334-jo.pdf","content_type":"Journals & Magazines","mlTime":"PT0.055206S","chronDate":"August  2016","xplore-pub-id":"30","isNumber":"7613181","rightsLinkFlag":"1","contentType":"periodicals","publicationNumber":"30","citationCount":"39","xplore-issue":"7613181","articleId":"7613201","contentTypeDisplay":"Journals","publicationYear":"2016","subType":"IEEE Transaction","_value":"IEEE","lastupdate":"2021-09-19"}]