[{"_id":9690635,"authors":[{"name":"Xianghao Yu","affiliation":["Hong Kong University of Science and Technology, China"],"bio":{"p":["Xianghao Yu received his Ph.D. degree in electronic and computer engineering from the Hong Kong University of Science and Technology (HKUST), China, in 2018. He was a Humboldt postdoctoral research fellow with the Institute for Digital Communications, Friedrich-Alexander University of Erlangen-Nurem-berg (FAU), Germany. He is currently a Research Assistant Professor with the Department of Electronic and Computer Engineering at HKUST. He received the IEEE Global Communications Conference (GLOBECOM) Best Paper Awards in 2017 and 2019, respectively, and the 2018 IEEE Signal Processing Society Young Author Best Paper Award."]},"firstName":"Xianghao","lastName":"Yu"},{"name":"Vahid Jamali","affiliation":["Friedrich-Alexander University Erlangen-Nuremberg, Germany"],"bio":{"p":["Vahid Jamali received his B.Sc. and M.Sc. degrees (honors) in electrical engineering from the K. N. Toosi University of Technology, Tehran, Iran, in 2010 and 2012, respectively, and his Ph.D. degree (with distinction) from FAU in 2019. In 2017, he was a visiting research scholar at Stanford University, California. He is currently a postdoctoral research fellow at Princeton University. His research interests include wireless and molecular communications, and multiuser information theory."]},"firstName":"Vahid","lastName":"Jamali"},{"name":"Dongfang Xu","affiliation":["Friedrich-Alexander University Erlangen-Nuremberg, Germany"],"bio":{"p":["Dongfang Xu received his B.S. degree in communication engineering from Shandong University, Jinan, China, in 2014, and his M.S. degree in communication and multimedia engineering from FAU in 2017, where he is currently pursuing a Ph.D. degree in electrical engineering. His research interests include convex and nonconvex optimization, unmanned aerial vehicle communications, and physical layer security. He was a co-recipient of the IEEE GLOBECOM 2019 Best Paper Award."]},"firstName":"Dongfang","lastName":"Xu"},{"name":"Derrick Wing Kwan Ng","affiliation":["University of New South Wales, Australia"],"bio":{"p":["Derrick Wing Kwan Ng received his Bachelor's degree with first-class honors and his M.Phil. degree in electronic engineering from the Hong Kong University of Science and Technology in 2006 and 2008, respectively. He received his Ph.D. degree from the University of British Columbia (UBC), Vancouver, Canada, in 2012. He is now working as a senior lecturer and a Scientia Fellow at the University of New South Wales, Sydney, Australia. His research interests include convex and non-convex optimization, physical layer security, IRS-assisted communication, UAV-assisted communication, wireless information and power transfer, and green wireless communications."]},"firstName":"Derrick Wing Kwan","lastName":"Ng"},{"name":"Robert Schober","affiliation":["Friedrich-Alexander University Erlangen-Nuremberg, Germany"],"bio":{"p":["Robert Schober received his Diplom (Univ.) and Ph.D. degrees in electrical engineering from FAU in 1997 and 2000, respectively. From 2002 to 2011, he was a professor and Canada Research Chair at UBC. Since January 2012, he is an Alexander von Humboldt Professor and the Chair for Digital Communication at FAU. His research interests fall into the broad areas of communication theory, wireless communications, and statistical signal processing."]},"firstName":"Robert","lastName":"Schober"}],"issn":[{"format":"Print ISSN","value":"1536-1284"},{"format":"Electronic ISSN","value":"1558-0687"}],"articleNumber":"9690635","dbTime":"3 ms","metrics":{"citationCountPaper":0,"citationCountPatent":0,"totalDownloads":0},"sponsors":[{"packageNumber":0,"name":"IEEE Communications Society","url":"http://www.comsoc.org/"}],"formulaStrippedArticleTitle":"Smart and Reconfigurable Wireless Communications: From IRS Modeling to Algorithm Design","abstract":"Intelligent reflecting surfaces (IRSs) have been introduced into wireless communications systems due to their great potential to smartly customize and reconfigure radio propagation environments in a cost-effective manner. Despite the promising advantages of IRSs, academic research on IRSs is still in its infancy. In particular, the design and analysis of IRS-assisted wireless communication systems critically depend on accurate and tractable modeling of the IRS. In this article, we first present and compare three IRS models, namely the conventional independent diffusive scatterer-based model, physics-based model, and impedance network-based model, in terms of their accuracy, tractability, and implementation simplicity. Furthermore, a new framework based on partitioning the IRS into tiles and employing codebooks of transmission modes is introduced to enable scalable IRS optimization. Then we investigate the impact of the three considered IRS models on system design, where several crucial technical challenges for the efficient design of IRS-assisted wireless systems are identified and the corresponding solutions are unraveled. Furthermore, to illustrate the properties of the considered models and the efficiency of the proposed solution concepts, IRS-assisted secure wireless systems and simultaneous wireless information and power transfer systems are studied in more detail. Finally, several promising future research directions for IRS-assisted wireless systems are highlighted.","doi":"10.1109/MWC.001.2100145","doiLink":"https://doi.org/10.1109/MWC.001.2100145","issueLink":"/xpl/tocresult.jsp?isnumber=9690141","startPage":"118","endPage":"125","displayPublicationTitle":"IEEE Wireless Communications","pdfPath":"/iel7/7742/9690141/09690635.pdf","publicationTitle":"IEEE Wireless Communications","pdfUrl":"/stamp/stamp.jsp?tp=&arnumber=9690635","keywords":[{"type":"IEEE Keywords","kwd":["Wireless communication","Surface impedance","Analytical models","Radio propagation","Impedance","Communication system security","System analysis and design"]}],"pubTopics":[{"name":"Communication, Networking and Broadcast Technologies"},{"name":"Computing and Processing"},{"name":"Signal Processing and Analysis"}],"publisher":"IEEE","xploreDocumentType":"Journals & Magazine","isDynamicHtml":true,"displayDocTitle":"Smart and Reconfigurable Wireless Communications: From IRS Modeling to Algorithm Design","chronOrPublicationDate":"December  2021","isJournal":true,"volume":"28","issue":"6","publicationDate":"December 2021","dateOfInsertion":"24 January 2022","htmlLink":"/document/9690635/","journalDisplayDateOfPublication":"December  2021","htmlAbstractLink":"/document/9690635/","fundingAgencies":{"fundingAgency":[{"fundingId":"10.13039/501100004543","fundingName":"Chinese Scholarship Council (CSC)"},{"fundingId":"10.13039/501100001773","fundingName":"UNSW Digital Grid Futures Institute"},{"fundingId":"10.13039/501100000923","fundingName":"Australian Research Council's Discovery Project","grantNumber":"DP210102169"},{"fundingId":"10.13039/100004807","fundingName":"DFG","grantNumber":"SCHO 831/15-1"}]},"openAccessFlag":"F","title":"Smart and Reconfigurable Wireless Communications: From IRS Modeling to Algorithm Design","sourcePdf":"026XU1_LAYOUT.pdf","content_type":"Journals & Magazines","mlTime":"PT0.063086S","chronDate":"December  2021","xplore-pub-id":"7742","isNumber":"9690141","rightsLinkFlag":"1","contentType":"periodicals","publicationNumber":"7742","xplore-issue":"9690141","articleId":"9690635","contentTypeDisplay":"Magazines","publicationYear":"2021","subType":"IEEE Magazine","lastupdate":"2022-01-26"}]