[{"_id":5903299,"references":[{"order":"1","text":"P. P. Vaidyanathan, Muliiraie Systems and Filter Banks, Englewood Cliffs, NJ:Prentice-Hall, 1993.","title":"Muliiraie Systems and Filter Banks","context":[{"sec":"sec1","text":"Critically sampled (also called maximally decimated) filter banks [1] provide subband signal representations with no redundancy.","part":"1"},{"sec":"sec2a","text":"Oversampled uniform filter banks, like maximally decimated ones, can be studied using the polyphase representation [1], which is shown in Fig. 1.","part":"1"},{"sec":"sec2a","text":" The losslessness is reflected in the frequency responses of a PUFB, which are power-complementary [1], i.e.","part":"1"}],"refType":"biblio","id":"ref1"},{"order":"2","text":"F. Labeau, J.-C. Chiang, M. Kieffer, P. Duhamel, L. Vandendorpe and B. Macq, \"Oversampled filter banks as error correcting codes: Theory and impulse noise correction\", <em>IEEE Trans. Signal Processing</em>, vol. 53, no. 12, pp. 4619-4630, December 2005.","title":"Oversampled filter banks as error correcting codes: Theory and impulse noise correction","context":[{"sec":"sec1","text":"Firstly, it can be exploited for error-resilient coding for transmission over unreliable channels [2], [3].","part":"1"}],"links":{"documentLink":"/document/1542488","pdfSize":"561KB"},"refType":"biblio","id":"ref2"},{"order":"3","text":"J. Kovacevic, P. L. Dragotti and V. K. Goyal, \"Filter bank frame expansions with erasures\", <em>IEEE Trans. Inform. Theory</em>, vol. 48, no. 6, pp. 1439-1450, June 2002.","title":"Filter bank frame expansions with erasures","context":[{"sec":"sec1","text":"Firstly, it can be exploited for error-resilient coding for transmission over unreliable channels [2], [3].","part":"1"},{"sec":"sec1","text":" Moreover, in some applications, it has been proved that PUFBs perform best [3].","part":"1"}],"links":{"documentLink":"/document/1003832","pdfSize":"413KB"},"refType":"biblio","id":"ref3"},{"order":"4","text":"Z. Cvetkovic and M. Vetterli, \"Oversampled filter banks\", <em>IEEE Trans. Signal Processing</em>, vol. 46, no. 5, pp. 1245-1255, May 1998.","title":"Oversampled filter banks","context":[{"sec":"sec1","text":" Oversampled filter banks are considered as sources of rich sets of atoms for matching pursuit algorithms [4].","part":"1"},{"sec":"sec1","text":"Finally, wavelet transforms realized by iterating over-sampled filter banks exhibit shift-invariance [4].","part":"1"}],"links":{"documentLink":"/document/668788","pdfSize":"435KB"},"refType":"biblio","id":"ref4"},{"order":"5","text":"L. Gan and K.-K. Ma, \"Time-domain oversampled lapped transforms: Theory structure and application in image coding\", <em>IEEE Trans. Signal Processing</em>, vol. 52, no. 10, pp. 2762-2775, October 2004.","title":"Time-domain oversampled lapped transforms: Theory, structure, and application in image coding","context":[{"sec":"sec1","text":"In recent years, several approaches for designing oversampled filter banks have been developed, among which are those giving linear phase filters [5]–[7].","part":"1"},{"sec":"sec2c","text":"In [5], Sec.","part":"1"},{"sec":"sec3b","text":" However, the number of degrees of freedom is the same as in the alternative matrix parameterizations described in [5].","part":"1"}],"links":{"documentLink":"/document/1337245","pdfSize":"1319KB"},"refType":"biblio","id":"ref5"},{"order":"6","text":"T. Tanaka and Y. Yamashita, \"The generalized lapped pseudo-biorthogonal transform: Oversampled linear-phase perfect reconstruction filterbanks with lattice structures\", <em>IEEE Trans. Signal Processing</em>, vol. 52, no. 2, pp. 434-446, February 2004.","title":"The generalized lapped pseudo-biorthogonal transform: Oversampled linear-phase perfect reconstruction filterbanks with lattice structures","context":[{"sec":"sec1","text":"In recent years, several approaches for designing oversampled filter banks have been developed, among which are those giving linear phase filters [5]–[6][7].","part":"1"}],"links":{"documentLink":"/document/1261330","pdfSize":"440KB"},"refType":"biblio","id":"ref6"},{"order":"7","text":"L. Gan and K.-K. Ma, \"Oversampled linear-phase perfect reconstruction filterbanks: Theory lattice structure and parameterization\", <em>IEEE Trans. Signal Processing</em>, vol. 51, no. 3, pp. 744-759, March 2003.","title":"Oversampled linear-phase perfect reconstruction filterbanks: Theory, lattice structure and parameterization","context":[{"sec":"sec1","text":"In recent years, several approaches for designing oversampled filter banks have been developed, among which are those giving linear phase filters [5]–[7].","part":"1"},{"sec":"sec2b","text":"The fact that the impulse responses of OLPPUFBs are (anti)symmetric has been exploited to develop the following factorization for critically sampled systems with even numbers of channels [7] 11It should be noted that [7] generalizes the results of many earlier works on the subject, which are not cited here for brevity.:\n where\n and\n A computational structure for the synthesis filter bank results from multiplying the inverses of the factorization components in reverse order.","part":"1"},{"sec":"fn1","text":"It should be noted that [7] generalizes the results of many earlier works on the subject, which are not cited here for brevity.","type":"footnote"},{"sec":"sec2b","text":"Such a factorization describes systems that have been classified as Type I OLPPUFBs in [7].","part":"1"}],"links":{"documentLink":"/document/1179770","pdfSize":"1254KB"},"refType":"biblio","id":"ref7"},{"order":"8","text":"M. Parfieniuk and A. Petrovsky, \"Quaternionic lattice structures for four-channel paraunitary filter banks\", <em>EURASIP J. Adv. Signal Process. Special Issue on Mulliraie Systems and Applications</em>, vol. 2007, pp. 12, 2007.","title":"Quaternionic lattice structures for four-channel paraunitary filter banks","context":[{"sec":"sec1","text":" Quaternionic approach, which has already proved to be useful for maximally decimated filter banks [8], [9], is extended to the case of oversampling.","part":"1"},{"sec":"sec2d","text":" This approach has been successfully applied to maximally decimated 4- and 8-channel PUFBs [8], [9], [12], so it is worth investigating in the new context of oversampled systems.","part":"1"},{"sec":"sec3b","text":"The \\$4\\times 4\\$ shapes of both submatrices of \\$\\Phi_{i}\\$ in (10) are exploited in the derivation, together with the fact that a 4 \\$\\times 4\\$ orthogonal matrix can be parameterized using two quaternions [8].","part":"1"}],"links":{"crossRefLink":"https://doi.org/10.1155/2007/37481"},"refType":"biblio","id":"ref8"},{"order":"9","text":"M. Parfieniuk, \"Quaternionic approach to the one-regular eight-band linear phase paraunitary filter banks\", <em>Proc. 14th. European Signal Processing Conf. (EUSIPCa)</em>, 4–8 September 2006.","title":"Quaternionic approach to the one-regular eight-band linear phase paraunitary filter banks","context":[{"sec":"sec1","text":" Quaternionic approach, which has already proved to be useful for maximally decimated filter banks [8], [9], is extended to the case of oversampling.","part":"1"},{"sec":"sec2d","text":" This approach has been successfully applied to maximally decimated 4- and 8-channel PUFBs [8], [9], [12], so it is worth investigating in the new context of oversampled systems.","part":"1"}],"refType":"biblio","id":"ref9"},{"order":"10","text":"Z. Doganata, P. P. Vaidyanathan and T. Q. Nguyen, \"General synthesis procedure for FIR lossless transfer matrices for perfect-reconstruction multirate filterbank applications\", <em>IEEE Trans. Acoust. Speech Signal Processing</em>, vol. 36, no. 10, pp. 1561-1574, October 1988.","title":"General synthesis procedure for FIR lossless transfer matrices, for perfect-reconstruction multirate filterbank applications","context":[{"sec":"sec2c","text":"Regardless of particular realization, (\\${^{m}_{2})-(^{m-n}_{2}}\\$) degrees of design freedom are associated with an \\$m\\times n\\$ orthogonal matrix [10].","part":"1"}],"links":{"documentLink":"/document/7544","pdfSize":"1247KB"},"refType":"biblio","id":"ref10"},{"order":"11","text":"P. P. Vaidyanathan, \"On coefficient-quantization and computational roundoff effects in lossless multirate filter banks\", <em>IEEE Trans. Signal Processing</em>, vol. 39, no. 4, pp. 1006-1008, April 1991.","title":"On coefficient-quantization and computational roundoff effects in lossless multirate filter banks","context":[{"sec":"sec2d","text":" In the general case, an orthogonal matrix loses this property, because the norms of columns and rows become unequal [11].","part":"1"},{"sec":"sec3b","text":" Thus, the column norms of the matrices are always constant, so that the product of the matrices is orthogonal transformation regardless of their element quantization [11].","part":"1"}],"links":{"documentLink":"/document/80940","pdfSize":"282KB"},"refType":"biblio","id":"ref11"},{"order":"12","text":"M. Parfieniuk and A. Petrovsky, \"Hypercomplex factorizations for 8-channel linear phase paraunitary filter banks\", <em>Proc. 7th Int. Conf. and Exhibition “Digital Signal Processing and its Applications” (DSPA)</em>, vol. 2, pp. 509-513, 16–18 March 2005.","title":"Hypercomplex factorizations for 8-channel linear phase paraunitary filter banks","context":[{"sec":"sec2d","text":" This approach has been successfully applied to maximally decimated 4- and 8-channel PUFBs [8], [9], [12], so it is worth investigating in the new context of oversampled systems.","part":"1"},{"sec":"sec3b","text":" Thus, the result for the latter of [12] can be directly used in cases when \\$S<M=8\\$.","part":"1"},{"sec":"sec3c","text":"It has been shown in [12], that in the case of maximal decimation, the insensitivity of E0 to coefficient quantization can be obtained by taking\n where \\$p_{0}, q_{0}, r_{0}\\$, and so are unit quaternions.","part":"1"}],"refType":"biblio","id":"ref12"},{"order":"13","text":"I. L. Kantor and A. S. Solodovnikov, Hypercomplex Numbers: an Elementary Introduction to Algebras, New York, NY:Springer, 1989.","title":"Hypercomplex Numbers: an Elementary Introduction to Algebras","context":[{"sec":"sec3a","text":"Quaternions are hypercomplex numbers of the form [13]\n with one real and three imaginary parts.","part":"1"}],"refType":"biblio","id":"ref13"},{"order":"14","text":"W. R. Hamilton, \"On quaternions; or on a new system of imaginaries in algebra\", <em>The London Edinburgh and Dublin Philosophical Magazine and Journal of Science</em>, vol. 25, pp. 489-495, 1844.","title":"On quaternions; or on a new system of imaginaries in algebra","context":[{"sec":"sec3a","text":"For parameterizing all quaternions of modulus \\$\\vert q\\vert = \\sqrt{q_{1}^{2}+q_{2}^{2}+q_{3}^{2}+q_{4}^{2}}\\$, their polar representation [14]\n is useful, where the angles: \\$0\\leq\\phi<2_{71^{{\\rm n}}}, 0\\leq\\psi\\leq \\pi\\$ and \\$0\\leq\\chi\\leq \\pi\\$ are three degrees of freedom.","part":"1"}],"refType":"biblio","id":"ref14"},{"order":"15","text":"C. D. Meyer, Matrix Analysis and Applied Linear Algebra, Philadelphia, PA:SIAM, 2000.","title":"Matrix Analysis and Applied Linear Algebra","context":[{"sec":"sec3c","text":" Given a vector \\${\\rm x}\\in {BBR}^{n}\\$ such that \\$\\Vert x\\Vert=1\\$, an orthonormal basis for \\${BBR}^{n}\\$ that contains x can be found by sequentially annihilating its second and subsequent elements with plane rotations [15], Example 5.6.6].","part":"1"}],"links":{"crossRefLink":"https://doi.org/10.1137/1.9780898719512"},"refType":"biblio","id":"ref15"}],"articleNumber":"5903299","issueLink":"/xpl/tocresult.jsp?isnumber=null","formulaStrippedArticleTitle":"Design of eight-band oversampled linear phase paraunitary filter banks using quaternion multiplication matrices","publisher":"IEEE","displayDocTitle":"Design of eight-band oversampled linear phase paraunitary filter banks using quaternion multiplication matrices","htmlAbstractLink":"/document/5903299/","isConference":true,"isStaticHtml":true,"htmlLink":"/document/5903299/","xploreDocumentType":"Conference Publication","isDynamicHtml":true,"articleId":"5903299","openAccessFlag":"F","title":"Design of eight-band oversampled linear phase paraunitary filter banks using quaternion multiplication matrices","contentTypeDisplay":"Conferences","mlTime":"PT0.138275S","lastupdate":"2021-07-23","contentType":"conferences","definitions":"false","publicationNumber":"5871958"},{"_id":5903301,"references":[{"order":"1","text":"T. Schorr et al., \"Performance Comparison of MLSE and Iterative Equalization in FEC Systems for PMD Channels\", <em>Proc. IEEE Signal Processing'2006</em>, pp. 49-54, 2006.","title":"Performance Comparison of MLSE and Iterative Equalization in FEC Systems for PMD Channels","context":[{"sec":"sec1","text":" To mitigate ISI in a narrow-band system, adaptive equalization is a well known approach, including feed forward and decision feedback equalization, maximum-likelihood sequence estimation (MLSE) using a Viterbi algorithm (VA) equalizer or TE [1], [2].","part":"1"},{"sec":"sec1","text":" However, the component codes, usually punctured CC, have to be chosen carefully by applying EXIT chart methods [1].","part":"1"},{"sec":"sec2","text":"As explained in [1], the VA can serve as an MLSE equalizer, but it will not provide soft-out information for individual symbols.","part":"1"},{"sec":"sec2","text":"Using Monte-Carlo simulations, \\$f(x_{e}, x_{a})\\$ can be derived e.g. from histogram methods [1].","part":"1"},{"sec":"sec2","text":" Note that a one-tap integrating precoder will not increase the equalizer complexity, but the resulting EXIT function is changed significantly and achieves mutual information \\$X_{a}=X_{e}=1\\$ [1].","part":"1"},{"sec":"sec2","text":" The impulse response of a PMD channel with differential group delay \\$\\Delta\\tau\\$ is given by [1] \n\nFig. 3:\nEXIT functions of BCJR equalized PMD channels with and without precoder\n\n.","part":"1"},{"sec":"sec4","text":"Generally, EXIT functions \\$I_{e}=X_{D}(I_{a})\\$ of codes and decoders are obtained by Monte-Carlo simulation of the decoding process [1].","part":"1"}],"refType":"biblio","id":"ref1"},{"order":"2","text":"W. Sauer-Greff et al., \"Adaptive Viterbi Equalizers for Nonlinear Channels\", <em>Proc. IEEE Signal Processing'2000 Poznan</em>, pp. 25-29, 2000.","title":"Adaptive Viterbi Equalizers for Nonlinear Channels","context":[{"sec":"sec1","text":" To mitigate ISI in a narrow-band system, adaptive equalization is a well known approach, including feed forward and decision feedback equalization, maximum-likelihood sequence estimation (MLSE) using a Viterbi algorithm (VA) equalizer or TE [1], [2].","part":"1"}],"refType":"biblio","id":"ref2"},{"order":"3","text":"R. van Nee and R. Prassad, OFDM for Wireless Multimedia Communications, Artech House Publishers, 2000.","title":"OFDM for Wireless Multimedia Communications","context":[{"sec":"sec1","text":" For broadband broadcast systems, time and frequency interleaving in combination with FEC channel coding enables reliable reception, and coded orthogonal frequency division multiplexing (COFDM) is a well-known implementation of this concept [3].","part":"1"},{"sec":"sec1","text":" COFDM systems inherently utilize these diversities, provided the OFDM guard interval cover the maximum path or delay spread [3].","part":"1"}],"refType":"biblio","id":"ref3"},{"order":"4","text":"T. Schorr et al., \"Diorama - An Open Source Digital Radio Mondiale (DRM) Receiver using MATLAB\", <em>Proc. IEEE Signal Processing'2005</em>, pp. 13-18, 2005.","title":"Diorama - An Open Source Digital Radio Mondiale (DRM) Receiver using MATLAB","context":[{"sec":"sec1","text":" COFDM is applied e.g. in digital terrestrial video broadcasting (DVB-T), Digital Audio Broadcasting (DAB), and DRM for the long, medium and short wave bands [4].","part":"1"},{"sec":"sec6","text":"In a COFDM system each subcarrier has to be synchronized, equalized and sampled at the receiver side [4].","part":"1"}],"refType":"biblio","id":"ref4"},{"order":"5","text":"A. Paulraj, \"Diversity Techniques\" in The Mobile Communications Handbook, CRC Press, IEEE Press, 1996.","title":"Diversity Techniques","context":[{"sec":"sec1","text":"Receiver concepts for frequency diversity and antenna diversity usually apply combining techniques, where either the most reliable analog signal is selected (selection diversity), the received signals are added (equal gain combining) or the signals are weighted by their individual SNR and then summed up (MRC) [5].","part":"1"}],"refType":"biblio","id":"ref5"},{"order":"6","text":"T. Richardson et al., \"Design of Capacity-Approaching Irregular Low-Density Parity-Check codes\", <em>IEEE Trans. on Inf. Theory</em>, vol. 47, no. 2, pp. 619-637, Feb. 2001.","title":"Design of Capacity-Approaching Irregular Low-Density Parity-Check codes","context":[{"sec":"sec1","text":"Instead of applying CC with high code rates, it is also reasonable to investigate LDPC codes as channel codes for TE, due to their near optimum performance on additive white Gaussian noise (AWGN) channels [6].","part":"1"},{"sec":"sec3","text":" Then iterative decoding means alternately soft decoding of the repetition code, i.e.  and the parity check code  where \\$\\Lambda_{c}\\$ and \\$\\Lambda_{v}\\$ are LLR values of check and variable nodes \\$c\\$ and \\$v\\$, respectively. \\$\\Lambda_{ch}\\$ and \\$\\Lambda_{a}\\$ denote channel input and a-priory LLRs, respectively [6].","part":"1"},{"sec":"sec4","text":" Instead, the pdf \\$p_{\\Lambda_{e}}\\$ is calculated using so called density evolution [6].","part":"1"},{"sec":"sec4","text":" We define  where \\$p\\$ is a pdf, \\$\\tilde{\\lambda}_{i}\\$ is the fraction of nodes with variable degree \\$i, \\otimes^{i}\\$ represents the \\$i\\$-fold convolution. \\$\\Gamma\\$ and \\$\\Gamma^{-1}\\$ are density evolution operators defined in [6].","part":"1"},{"sec":"sec4","text":" This global optimization problem can be solved using differential evolution [6].","part":"1"}],"links":{"documentLink":"/document/910578","pdfSize":"505KB"},"refType":"biblio","id":"ref6"},{"order":"7","text":"L.R. Bahl et al., \"Optimal decoding of linear codes for minimizing symbol error rate\", <em>IEEE Trans. Inform. Theory</em>, vol. 20, pp. 284-287, March 1974.","title":"Optimal decoding of linear codes for minimizing symbol error rate","context":[{"sec":"sec2","text":" To obtain them, an optimum maximum-a-posteriori symbol-by-symbol estimator (MAP-SSE) like the so-called Bahl-Cocke-Jelinek-Raviv (BCJR) algorithm with twice the complexity of the VA has to be applied [7].","part":"1"}],"links":{"documentLink":"/document/1055186","pdfSize":"440KB"},"refType":"biblio","id":"ref7"},{"order":"8","text":"S. ten Brink, \"Convergence behavior of iteratively decoded parallel concatenated codes\", <em>IEEE Transactions on Communications</em>, vol. 49, no. 10, pp. 1727-1737, Oct. 2001.","title":"Convergence behavior of iteratively decoded parallel concatenated codes","context":[{"sec":"sec2","text":"The iteration process can be visualized by EXIT charts, where the mutual information of one decoder is plotted versus its a-priori input, i.e. the mutual information of the other decoder [8].","part":"1"}],"links":{"documentLink":"/document/957394","pdfSize":"309KB"},"refType":"biblio","id":"ref8"},{"order":"9","text":"R.G. Gallager, \"Low density parity check codes\", <em>IRE Trans. Inform. Theory</em>, vol. IT-8, pp. 21-28, Jan. 1962.","title":"Low density parity check codes","context":[{"sec":"sec3","text":" Among them were not only turbo codes, but also the block codes, whose excellent properties were demonstrated many years after their first discovery by Gallager in 1962 — so called LDPC codes, unequivocally defined by very sparse parity-check matrices [9].","part":"1"}],"links":{"documentLink":"/document/1057683","pdfSize":"1001KB"},"refType":"biblio","id":"ref9"},{"order":"10","text":"S.-Y. Chung et al., \"On the Design of Low Density Parity Check Codes within 0.0045 dB of the Shannon Limit\", <em>IEEE Communications Letters</em>, vol. 5, pp. 58-60, Feb. 2001.","title":"On the Design of Low Density Parity Check Codes within 0.0045 dB of the Shannon Limit","context":[{"sec":"sec3","text":" Using the decoding methods presented by Gallager and properly selected construction techniques of LDPC codes, it succeeded to approach the Shannon limit of the binary-input AWGN channel within 0.0045 dB [10].","part":"1"}],"links":{"documentLink":"/document/905935","pdfSize":"92KB"},"refType":"biblio","id":"ref10"},{"order":"11","text":"Press Releases, <em>10Gbase-T Achieves Standards Ratification</em>, June 2006,  [online]  Available: www.ethernetalliance.org/news_events/press_release/press_061306.","title":"10Gbase-T Achieves Standards Ratification","context":[{"sec":"sec3","text":" LDPC encoding and decoding, using code words of length 2048 bits (therein 325 parity bits) became a part of the IEEE 802.3an standard for 10 Gbps Ethernet over UTP (10Gbase-T Ethernet), ratified in June 2006 [11].","part":"1"}],"refType":"biblio","id":"ref11"},{"order":"12","text":"T. Richardson et al., \"The renaissance of Gallager's low-density parity-check codes\", <em>IEEE Commun. Mag.</em>, vol. 41, no. 8, pp. 126-131, Aug. 2003.","title":"The renaissance of Gallager's low-density parity-check codes","context":[{"sec":"sec3","text":" [12].","part":"1"}],"links":{"documentLink":"/document/1222728","pdfSize":"95KB"},"refType":"biblio","id":"ref12"},{"order":"13","text":"T. Schorr et al., \"Design and Performance of High-Rate Irregular LDPC Codes for Turbo Equalization of PMD Channels\", <em>Proc. of OFC 2007 JWA47</em>, 2007.","title":"Design and Performance of High-Rate Irregular LDPC Codes for Turbo Equalization of PMD Channels","context":[{"sec":"sec3","text":" Considering the PMD channel (3) with precoding, the channel EXIT functions shows that a tunnel starts to open only for high OSNR, see Fig. 6 [13].","part":"1"}],"links":{"documentLink":"/document/4348434","pdfSize":"282KB"},"refType":"biblio","id":"ref13"},{"order":"14","text":"H. Haunstein et al., \"Performance Comparison of MLSE and Iterative Equalization in FEC Systems for PMD Channels with Respect to Implementation Complexity\", <em>IEEE Journal of Lightwave Technology</em>, vol. 24, pp. 4047-4054, Nov. 2006.","title":"Performance Comparison of MLSE and Iterative Equalization in FEC Systems for PMD Channels with Respect to Implementation Complexity","context":[{"sec":"sec1","text":" Recent simulation results for TE have shown a considerable gain compared to MLSE equalization using the VA, see Fig. 2 [14].","part":"1"},{"sec":"sec5","text":" For all simulations the Max-Log version of the BCJR equalizer, a TE code rate of 0.93 and an outer Reed-Solomon (RS) (255, 247) code with block size 32640 leading to an overall code rate of 0.9 are used [14].","part":"1"}],"links":{"documentLink":"/document/4012197","pdfSize":"363KB"},"refType":"biblio","id":"ref14"}],"articleNumber":"5903301","issueLink":"/xpl/tocresult.jsp?isnumber=null","formulaStrippedArticleTitle":"LDPC code optimization for diversity reception and turbo equalization","publisher":"IEEE","displayDocTitle":"LDPC code optimization for diversity reception and turbo equalization","htmlAbstractLink":"/document/5903301/","htmlLink":"/document/5903301/","isStaticHtml":true,"isConference":true,"xploreDocumentType":"Conference Publication","isDynamicHtml":true,"articleId":"5903301","openAccessFlag":"F","title":"LDPC code optimization for diversity reception and turbo equalization","contentTypeDisplay":"Conferences","mlTime":"PT0.182418S","lastupdate":"2021-09-10","contentType":"conferences","definitions":"false","publicationNumber":"5871958"},{"_id":5903302,"references":[{"order":"1","text":"A. Lopez-Beltran, G. Sauter, T. Gasser et al., \"Infiltrating urothelial carcinoma\" in WHO classification of tumours. Pathology and genetics. Tumours of the urinary system and male genital organs, Lyon, France7:IARC Press, pp. 97-104, 2004.","title":"Infiltrating urothelial carcinoma","context":[{"sec":"sec1","text":" These include the environmental carcinogen hazards, such as smoking, medicines, industrial chemicals, and also a biological disposition of the organism (age, sex, psychophysical condition) during the diagnosis, as well as grading, staging and lymphnode status, and morphological features of the process in macro-and microscopic point of view (size, histological type, and the way of infiltration) [1], [2].","part":"1"}],"refType":"biblio","id":"ref1"},{"order":"2","text":"S. F. Shariat, P.I. Karakiewicz, G.S. Palapattu, G.E. Amiel, Y. Lota, n. C.G. Rogers, et al., \"Lerner. Nomograms Provide Improved Accuracy for Predicting Survival after Radical Cystectomy\", <em>Clin Cancer Res</em>, vol. 12, no. 22, pp. 6663-76, November 2006.","title":"Lerner. Nomograms Provide Improved Accuracy for Predicting Survival after Radical Cystectomy","context":[{"sec":"sec1","text":" These include the environmental carcinogen hazards, such as smoking, medicines, industrial chemicals, and also a biological disposition of the organism (age, sex, psychophysical condition) during the diagnosis, as well as grading, staging and lymphnode status, and morphological features of the process in macro-and microscopic point of view (size, histological type, and the way of infiltration) [1], [2].","part":"1"},{"sec":"sec4","text":" In our study, the obtained error of the survival prediction for both the training and validation sets is considerably lower than that published in [2].","part":"1"}],"links":{"crossRefLink":"https://doi.org/10.1158/1078-0432.CCR-06-0372"},"refType":"biblio","id":"ref2"},{"order":"3","text":"P. I. Karakiewicz, S.F. Shariat, G.S. Palapattu, A.E. Gilad, Y. Lotan, C.G. Rogers, et al., \"Nomogram for predicting disease recurrence after radical cystectomy for Transitional Cell Carcinoma of the Bladder\", <em>J Urol</em>, vol. 176, pp. 1354-1362, October 2006.","title":"Nomogram for predicting disease recurrence after radical cystectomy for Transitional Cell Carcinoma of the Bladder","context":[{"sec":"sec1","text":" Significant is a reaction to the taken treatment and also the time period from starting optimal treatment up to appearing recurrence symptoms [3].","part":"1"}],"links":{"crossRefLink":"https://doi.org/10.1016/j.juro.2006.06.025"},"refType":"biblio","id":"ref3"},{"order":"4","text":"T. Habuchi, M. Marberger, M.J. Droller et al., \"Prognostic markers for bladder cancer: International “Consensus Panel on Bladder Tumor Markers”\", <em>Urology</em>, vol. 66, pp. 64-74, 2005.","title":"Prognostic markers for bladder cancer: International “Consensus Panel on Bladder Tumor Markers”","context":[{"sec":"sec1","text":" As the prognostic assessment of a tumor permits the precise planning of the treatment, new efforts are still undertaken to indicate new factors [4].","part":"1"}],"links":{"crossRefLink":"https://doi.org/10.1016/j.urology.2005.08.065"},"refType":"biblio","id":"ref4"},{"order":"5","text":"J. »urada, \"Introduction to Artificial Neural Networks\" in , West Publishing Company, 1992.","title":"Introduction to Artificial Neural Networks","context":[{"sec":"sec1","text":" They show ability to train themselves, basing on properly arranged training patterns, and the ability to generalize the acquired knowledge [5] that can be applied in prognostic assessment of new cases.","part":"1"},{"sec":"sec1","text":"There are various types of neural networks and various ways of their implementations [5]–[15].","part":"1"},{"sec":"sec2","text":"Data analysis was made by means of a neural network designed in MATLAB environment, with the use of a multilayer perceptron model widely applied to the prediction tasks [5].","part":"1"},{"sec":"sec2","text":"It was decided to apply the method of cumulative updating the network weights using a cumulative error gradient [5].","part":"1"},{"sec":"sec2","text":" In the training cycles, the number of iterations ranged from 250 to 1000, starting from a randomized set of weights [5] laying in the interval from-1 to 1.","part":"1"},{"sec":"sec2","text":" The training process was stopped when the error mean-square function graph reached a minimum for the given validation set [5].","part":"1"},{"sec":"sec4","text":"Literature data show that one of methods of determining initial number of neurons in the hidden layer is to assume its value equal to a half of the sum of input and output neurons [5].","part":"1"}],"refType":"biblio","id":"ref5"},{"order":"6","text":"G. Cauwenberghs and M. Bayoumi, \"Learning on silicon adaptive VLSI neural systems\" in , Kluwer Academic Publishers, 1999.","title":"Learning on silicon, adaptive VLSI neural systems","context":[{"sec":"sec1","text":"There are various types of neural networks and various ways of their implementations [5]–[6][15].","part":"1"}],"refType":"biblio","id":"ref6"},{"order":"7","text":"W. Maass and C. Bishop, \"Pulsed neural networks\" in Massachusetts Institute of Technology, The MIT Press, 1999.","title":"Pulsed neural networks","context":[{"sec":"sec1","text":"There are various types of neural networks and various ways of their implementations [5]–[7][15].","part":"1"}],"refType":"biblio","id":"ref7"},{"order":"8","text":"T. Kohonen, \"Self-organizing maps\" in , Berlin Heidelberg:Springer Verlag, 2001.","title":"Self-organizing maps","context":[{"sec":"sec1","text":"There are various types of neural networks and various ways of their implementations [5]–[8][15].","part":"1"}],"refType":"biblio","id":"ref8"},{"order":"9","text":"R Długosz, T Talaśka and R Wojtyna, \"New Binary-Tree-Based Winner-Takes-All Circuit for Learning on Silicon Kohonen's Networks\", <em>ternational Conference On Signals And Electronic Systems (ICSES)</em>, 2006.","title":"New Binary-Tree-Based Winner-Takes-All Circuit for Learning on Silicon Kohonen's Networks","context":[{"sec":"sec1","text":"There are various types of neural networks and various ways of their implementations [5]–[9][15].","part":"1"}],"refType":"biblio","id":"ref9"},{"order":"10","text":"T Talaśka, R D‚ugosz and W Pedrycz, \"Adaptive Weight Change Mechanism for Kohonens's Neural Network Implemented in CMOS 0.18 μm Technology\", <em>11th European Symposium on Artificial Neural Networks</em>, 2007.","title":"Adaptive Weight Change Mechanism for Kohonens's Neural Network Implemented in CMOS 0.18 μm Technology","context":[{"sec":"sec1","text":"There are various types of neural networks and various ways of their implementations [5]–[10][15].","part":"1"}],"refType":"biblio","id":"ref10"},{"order":"11","text":"T Talaśka, R D‚ugosz and R Wojtyna, \"Current mode analog Kohonen neural network\", <em>ternational conference Mixed Design of Integrated Circuits and Systems</em>, 2007.","title":"Current mode analog Kohonen neural network","context":[{"sec":"sec1","text":"There are various types of neural networks and various ways of their implementations [5]–[11][15].","part":"1"}],"refType":"biblio","id":"ref11"},{"order":"12","text":"J. T Wei, Z. Zhang, S. D. Barnhill, K. R Madyastha, H. Zhang and J.E. Oesterling, \"Understanding artificial neural networks and exploring their potential applications for the practicing urologist\", <em>Urology</em>, vol. 52, no. 2, 1998.","title":"Understanding artificial neural networks and exploring their potential applications for the practicing urologist","context":[{"sec":"sec1","text":"There are various types of neural networks and various ways of their implementations [5]–[12][15].","part":"1"}],"links":{"crossRefLink":"https://doi.org/10.1016/S0090-4295(98)00181-2"},"refType":"biblio","id":"ref12"},{"order":"13","text":"A. Tewari and P. Narayan, \"Nowel staging tool for localized prostate cancer: A pilot study using genetic adaptive neural networks\", <em>Journal of Urology</em>, vol. 160, no. 2, 1998.","title":"Nowel staging tool for localized prostate cancer: A pilot study using genetic adaptive neural networks","context":[{"sec":"sec1","text":"There are various types of neural networks and various ways of their implementations [5]–[13][15].","part":"1"}],"links":{"crossRefLink":"https://doi.org/10.1016/S0022-5347(01)62916-1"},"refType":"biblio","id":"ref13"},{"order":"14","text":"V.A. Magnotta, D. Heckel, N.C. Andreasen, T. Cizadlo, P.W. Corson, J.C. Ehrhardt, et al., \"Measurement of brain structures with artificial neural networks: Two- and three-dimensional applications\", <em>Radiology</em>, vol. 211, no. 3, 1999.","title":"Measurement of brain structures with artificial neural networks: Two- and three-dimensional applications","context":[{"sec":"sec1","text":"There are various types of neural networks and various ways of their implementations [5]–[14][15].","part":"1"}],"links":{"crossRefLink":"https://doi.org/10.1148/radiology.211.3.r99ma07781"},"refType":"biblio","id":"ref14"},{"order":"15","text":"R. Tadeusiewicz and M. Ogiela, \"Medical image understanding technology: Artificial intelligence and soft-computing for image understanding\" in Studies in fuzziness & soft computing, Berlin Heidelberg New York, VIII:Springer Verlag, vol. 156, 2004.","title":"Medical image understanding technology: Artificial intelligence and soft-computing for image understanding","context":[{"sec":"sec1","text":"There are various types of neural networks and various ways of their implementations [5]–[15].","part":"1"}],"refType":"biblio","id":"ref15"},{"order":"16","text":"A. Khashman and K. Dimililer, \"Neural Network Arbitration for Optimum DCT Image Compression\", <em>Eurocon 2007</em>, September 2007.","title":"Neural Network Arbitration for Optimum DCT Image Compression","context":[{"sec":"sec2","text":" The method of error back–propagation enriched with a momentum coefficient was applied as a training algorithm, due to its implementation simplicity, and the availability of sufficient “input / target” database for training this supervised learner [16].","part":"1"},{"sec":"sec2","text":" Such an approach is known in the literature [16].","part":"1"}],"links":{"documentLink":"/document/4400236","pdfSize":"1413KB"},"refType":"biblio","id":"ref16"}],"articleNumber":"5903302","issueLink":"/xpl/tocresult.jsp?isnumber=null","formulaStrippedArticleTitle":"Optimization of hidden layer in a neural network used to predict bladder-cancer patient-survival","publisher":"IEEE","htmlAbstractLink":"/document/5903302/","isStaticHtml":true,"isConference":true,"htmlLink":"/document/5903302/","xploreDocumentType":"Conference Publication","isDynamicHtml":true,"displayDocTitle":"Optimization of hidden layer in a neural network used to predict bladder-cancer patient-survival","articleId":"5903302","openAccessFlag":"F","title":"Optimization of hidden layer in a neural network used to predict bladder-cancer patient-survival","contentTypeDisplay":"Conferences","mlTime":"PT0.155603S","lastupdate":"2021-11-13","contentType":"conferences","definitions":"false","publicationNumber":"5871958"},{"_id":5903304,"references":[{"order":"1","text":"Y. Mostofi and D.C. Cox, \"Timing Synchronization in High Mobility OFDM Systems\", <em>Proc. IEEE Int. Conf. Commun.</em>, vol. 4, pp. 2402-2406, Jun. 2004.","title":"Timing Synchronization in High Mobility OFDM Systems","context":[{"sec":"sec2a","text":" Applying the results given in [1]–[2] and after some manipulations the total interference power caused by ICI can be obtained by:\n Also, interference power due to ISI can be represented by:\n Consequently, we express SIR caused by ISI and ICI as follows:\n From (5), two types of ICI are produced by: 1- mobility of the system and 2- timing synchronization error [1].","part":"1"}],"links":{"documentLink":"/document/1312949","pdfSize":"296KB"},"refType":"biblio","id":"ref1"},{"order":"2","text":"Y. Mostofi and D.C. Cox, \"Mathematical Analysis of Impact of Timing Synchronization Errors on the Performance of an OFDM System\", <em>IEEE Trans. Commun</em>, vol. 54, no. 2, pp. 226-230, Feb. 2006.","title":"Mathematical Analysis of Impact of Timing Synchronization Errors on the Performance of an OFDM System","context":[{"sec":"sec1","text":"Authors in [2] by using CPre, as a guard interval, have provided exact formulas for SIR in terms of timing error.","part":"1"},{"sec":"sec1","text":" In this paper, first by assuming the conditions of [2] (utilizing CPre as a guard interval) we find signal-to-interference ratio caused by ISI and different types of ICI.","part":"1"},{"sec":"sec2a","text":" In [2] SIR for this case given by:\n where \\$\\sigma_{H}^{2}=\\overline{H_{k}H_{k}^{\\ast}}=\\sum_{i=0}^{c}(\\sigma_{h_{i}}^{2})\\$ with \\$\\sigma_{h_{i}}^{2}\\$ representing the power of the \\$i{\\rm th}\\$ channel tap.","part":"1"},{"sec":"sec2a","text":" Applying the results given in [1]–[2] and after some manipulations the total interference power caused by ICI can be obtained by:\n Also, interference power due to ISI can be represented by:\n Consequently, we express SIR caused by ISI and ICI as follows:\n From (5), two types of ICI are produced by: 1- mobility of the system and 2- timing synchronization error [1].","part":"1"},{"sec":"sec2b","text":" SIR is given by [2]:\n As \\$^{\\prime\\prime}l^{\\prime}\\$ denotes left side.","part":"1"}],"links":{"documentLink":"/document/1599595","pdfSize":"192KB"},"refType":"biblio","id":"ref2"},{"order":"3","text":"H. Schulze and C. Luders, Theory and Application of OFDM and CDMA, John Wiley & Sons, 2005.","title":"Theory and Application of OFDM and CDMA","context":[{"sec":"sec2c","text":"The presented simulations are based on DAB system (EN300401 2001a), and parameters of transmission mode III [3].","part":"1"}],"links":{"crossRefLink":"https://doi.org/10.1002/0470017406"},"refType":"biblio","id":"ref3"},{"order":"4","text":"J. G. Proakis, Digital Communication, MacGraw-Hill, 2001.","title":"Digital Communication","context":[{"sec":"sec2c","text":" These simulation results are calculated for three channels [4], pp. 631], #1, #2, #3 (Figs. 1, 2 and 3).","part":"1"}],"refType":"biblio","id":"ref4"},{"order":"5","text":"J. J. Van de Beek, M. Sandelland and P. O. Börjesson, \"ML estimation of time and frequency offset in OFDM systems\", <em>IEEE Trans. on Signal Processing</em>, vol. 45, no. 7, pp. 1800-1805, July 1997.","title":"ML estimation of time and frequency offset in OFDM systems","context":[{"sec":"sec1","text":"However, the major drawback of OFDM is its sensitivity to synchronization errors [5].","part":"1"}],"links":{"pdfSize":"227KB"},"refType":"biblio","id":"ref5"}],"articleNumber":"5903304","issueLink":"/xpl/tocresult.jsp?isnumber=null","formulaStrippedArticleTitle":"Timing errors analysis of OFDM systems based on joint Cyclic-prefix and postfix","publisher":"IEEE","displayDocTitle":"Timing errors analysis of OFDM systems based on joint Cyclic-prefix and postfix","htmlAbstractLink":"/document/5903304/","isStaticHtml":true,"isConference":true,"htmlLink":"/document/5903304/","xploreDocumentType":"Conference Publication","isDynamicHtml":true,"articleId":"5903304","openAccessFlag":"F","title":"Timing errors analysis of OFDM systems based on joint Cyclic-prefix and postfix","contentTypeDisplay":"Conferences","mlTime":"PT0.071004S","lastupdate":"2021-07-23","contentType":"conferences","definitions":"false","publicationNumber":"5871958"}]