[{"_id":7613186,"references":[{"order":"1","text":"R. Pappu, B. Recht, J. Taylor and N. Gershenfeld, \"Physical One-Way Functions\", <em>Science</em>, vol. 297, no. 5589, pp. 2026-2030, 2002.","title":"Physical One-Way Functions","context":[{"sec":"sec1","text":" For example, a pioneering study conducted by Pappu et al. proposed the concept of physically unclonable functions (PUFs) utilizing a random distribution of 3D particles contained in a physical object called a token [1].","part":"1"},{"sec":"sec3b","text":" As in a previous work [1], a key can be compared with another using a Hamming or an Euclidean distance.","part":"1"}],"links":{"crossRefLink":"https://doi.org/10.1126/science.1074376"},"refType":"biblio","id":"ref1"},{"order":"2","text":"G. E. Suh and S. Devadas, \"Physical unclonable functions for device authentication and secret key generation\", <em>Proc. Proceedings of the 44th annual Design Automation Conference</em>, pp. 9-14, 2007.","title":"Physical unclonable functions for device authentication and secret key generation","context":[{"sec":"sec1","text":" Further, Suh and Devadas proposed a PUF system based on multiple MUXes and an arbiter [2].","part":"1"}],"refType":"biblio","id":"ref2"},{"order":"3","text":"D. Roy, J. H. Klootwijk, N. Verhaegh, H. Roosen and R. A. M. Wolters, \"Comb Capacitor Structures for On-Chip Physical Uncloneable Function\", <em>Semiconductor Manufacturing IEEE Transactions on</em>, vol. 22, no. 1, pp. 96-102, 2009.","title":"Comb Capacitor Structures for On-Chip Physical Uncloneable Function","context":[{"sec":"sec1","text":" In another study, Roy et al. proposed an on-chip PUF, based on the differences in the capacitance networks between the devices [3]; the system is able to obtain its own unique ID based on the capacitance value of the comb capacitor structures that are mostly determined by randomly distributed dielectric particles (TiO2) and conducting (TiN) particles.","part":"1"}],"links":{"documentLink":"/document/4773489","pdfSize":"1249KB"},"refType":"biblio","id":"ref3"},{"order":"4","text":"J. Guajardo, S. S. Kumar, G.-J. Schrijen and P. Tuyls, \"FPGA Intrinsic PUFs and Their Use for IP Protection\", <em>Proc. Proceedings of the 9th international workshop on Cryptographic Hardware and Embedded Systems</em>, pp. 63-80, 2007.","title":"FPGA Intrinsic PUFs and Their Use for IP Protection","context":[{"sec":"sec1","text":" In another study, the inherent characteristic of an SRAM (static random access memory) was utilized for device fingerprinting [4].","part":"1"}],"refType":"biblio","id":"ref4"},{"order":"5","text":"D. Suzuki and K. Shimizu, \"The Glitch PUF: A New Delay-PUF Architecture Exploiting Glitch Shapes\", <em>Cryptographic Hardware and Embedded Systems CHES 2010</em>, vol. 6225, pp. 366-382, 2010.","title":"The Glitch PUF: A New Delay-PUF Architecture Exploiting Glitch Shapes","context":[{"sec":"sec1","text":" Suzuki and Shimizu proposed a delay-based PUF system that can be integrated into an LSI device at a low cost [5].","part":"1"}],"links":{"crossRefLink":"https://doi.org/10.1007/978-3-642-15031-9_25"},"refType":"biblio","id":"ref5"},{"order":"6","text":"M. J. M. Pelgrom, A. C. J. Duinmaijer and A. P. G. Welbers, \"Matching properties of MOS transistors\", <em>Solid-State Circuits IEEE Journal of</em>, vol. 24, no. 5, pp. 1433-1439, 1989.","title":"Matching properties of MOS transistors","context":[{"sec":"sec1","text":"Inspired by the unique iris patterns of the human eye, this paper presents a novel authentication method that takes advantage of the mismatch properties [6] among the CIS-embedded electronic devices.","part":"1"},{"sec":"sec1","text":" It is always present because a small column pitch under \\$5 \\mu \\mathrm{m}\\$ limits the sizes of the transistors in the column circuits [6].","part":"1"}],"links":{"documentLink":"/document/572629","pdfSize":"906KB"},"refType":"biblio","id":"ref6"},{"order":"7","text":"A. El Gamal, B. A. Fowler, H. Min and X. Liu, \"Modeling and estimation of FPN components in CMOS image sensors\", <em>Proc. Photonics West '98 Electronic Imaging</em>, pp. 168-177, 1998.","title":"Modeling and estimation of FPN components in CMOS image sensors","context":[{"sec":"sec1","text":" Among the properties of the CIS, the column component of the fixed pattern noise (FPN) that can be modeled as a time-independent spatial white noise process [7], is employed in this paper.","part":"1"}],"links":{"crossRefLink":"https://doi.org/10.1117/12.304560"},"refType":"biblio","id":"ref7"},{"order":"8","text":"J. Choi, J. Shin and B. Kang, \"An architecture with pipelined background suppression and in-situ noise cancelling for 2D/3D CMOS image sensor\", <em>Circuits and Systems I: Regular Papers IEEE Transactions on</em>, vol. 62, no. 1, pp. 100-109, 2015.","title":"An architecture with pipelined background suppression and in-situ noise cancelling for 2D/3D CMOS image sensor","context":[{"sec":"sec2","text":" The FPN is inherent in a CIS because each pixel and column circuit is fabricated with process variations in the geometry, parasitic RC, and the threshold voltages [8], [9].","part":"1"}],"links":{"documentLink":"/document/6917220","pdfSize":"2793KB"},"refType":"biblio","id":"ref8"},{"order":"9","text":"M. F. Snoeij, A. J. Theuwissen, K. A. Makinwa and J. H. Huijsing, \"A CMOS imager with column-level ADC using dynamic column fixed-pattern noise reduction\", <em>Solid-State Circuits IEEE Journal of</em>, vol. 41, no. 12, pp. 3007-3015, 2006.","title":"A CMOS imager with column-level ADC using dynamic column fixed-pattern noise reduction","context":[{"sec":"sec2","text":" The FPN is inherent in a CIS because each pixel and column circuit is fabricated with process variations in the geometry, parasitic RC, and the threshold voltages [8], [9].","part":"1"}],"links":{"documentLink":"/document/4014637","pdfSize":"9243KB"},"refType":"biblio","id":"ref9"},{"order":"10","text":"J. Choi, J. Shin, D. Kang and D. S. Park, \"Always-On CMOS Image Sensor for Mobile and Wearable Devices\", <em>Solid-State Circuits IEEE Journal of</em>, vol. 51, no. 1, pp. 130-140, 2015.","title":"Always-On CMOS Image Sensor for Mobile and Wearable Devices","context":[{"sec":"sec2","text":" Fig. 1 illustrates a 4-transistor (4-T) pixel circuit that is widely used in contemporary CISs [10], [11].","part":"1"},{"sec":"sec2a","text":"The capacitor C2 (or C1) is selected to be variable in order to provide programmable gain amplification for suppressing the input referred noise [10], [12].","part":"1"}],"refType":"biblio","id":"ref10"},{"order":"11","text":"K. Mabuchi, N. Nakamura, E. Funatsu, T. Abe, T. Umeda, T. Hoshino et al., \"CMOS image sensors comprised of floating diffusion driving pixels with buried photodiode\", <em>Solid-State Circuits IEEE Journal of</em>, vol. 39, no. 12, pp. 2408-2416, 2004.","title":"CMOS image sensors comprised of floating diffusion driving pixels with buried photodiode","context":[{"sec":"sec2","text":" Fig. 1 illustrates a 4-transistor (4-T) pixel circuit that is widely used in contemporary CISs [10], [11].","part":"1"}],"links":{"documentLink":"/document/1362850","pdfSize":"1479KB"},"refType":"biblio","id":"ref11"},{"order":"12","text":"M. Sakakibara, S. Kawahito, D. Handoko, N. Nakamura, H. Satoh, M. Higashi et al., \"A high-sensitivity CMOS image sensor with gain-adaptive column amplifiers\", <em>Solid-State Circuits IEEE Journal of</em>, vol. 40, no. 5, pp. 1147-1156, 2005.","title":"A high-sensitivity CMOS image sensor with gain-adaptive column amplifiers","context":[{"sec":"sec2a","text":"The capacitor C2 (or C1) is selected to be variable in order to provide programmable gain amplification for suppressing the input referred noise [10], [12].","part":"1"}],"links":{"documentLink":"/document/1425722","pdfSize":"3678KB"},"refType":"biblio","id":"ref12"},{"order":"13","text":"S. Yoshihara, Y. Nitta, M. Kikuchi, K. Koseki, Y. Ito, Y. Inada et al., \"A 1/1.8-inch 6.4 Mpixel 60 frames/s CMOS image sensor with seamless mode change\", <em>Solid-State Circuits IEEE Journal of</em>, vol. 41, no. 12, pp. 2998-3006, 2006.","title":"A 1/1.8-inch 6.4 Mpixel 60 frames/s CMOS image sensor with seamless mode change","context":[{"sec":"sec2a","text":"Fig. 3 depicts a single-slope ADC circuit that is the most widely used circuit in the CISs [13], [14].","part":"1"}],"links":{"documentLink":"/document/4014640","pdfSize":"4332KB"},"refType":"biblio","id":"ref13"},{"order":"14","text":"J. Choi, S.-W. Han, S.-J. Kim, S.-I. Chang and E. Yoon, \"A spatial-temporal multiresolution CMOS image sensor with adaptive frame rates for tracking the moving objects in region-of-interest and suppressing motion blur\", <em>Solid-State Circuits IEEE Journal of</em>, vol. 42, no. 12, pp. 2978-2989, 2007.","title":"A spatial-temporal multiresolution CMOS image sensor with adaptive frame rates for tracking the moving objects in region-of-interest and suppressing motion blur","context":[{"sec":"sec2a","text":"Fig. 3 depicts a single-slope ADC circuit that is the most widely used circuit in the CISs [13], [14].","part":"1"}],"links":{"documentLink":"/document/4381442","pdfSize":"3129KB"},"refType":"biblio","id":"ref14"},{"order":"15","text":"R. J. Baker, CMOS: circuit design layout and simulation, John Wiley & Sons, 2011.","title":"CMOS: circuit design, layout, and simulation","context":[{"sec":"sec3a","text":"Because the threshold voltage decreases as the temperature increases [15], the system has to resolve the threshold variation with temperature for obtaining the intrinsic features in a homeostatic manner.","part":"1"},{"sec":"sec3a","text":" The effects owing to the ground voltage variations can also be mitigated in a similar manner because of the linear relationship between VT and the ground voltage variations [15].","part":"1"}],"refType":"biblio","id":"ref15"},{"order":"16","text":"A. K. Jain, R. P. W. Duin and M. Jianchang, \"Statistical pattern recognition: a review\", <em>Pattern Analysis and Machine Intelligence IEEE Transactions on</em>, vol. 22, no. 1, pp. 4-37, 2000.","title":"Statistical pattern recognition: a review","context":[{"sec":"sec3b","text":" Among the template-matching techniques, in the present study, a dynamic time warping (DTW) is employed [16] for measuring the spatial data similarity [17], [18] with a Sakoe—Chiba constraint [19] of a width of 50%.","part":"1"}],"links":{"documentLink":"/document/824819","pdfSize":"2044KB"},"refType":"biblio","id":"ref16"},{"order":"17","text":"H. Sakoe and S. Chiba, \"Dynamic programming algorithm optimization for spoken word recognition\", <em>Acoustics Speech and Signal Processing IEEE Transactions on</em>, vol. 26, no. 1, pp. 43-49, 1978.","title":"Dynamic programming algorithm optimization for spoken word recognition","context":[{"sec":"sec3b","text":" Among the template-matching techniques, in the present study, a dynamic time warping (DTW) is employed [16] for measuring the spatial data similarity [17], [18] with a Sakoe—Chiba constraint [19] of a width of 50%.","part":"1"}],"links":{"documentLink":"/document/1163055","pdfSize":"718KB"},"refType":"biblio","id":"ref17"},{"order":"18","text":"C. Kim and K.-D. Seo, \"Robust DTW-based recognition algorithm for hand-held consumer devices\", <em>Consumer Electronics IEEE Transactions on</em>, vol. 51, no. 2, pp. 699-709, 2005.","title":"Robust DTW-based recognition algorithm for hand-held consumer devices","context":[{"sec":"sec3b","text":" Among the template-matching techniques, in the present study, a dynamic time warping (DTW) is employed [16] for measuring the spatial data similarity [17], [18] with a Sakoe—Chiba constraint [19] of a width of 50%.","part":"1"}],"links":{"documentLink":"/document/1468022","pdfSize":"560KB"},"refType":"biblio","id":"ref18"},{"order":"19","text":"E. Keogh and C. A. Ratanamahatana, \"Exact indexing of dynamic time warping\", <em>Knowledge and information systems</em>, vol. 7, no. 3, pp. 358-386, 2005.","title":"Exact indexing of dynamic time warping","context":[{"sec":"sec3b","text":" Among the template-matching techniques, in the present study, a dynamic time warping (DTW) is employed [16] for measuring the spatial data similarity [17], [18] with a Sakoe—Chiba constraint [19] of a width of 50%.","part":"1"}],"links":{"crossRefLink":"https://doi.org/10.1007/s10115-004-0154-9"},"refType":"biblio","id":"ref19"},{"order":"20","text":"H. Ngo, R. Rakvic, R. Broussard and R. Ives, \"Resource-aware architecture design and implementation of hough transform for a realtime iris boundary detection system\", <em>Consumer Electronics IEEE Transactions on</em>, vol. 60, no. 3, pp. 485-492, 2014.","title":"Resource-aware architecture design and implementation of hough transform for a realtime iris boundary detection system","context":[{"sec":"sec4b","text":" However, it is difficult to differentiate between systems only through vision because of identical appearances (See Fig. 12.) Different from the existing solutions that suffer from the drawbacks described in Section I, the proposed approach can efficiently assign unique IDs to each robot, analogous to human biometrics (e.g., iris recognition [20], [21]).","part":"1"}],"links":{"documentLink":"/document/6937334","pdfSize":"619KB"},"refType":"biblio","id":"ref20"},{"order":"21","text":"R. P. Wildes, \"Iris recognition: an emerging biometric technology\", <em>Proceedings of the IEEE</em>, vol. 85, no. 9, pp. 1348-1363, 1997.","title":"Iris recognition: an emerging biometric technology","context":[{"sec":"sec4b","text":" However, it is difficult to differentiate between systems only through vision because of identical appearances (See Fig. 12.) Different from the existing solutions that suffer from the drawbacks described in Section I, the proposed approach can efficiently assign unique IDs to each robot, analogous to human biometrics (e.g., iris recognition [20], [21]).","part":"1"}],"links":{"documentLink":"/document/628669","pdfSize":"345KB"},"refType":"biblio","id":"ref21"},{"order":"22","text":"D. Zhang, Advanced pattern recognition technologies with applications to biometrics, IGI Global, 2009.","title":"Advanced pattern recognition technologies with applications to biometrics","context":[{"sec":"sec4c","text":" Device intrinsic features can be used as an additional modality for multimodal biometrics [22], [23].","part":"1"}],"links":{"crossRefLink":"https://doi.org/10.4018/978-1-60566-200-8"},"refType":"biblio","id":"ref22"},{"order":"23","text":"D.-S. Kim and K.-S. Hong, \"Multimodal biometric authentication using teeth image and voice in mobile environment\", <em>Consumer Electronics IEEE Transactions on</em>, vol. 54, no. 4, pp. 1790-1797, 2008.","title":"Multimodal biometric authentication using teeth image and voice in mobile environment","context":[{"sec":"sec4c","text":" Device intrinsic features can be used as an additional modality for multimodal biometrics [22], [23].","part":"1"}],"links":{"documentLink":"/document/4711236","pdfSize":"702KB"},"refType":"biblio","id":"ref23"}],"articleNumber":"7613186","issueLink":"/xpl/tocresult.jsp?isnumber=null","formulaStrippedArticleTitle":"Biometrics for electronic eyes: system authentication with embedded CMOS image sensor","publisher":"IEEE","htmlAbstractLink":"/document/7613186/","displayDocTitle":"Biometrics for electronic eyes: system authentication with embedded CMOS image sensor","htmlLink":"/document/7613186/","isJournal":true,"isStaticHtml":true,"xploreDocumentType":"Journals & Magazine","isDynamicHtml":true,"articleId":"7613186","openAccessFlag":"F","title":"Biometrics for electronic eyes: system authentication with embedded CMOS image sensor","contentTypeDisplay":"Journals","mlTime":"PT0.377998S","lastupdate":"2021-10-11","contentType":"periodicals","definitions":"false","publicationNumber":"30"},{"_id":7613189,"references":[{"order":"1","text":"J. Han, C. S. Choi, W. K. Park, I. Lee and S. H. Kim, \"Smart home energy management system including renewable energy based on zigbee and plc\", <em>IEEE Trans. on Consumer Electron.</em>, vol. 60, pp. 198-202, May 2014.","title":"Smart home energy management system including renewable energy based on zigbee and plc","context":[{"sec":"sec1","text":" This is a generalized phenomenon in home areas that implies increments in global energy consumption [1].","part":"1"}],"links":{"documentLink":"/document/6851994","pdfSize":"665KB"},"refType":"biblio","id":"ref1"},{"order":"2","text":"A. Keyhani, Design of Smart Power Grid Renewable Energy Systems, Wiley, 2011.","title":"Design of Smart Power Grid Renewable Energy Systems","context":[{"sec":"sec1","text":" It is forecasted that by 2030 the world energy demand will be doubled and similarly the carbon dioxide emission due to conventional power generation systems will increase by 75\\% [2].","part":"1"},{"sec":"sec1","text":" [2]\n\nFig. 1.","part":"1"}],"refType":"biblio","id":"ref2"},{"order":"3","text":"J. Catalão, Electric Power Systems: Advanced Forecasting Techniques and Optimal Generation Scheduling, Taylor & Francis, 2012.","title":"Electric Power Systems: Advanced Forecasting Techniques and Optimal Generation Scheduling","context":[{"sec":"sec1","text":" In that case, the capability and reliability of the conventional energy generation and transmission system as well as its environmental impact will be seriously compromised [3].","part":"1"},{"sec":"sec2a","text":" In light of the above, an EMS can schedule optimally the operation of the distributed resources within a small-scale microgrid by forecasting the resource availability and scheduling the power generation [3], [19], [20].","part":"1"}],"links":{"crossRefLink":"https://doi.org/10.1201/b11649"},"refType":"biblio","id":"ref3"},{"order":"4","text":"F. Marra and G. Yang, \"decentralized energy storage in residential feeders with photovoltaics\" in Energy Storage for Smart Grids, Boston:Academic Press, pp. 277-294, 2015.","title":"decentralized energy storage in residential feeders with photovoltaics","context":[{"sec":"sec1","text":" From the point of view of the Distribution System Operator, the increasing penetration of RES, implies additional technical challenges in regulation, support and control of the traditional power grid [4], [5].","part":"1"},{"sec":"sec1","text":" ESSs based on batteries are the most commonly used for household applications, because batteries offer a good commitment between energy density, life cycling and cost [4], [9].","part":"1"},{"sec":"sec2a","text":" Because of that, it is important to constrain the state of charge (SoC) of a battery within a safe window (normally 20 to 90\\%) [4].","part":"1"}],"links":{"crossRefLink":"https://doi.org/10.1016/B978-0-12-410491-4.00010-5"},"refType":"biblio","id":"ref4"},{"order":"5","text":"J. P. Chaves-Avila, K. Wurzburg, T. Gomez and P. Linares, \"The green impact: How renewable sources are changing eu electricity prices\", <em>IEEE Power and Energy Magazine</em>, vol. 13, pp. 29-40, July 2015.","title":"The green impact: How renewable sources are changing eu electricity prices","context":[{"sec":"sec1","text":" From the point of view of the Distribution System Operator, the increasing penetration of RES, implies additional technical challenges in regulation, support and control of the traditional power grid [4], [5].","part":"1"},{"sec":"sec1","text":" The cost associated to the new technological requirements, is mainly passed to the end-consumers by means of surcharges in the electricity [5].","part":"1"}],"links":{"pdfSize":"1379KB"},"refType":"biblio","id":"ref5"},{"order":"6","text":"M. Castillo-Cagigal, E. Caamano-Martin, E. Matallanas, D. Masa-Bote, A. Gutierrez, F. Monasterio-Huelin, et al., \"PV self-consumption optimization with storage and active fDSMg for the residential sector\", <em>Solar Energy</em>, vol. 85, no. 9, pp. 2338-2348, 2011.","title":"PV self-consumption optimization with storage and active fDSMg for the residential sector","context":[{"sec":"sec1","text":" Household consumers want to be as much independent as possible from the main grid and promoting self-energy consumption, which in turn is reflected in reductions on the energy bill [6].","part":"1"},{"sec":"sec2a","text":"The paradigm for private owners is to achieve autonomous power supply and consumption based on their own installed energy resources, and become independent form the utility grid [6].","part":"1"}],"links":{"crossRefLink":"https://doi.org/10.1016/j.solener.2011.06.028"},"refType":"biblio","id":"ref6"},{"order":"7","text":"A. Olson et al., \"Halfway There: Can California Achieve a 50% Renewable Grid?\", <em>IEEE Power and Energy Magazine</em>, vol. 13, no. 4, pp. 41-52, July-Aug. 2015.","title":"Halfway There: Can California Achieve a 50% Renewable Grid?","context":[{"sec":"sec1","text":" Even considering the initial investment associated with the installation of RES, household consumers are still willing to deploy RESs even under low internal rate of return [7].","part":"1"}],"links":{"pdfSize":"2120KB"},"refType":"biblio","id":"ref7"},{"order":"8","text":"Y. M. Wi, J. U. Lee and S. K. Joo, \"Electric vehicle charging method for smart homes/buildings with a photovoltaic system\", <em>IEEE Trans. Consumer Electron.</em>, vol. 59, pp. 323-328, May 2013.","title":"Electric vehicle charging method for smart homes/buildings with a photovoltaic system","context":[{"sec":"sec1","text":" Due to the unpredictable nature of the RESs and for increasing the local consumption rate of RESs, generation prosumers have to integrate Energy Storage Systems (ESS) within their small-scale power systems [8].","part":"1"},{"sec":"sec2a","text":" Also, ESS are required for smooth the variability of RESs, they are commonly based on batteries arrays and also battery based electric vehicles have been recently used [8], [21].","part":"1"}],"links":{"documentLink":"/document/6531113","pdfSize":"1204KB"},"refType":"biblio","id":"ref8"},{"order":"9","text":"M. Beaudin, H. Zareipour, A. Schellenberg and W. Rosehart, \"energy storage for mitigating the variability of renewable electricity sources\" in Energy Storage for Smart Grids, Boston:Academic Press, pp. 1-33, 2015.","title":"energy storage for mitigating the variability of renewable electricity sources","context":[{"sec":"sec1","text":" ESSs based on batteries are the most commonly used for household applications, because batteries offer a good commitment between energy density, life cycling and cost [4], [9].","part":"1"}],"links":{"crossRefLink":"https://doi.org/10.1016/B978-0-12-410491-4.00001-4"},"refType":"biblio","id":"ref9"},{"order":"10","text":"J. C. Vasquez, J. M. Guerrero, J. Miret, M. Castilla and L. G. de Vicuna, \"Hierarchical control of intelligent microgrids\", <em>IEEE Industrial Electronics Magazine</em>, vol. 4, pp. 23-29, Dec 2010.","title":"Hierarchical control of intelligent microgrids","context":[{"sec":"sec1","text":" In that case, a household prosumer can be seen as a small-scale microgrid where the operation of distributed units (RESs, ESSs and appliances) can be coordinated for ensuring a reliable operation of the local power grid [10].","part":"1"}],"links":{"documentLink":"/document/5663773","pdfSize":"1883KB"},"refType":"biblio","id":"ref10"},{"order":"11","text":"Y. S. Son, T. Pulkkinen, K. D. Moon and C. Kim, \"Home energy management system based on power line communication\", <em>IEEE Trans. on Consumer Electronics</em>, vol. 56, pp. 1380-1386, Aug 2010.","title":"Home energy management system based on power line communication","context":[{"sec":"sec1","text":"For an optimal operation of each prosumer, it is required an energy management system (EMS) which ensures the power balance of the local power system and optimizes the power consumption and generation at home [11].","part":"1"}],"links":{"documentLink":"/document/5606273","pdfSize":"357KB"},"refType":"biblio","id":"ref11"},{"order":"12","text":"M. Elsied, A. Oukaour, H. Gualous and R. Hassan, \"Energy management and optimization in microgrid system based on green energy\", <em>Energy</em>, vol. 84, pp. 139-151, 2015.","title":"Energy management and optimization in microgrid system based on green energy","context":[{"sec":"sec1","text":" To be more clear, the EMS schedules the operation of the distributed energy resources (DERs) by considering load requirements, while ensuring proper ESSs performance, and maximizing the use of renewable energy resources [12].","part":"1"}],"links":{"crossRefLink":"https://doi.org/10.1016/j.energy.2015.02.108"},"refType":"biblio","id":"ref12"},{"order":"13","text":"N. L. Daz, D. Wu, T. Dragi?evi?, J. C. Vsquez and J. M. Guerrero, \"Fuzzy droop control loops adjustment for stored energy balance in distributed energy storage system\", <em>9th International Conference on Power Electronics and ECCE Asia (ICPE-ECCE Asia)</em>, 2015.","title":"Fuzzy droop control loops adjustment for stored energy balance in distributed energy storage system","context":[{"sec":"sec1","text":" However, due to the uncertain generation of the RESs, sometimes it is not possible to meet the required demand relying only on local DERs, or store the surplus of energy when the ESSs are fully charged [13].","part":"1"}],"links":{"pdfSize":"2951KB"},"refType":"biblio","id":"ref13"},{"order":"14","text":"Q. Shafiee, T. Dragicevic, J. Vasquez and J. Guerrero, \"Hierarchical control for multiple dc-microgrids clusters\", <em>IEEE Transactions on Energy Conversion</em>, vol. 29, pp. 922-933, Dec 2014.","title":"Hierarchical control for multiple dc-microgrids clusters","context":[{"sec":"sec1","text":" At this sense, a prosumer can cooperate with others neighbor prosumers, in order to reach a better global performance and increase the reliability of the cooperative cluster of residential microgrids [14].","part":"1"}],"links":{"documentLink":"/document/6939722","pdfSize":"1817KB"},"refType":"biblio","id":"ref14"},{"order":"15","text":"Y. Luo, S. Itaya, S. Nakamura and P. Davis, \"Autonomous cooperative energy trading between prosumers for microgrid systems\", <em>2014 IEEE 39th Conference on Local Computer Networks Workshops (LCN Workshops)</em>, pp. 693-696, Sept 2014.","title":"Autonomous cooperative energy trading between prosumers for microgrid systems","context":[{"sec":"sec1","text":"Cooperative approaches have been considered previously for allowing energy trading between prosumers, in the case when a prosumer has a surplus of energy at the time when other prosumer requires more energy [15].","part":"1"}],"links":{"pdfSize":"466KB"},"refType":"biblio","id":"ref15"},{"order":"16","text":"D. Ilic, P. G. D. Silva, S. Karnouskos and M. Griesemer, \"An energy market for trading electricity in smart grid neighbourhoods\", <em>2012 6th IEEE International Conference on Digital Ecosystems Technologies (DEST)</em>, pp. 1-6, June 2012.","title":"An energy market for trading electricity in smart grid neighbourhoods","context":[{"sec":"sec1","text":" Because of that, some authors have pointed more on focused on discussing mechanisms for trading energy between neighbors [16].","part":"1"}],"links":{"documentLink":"/document/6227918","pdfSize":"1152KB"},"refType":"biblio","id":"ref16"},{"order":"17","text":"M. Alam, S. D. Ramchurn and A. Rogers, \"Cooperative energy exchange for the efficient use of energy and resources in remote communities\", <em>Proc. 2013 International Conference on Autonomous Agents and Multi-agent Systems AAMAS '13</em>, pp. 731-738, 2013.","title":"Cooperative energy exchange for the efficient use of energy and resources in remote communities","context":[{"sec":"sec1","text":" Other approaches have explored the advantages and mutual benefits derived from constant cooperative operation without predefined trade rules, in terms of the overall reduction in battery usage and fair distribution of energy surpluses among prosumers [17].","part":"1"}],"refType":"biblio","id":"ref17"},{"order":"18","text":"A. C. Luna, N. L. Diaz, M. Graells, J. M. Guerrero and J. C. Vasquez, \"Cooperative management for a cluster of residential prosumers\", <em>2016 IEEE International Conference on Consumer Electronics (ICCE)</em>, pp. 593-594, Jan 2016.","title":"Cooperative management for a cluster of residential prosumers","context":[{"sec":"sec1","text":" This paper is an extended version of the conference paper [18], which includes a detailed description of the optimization problem and extends the evaluation of the performance of clusters of household prosumers under different scenarios.","part":"1"}],"links":{"pdfSize":"2112KB"},"refType":"biblio","id":"ref18"},{"order":"19","text":"A. Luna, N. Diaz, F. Andrade, M. Graells, J. Guerrero and J. Vasquez, \"Economic power dispatch of distributed generators in a grid-connected microgrid\", <em>9th International Conference on Power Electronics and ECCE Asia (ICPE-ECCE Asia) 2015</em>, pp. 1161-1168, June 2015.","title":"Economic power dispatch of distributed generators in a grid-connected microgrid","context":[{"sec":"sec2a","text":" In light of the above, an EMS can schedule optimally the operation of the distributed resources within a small-scale microgrid by forecasting the resource availability and scheduling the power generation [3], [19], [20].","part":"1"},{"sec":"sec2a","text":" Meanwhile, RESs will operates as power sources and their power reference \\$\\boldsymbol{P}^{\\ast}\\$ will be determined by the minimum value between the scheduled power \\$\\boldsymbol{Pg}\\$ from the EMS and the power defined by an algorithm of maximum power point tracking (MPPT), \\$\\boldsymbol{P}_{\\boldsymbol{MPPT}}\\$ [19].","part":"1"}],"links":{"pdfSize":"3259KB"},"refType":"biblio","id":"ref19"},{"order":"20","text":"R. Palma-Behnke, C. Benavides, F. Lanas, B. Severino, L. Reyes, J. Llanos, et al., \"A microgrid energy management system based on the rolling horizon strategy\", <em>IEEE Transactions on Smart Grid</em>, vol. 4, pp. 996-1006, June 2013.","title":"A microgrid energy management system based on the rolling horizon strategy","context":[{"sec":"sec2a","text":" In light of the above, an EMS can schedule optimally the operation of the distributed resources within a small-scale microgrid by forecasting the resource availability and scheduling the power generation [3], [19], [20].","part":"1"}],"links":{"documentLink":"/document/6417004","pdfSize":"2158KB"},"refType":"biblio","id":"ref20"},{"order":"21","text":"W. Kempton and S. E. Letendre, \"Electric vehicles as a new power source for electric utilities\", <em>Transportation Research Part D: Transport and Environment</em>, vol. 2, no. 3, pp. 157-175, 1997.","title":"Electric vehicles as a new power source for electric utilities","context":[{"sec":"sec2a","text":" Also, ESS are required for smooth the variability of RESs, they are commonly based on batteries arrays and also battery based electric vehicles have been recently used [8], [21].","part":"1"}],"links":{"crossRefLink":"https://doi.org/10.1016/S1361-9209(97)00001-1"},"refType":"biblio","id":"ref21"},{"order":"22","text":"J. Pecas Lopes, C. Moreira and A. Madureira, \"Defining control strategies for microgrids islanded operation\", <em>IEEE Transactions on Power Systems</em>, vol. 21, pp. 916-924, May 2006.","title":"Defining control strategies for microgrids islanded operation","context":[{"sec":"sec2a","text":" Because of that, ESS will operate in voltage control mode (VCM) [22], [23].","part":"1"}],"links":{"documentLink":"/document/1626398","pdfSize":"375KB"},"refType":"biblio","id":"ref22"},{"order":"23","text":"D. Wu, F. Tang, T. Dragicevic, J. Vasquez and J. Guerrero, \"Autonomous active power control for islanded ac microgrids with photovoltaic generation and energy storage system\", <em>IEEE Transactions on Energy Conversion</em>, vol. 29, pp. 882-892, Dec 2014.","title":"Autonomous active power control for islanded ac microgrids with photovoltaic generation and energy storage system","context":[{"sec":"sec2a","text":" Because of that, ESS will operate in voltage control mode (VCM) [22], [23].","part":"1"}],"links":{"documentLink":"/document/6917016","pdfSize":"1268KB"},"refType":"biblio","id":"ref23"},{"order":"24","text":"B. Mozafari and S. Mohammadi, \"Optimal sizing of energy storage system for microgrids\", <em>Sadhana</em>, vol. 39, no. 4, pp. 819-841, 2014.","title":"Optimal sizing of energy storage system for microgrids","context":[{"sec":"sec2a","text":" From the point of view of the residential owner, this is an important issue to take into account, since the installation cost and replacement cost of batteries represent a big percentage of the total cost of the installed local energy system [24].","part":"1"}],"links":{"crossRefLink":"https://doi.org/10.1007/s12046-014-0264-3"},"refType":"biblio","id":"ref24"},{"order":"25","text":"L. Siow, P. So, H. Gooi, F. Luo, C. Gajanayake and Q. Vo, \"Wi-fi based server in microgrid energy management system\", <em>IEEE Region 10 Conference TENCON 2009</em>, pp. 1-5, Jan 2009.","title":"Wi-fi based server in microgrid energy management system","context":[{"sec":"sec2b","text":" In local area power system, wireless communication has been easily deployed with good performance for home and neighborhood area networks [25]–[27].","part":"1"}],"links":{"pdfSize":"932KB"},"refType":"biblio","id":"ref25"},{"order":"26","text":"A. Llaria, O. Curea, J. Jimenez, J. Martin and A. Zuloaga, \"Wireless communication system for microgrids management in islanding\", <em>Proc. 2011-14th European Conference on Power Electronics and Applications (EPE 2011)</em>, pp. 1-10, Aug 2011.","title":"Wireless communication system for microgrids management in islanding","context":[{"sec":"sec2b","text":" In local area power system, wireless communication has been easily deployed with good performance for home and neighborhood area networks [25]–[26][27].","part":"1"}],"links":{"documentLink":"/document/6020345","pdfSize":"611KB"},"refType":"biblio","id":"ref26"},{"order":"27","text":"D. M. Han and J. H. Lim, \"Smart home energy management system using ieee 802.15.4 and zigbee\", <em>IEEE Transactions on Consumer Electronics</em>, vol. 56, pp. 1403-1410, Aug 2010.","title":"Smart home energy management system using ieee 802.15.4 and zigbee","context":[{"sec":"sec2b","text":" In local area power system, wireless communication has been easily deployed with good performance for home and neighborhood area networks [25]–[27].","part":"1"}],"links":{"documentLink":"/document/5606276","pdfSize":"789KB"},"refType":"biblio","id":"ref27"},{"order":"28","text":"\"IEEE Std 1561-2007\", <em>Guide for optimizing the performance and life of lead acid batteries in remote hybrid power systems</em>, pp. C1-25, 2008.","title":"Guide for optimizing the performance and life of lead acid batteries in remote hybrid power systems","context":[{"sec":"sec3","text":"The parameters \\$\\boldsymbol{SoC}_{\\boldsymbol{max}}, \\boldsymbol{SoC}_{\\boldsymbol{min}}\\$ and \\$\\boldsymbol{\\varphi}_{\\boldsymbol{bat}}\\$ are related to the battery bank. \\$\\boldsymbol{SoC}_{\\boldsymbol{max}}\\$ is selected to allow the battery to be fully charged without overcharging and \\$\\boldsymbol{SoC}_{\\boldsymbol{min}}\\$ is chosen to limit the depth of discharge (DoD) accordingly with the recommendation of the IEEE1561-2007 standard [28]. \\$\\boldsymbol{\\varphi}_{\\boldsymbol{bat}}\\$ is a proportionality constant which relates the stored energy in \\$kWh\\$ with the SOC of the battery in percentage. \\$\\boldsymbol{\\varphi}_{\\boldsymbol{bat}}\\$ depends on the main parameters of the battery bank which are the nominal voltage, \\$\\boldsymbol{Vbatt}_{\\boldsymbol{nom}}\\$, the capacity \\$\\boldsymbol{C}_{\\boldsymbol{bat}}\\$ (in \\$Ah\\$) and the charging/discharging efficiency \\$\\boldsymbol{\\eta}_{\\boldsymbol{c}}\\$ as,\n.","part":"1"}],"refType":"biblio","id":"ref28"},{"order":"29","text":"N. L. Daz, A. C. Luna, J. C. Vsquez and J. M. Guerrero, \"Equalization algorithm for distributed energy storage systems in islanded ac microgrids\", <em>41st Annual Conference of the IEEE Industrial Electronics Society IECON 2015</em>, pp. 004661-004666, Nov 2015.","title":"Equalization algorithm for distributed energy storage systems in islanded ac microgrids","context":[{"sec":"sec4b3","text":"Additionally, in order to enhance the performance of distributed ESSs, which are cooperating within the cluster of household prosumers, the operation of the cooperative power grid is complemented with energy storage balance between distributed ESSs [29].","part":"1"}],"links":{"pdfSize":"1211KB"},"refType":"biblio","id":"ref29"},{"order":"30","text":"N. L. Diaz, D. Wu, T. Dragicevic, J. C. Vasquez and J. M. Guerrero, \"Stored energy balance for distributed pv-based active generators in an ac microgrid\", <em>2015 IEEE Power Energy Society General Meeting</em>, pp. 1-5, July 2015.","title":"Stored energy balance for distributed pv-based active generators in an ac microgrid","context":[{"sec":"sec4b3","text":" The equalization of the SoC between ESSs brings additional advantages to the overall performance of them, such as reduction in the DoD and faster charge of all the distributed ESSs [30].","part":"1"}],"links":{"pdfSize":"673KB"},"refType":"biblio","id":"ref30"},{"order":"31","text":"T. Kim and W. Qiao, \"A hybrid battery model capable of capturing dynamic circuit characteristics and nonlinear capacity effects\", <em>IEEE Transactions on Energy Conversion</em>, vol. 26, pp. 1172-1180, Dec 2011.","title":"A hybrid battery model capable of capturing dynamic circuit characteristics and nonlinear capacity effects","context":[{"sec":"sec5","text":" The model downloaded to this platform is previously established as a simulation model which includes the RESs generation profiles for 24h, the local controllers of the power converters as well as a detailed model of valve-regulated lead-acid (VRLA) batteries [31].","part":"1"}],"links":{"documentLink":"/document/6036164","pdfSize":"600KB"},"refType":"biblio","id":"ref31"},{"order":"32","text":"A. Ruiz-Alvarez, A. Colet-Subirachs, F. A.-C. Figuerola, O. Gomis-Bellmunt and A. Sudria-Andreu, \"Operation of a utility connected microgrid using an iec 61850-based multi-level management system\", <em>IEEE Transactions on Smart Grid</em>, vol. 3, pp. 858-865, June 2012.","title":"Operation of a utility connected microgrid using an iec 61850-based multi-level management system","context":[{"sec":"sec5","text":" Furthermore, to perform the real simulation of one day, the data were time-scaled i.e. one hour corresponds to one minute of simulation, so that the whole simulation spends 1440 s. instead of 1440 min [32].","part":"1"}],"links":{"documentLink":"/document/6180028","pdfSize":"1692KB"},"refType":"biblio","id":"ref32"}],"articleNumber":"7613189","issueLink":"/xpl/tocresult.jsp?isnumber=null","formulaStrippedArticleTitle":"Cooperative energy management for a cluster of households prosumers","publisher":"IEEE","isDynamicHtml":true,"htmlAbstractLink":"/document/7613189/","displayDocTitle":"Cooperative energy management for a cluster of households prosumers","isJournal":true,"htmlLink":"/document/7613189/","isStaticHtml":true,"xploreDocumentType":"Journals & Magazine","articleId":"7613189","openAccessFlag":"F","title":"Cooperative energy management for a cluster of households prosumers","contentTypeDisplay":"Journals","mlTime":"PT0.917508S","lastupdate":"2021-09-19","contentType":"periodicals","definitions":"false","publicationNumber":"30"},{"_id":7613193,"references":[{"order":"1","text":"C. Sun, K. Miyaji, K. Johguchi and K. Takeuchi, \"SCM capacity and NAND over-provisioning requirements for SCM/NAND flash hybrid enterprise SSD\", <em>Proc. International Memory Workshop</em>, pp. 64-67, May 2013.","title":"SCM capacity and NAND over-provisioning requirements for SCM/NAND flash hybrid enterprise SSD","context":[{"sec":"sec1","text":" Its performance varies significantly from application to application [1], due to unique NAND flash characteristics like garbage collection (GC).","part":"1"},{"sec":"sec1","text":" Based on the architecture of using SCM as a storage device, the memory capacity configuration [1] and data management algorithm has been optimized for the 100% write workload [2].","part":"1"}],"links":{"pdfSize":"415KB"},"refType":"biblio","id":"ref1"},{"order":"2","text":"C. Sun, K. Miyaji, K. Johguchi and K. Takeuchi, \"A high performance and energy-efficient cold data eviction algorithm for 3D-TSV Hybrid ReRAM/MLC NAND SSD\", <em>IEEE Trans. on Circuits and Systems I</em>, vol. 61, no. 2, pp. 382-392, Feb. 2014.","title":"A high performance and energy-efficient cold data eviction algorithm for 3D-TSV Hybrid ReRAM/MLC NAND SSD","context":[{"sec":"sec1","text":" By introducing SCM to storage subsystem, the SCM/NAND flash hybrid SSD has been proven to be capable of boosting the performance of NAND flash only SSD by over 10 times [2], [3].","part":"1"},{"sec":"sec1","text":" Based on the architecture of using SCM as a storage device, the memory capacity configuration [1] and data management algorithm has been optimized for the 100% write workload [2].","part":"1"},{"sec":"sec4b","text":" When the SCM space is almost full, a cold data eviction algorithm is used to evict the cold and less fragmented data from SCM to NAND flash [2].","part":"1"},{"sec":"sec5a","text":"The general memory device specifications are shown in Table II [2].","part":"1"},{"sec":"sec5a","text":" To evaluate the SCM/NAND flash hybrid SSD, a log-based transaction-level modeling (TLM) simulator [2] is used for the simulation, enabling quick architecture exploration and performance evaluation.","part":"1"},{"sec":"sec5b","text":" Since SSD data management algorithm has been well optimized for very write-intensive workloads [2], WO-DM achieves the best performance in Scenario 1 among three data management algorithms [4], when workloads are write-intensive.","part":"1"},{"sec":"sec5c","text":"Hybrid SSD could reduce 90% of the NAND flash write/erase (W/E) cycle for write-hot-random workloads, compared with the conventional NAND flash only SSD [2].","part":"1"}],"links":{"pdfSize":"2567KB"},"refType":"biblio","id":"ref2"},{"order":"3","text":"H. Fujii, K. Miyaji, K. Johguchi, K. Higuchi, C. Sun and K. Takeuchi, \"x11 performance increase x6.9 endurance enhancement 93% energy reduction of 3D TSV-integrated hybrid ReRAM/MLC NAND SSDs by data fragmentation suppression\", <em>Dig. Tech. Papers International Symp. on VLSI Circuits</em>, pp. 134-135, Jun. 2012.","title":"x11 performance increase, x6.9 endurance enhancement, 93% energy reduction of 3D TSV-integrated hybrid ReRAM/MLC NAND SSDs by data fragmentation suppression","context":[{"sec":"sec1","text":" By introducing SCM to storage subsystem, the SCM/NAND flash hybrid SSD has been proven to be capable of boosting the performance of NAND flash only SSD by over 10 times [2], [3].","part":"1"},{"sec":"sec2c","text":" [3].","part":"1"}],"links":{"documentLink":"/document/6243826","pdfSize":"698KB"},"refType":"biblio","id":"ref3"},{"order":"4","text":"S. Okamoto, C. Sun, S. Hachiya, T. Yamada, Y. Saito, T. O. Iwasaki, et al., \"Application driven SCM and NAND flash hybrid SSD design for data-centric computing system\", <em>Proc. International Memory Workshop</em>, pp. 157-160, May 2015.","title":"Application driven SCM and NAND flash hybrid SSD design for data-centric computing system","context":[{"sec":"sec1","text":" [4].","part":"1"},{"sec":"sec1","text":" Since both read and write performance are paramount to satisfy user demands, three algorithms: Write-Back (WB) NVM-cache, Write-Optimized Data Management (WO-DM) and Read-Write-Balanced Data Management (RWB-DM) algorithms have been proposed and evaluated with representative workloads [4].","part":"1"},{"sec":"sec2c","text":"Fig. 1 [4] presents two SCM/NAND flash hybrid architectures, which are different from all SCM usage models mentioned above.","part":"1"},{"sec":"sec2c","text":" The first type uses SCM as a non-volatile memory (NVM) based cache, as shown in Fig. 1(a) [4].","part":"1"},{"sec":"sec2c","text":"Fig. 1 (b) [4] illustrates the architecture that uses SCM as a storage device, which has been firstly proposed by Fujii et al. [3].","part":"1"},{"sec":"sec2c","text":"\nSCM/NAND flash hybrid ssd architectures [4]. (a) SCM is used as a write-back NVM-cache, (b) SCM is used as a storage device.","part":"1"},{"sec":"sec2c","text":"SCM/NAND flash hybrid ssd architectures [4]. (a) SCM is used as a write-back NVM-cache, (b) SCM is used as a storage device.","part":"1"},{"sec":"sec3","text":" For the write-intensive and read-intensive workloads, they are classified into four categories: hot and random, hot and sequential, cold and random, cold and sequential, respectively, as shown in Figs. 2(a) and (b) [4].","part":"1"},{"sec":"sec3","text":"\nWorkload classifications according to the hot/cold, random/sequential and read/write ratio. (a) Write-intensive workload classification [4], (b) Read-intensive workload classification [4], (c) Random workload characteristic, (d) Sequential workload characteristic.","part":"1"},{"sec":"sec3","text":"Workload classifications according to the hot/cold, random/sequential and read/write ratio. (a) Write-intensive workload classification [4], (b) Read-intensive workload classification [4], (c) Random workload characteristic, (d) Sequential workload characteristic.","part":"1"},{"sec":"sec4a","text":" The algorithm for SCM are named WB NVM-cache [4].","part":"1"},{"sec":"sec4c","text":" During read operation, the read-hot data or read-random data are moved from NAND flash memory to SCM, as shown in Fig. 3 [4].","part":"1"},{"sec":"sec5a","text":"Operations of the RWB-DM algorithm [4].","part":"1"},{"sec":"sec5b","text":" Since SSD data management algorithm has been well optimized for very write-intensive workloads [2], WO-DM achieves the best performance in Scenario 1 among three data management algorithms [4], when workloads are write-intensive.","part":"1"}],"links":{"documentLink":"/document/7150277","pdfSize":"232KB"},"refType":"biblio","id":"ref4"},{"order":"5","text":"T. Y. Liu, T. H. Yan, R. Scheuerlein, Y. Chen, J. K. Lee, G. Balakrishnan et al., \"A 130.7 2-layer 32 Gb ReRAM memory device in 24 nm technology\", <em>Proc. IEEE International Solid-State Circuits Conference</em>, pp. 210-211, Feb. 2013.","title":"A 130.7 2-layer 32 Gb ReRAM memory device in 24 nm technology","context":[{"sec":"sec2a","text":"From the memory hierarchy point of view, SCMs such as ReRAM [5], PCM [6] and MRAM [7] bridge the gap between DRAM and NAND flash memory.","part":"1"}],"refType":"biblio","id":"ref5"},{"order":"6","text":"Y. Choi, I. Song, M. H. Park, H. Chung, S. Chang, B. Cho et al., \"A 20 nm 1.8 V 8 Gb PRAM with 40 MB/s program bandwidth\", <em>Proc. IEEE International Solid-State Circuits Conference</em>, pp. 46-47, Feb. 2012.","title":"A 20 nm 1.8 V 8 Gb PRAM with 40 MB/s program bandwidth","context":[{"sec":"sec2a","text":"From the memory hierarchy point of view, SCMs such as ReRAM [5], PCM [6] and MRAM [7] bridge the gap between DRAM and NAND flash memory.","part":"1"}],"links":{"pdfSize":"327KB"},"refType":"biblio","id":"ref6"},{"order":"7","text":"T. Ohsawa, S. Miura, K. Kinoshita, H. Honjo, S. Ikeda, T. Hanyu, et al., \"A 1.5 nsec/2.1 nsec random read/write cycle 1 Mb STTRAM using 6T2MTJ cell with background write for nonvolatile e-Memories\", <em>Dig. Tech. Papers International Symp. VLSI Circuits</em>, pp. 110-111, Jun. 2013.","title":"A 1.5 nsec/2.1 nsec random read/write cycle 1 Mb STTRAM using 6T2MTJ cell with background write for nonvolatile e-Memories","context":[{"sec":"sec2a","text":"From the memory hierarchy point of view, SCMs such as ReRAM [5], PCM [6] and MRAM [7] bridge the gap between DRAM and NAND flash memory.","part":"1"}],"refType":"biblio","id":"ref7"},{"order":"8","text":"K. Abe, H. Noguchi, E. Kitagawa, N. Shimomura, J. Ito and S. Fujita, \"Novel hybrid DRAM/MRAM design for reducing power of high performance mobile CPU\", <em>International Electron Devices Meet. Tech. Dig.</em>, pp. 243-246, Dec. 2012.","title":"Novel hybrid DRAM/MRAM design for reducing power of high performance mobile CPU","context":[{"sec":"sec2b","text":" [8] proposed a DRAM/MRAM hybrid last level cache (LLC) to replace the SRAM based LLC in order to reduce the mobile CPU power consumption.","part":"1"}],"links":{"pdfSize":"620KB"},"refType":"biblio","id":"ref8"},{"order":"9","text":"G. Dhiman, R. Ayoub and T. Rosing, \"PDRAM: A hybrid PRAM and DRAM main memory system\", <em>Proc. Design Autom. Conference</em>, pp. 664-469, Jul. 2009.","title":"PDRAM: A hybrid PRAM and DRAM main memory system","context":[{"sec":"sec2b","text":" Some researchers proposed the DRAM/PCM hybrid system [9], [10] for the main memory system.","part":"1"}],"links":{"pdfSize":"305KB"},"refType":"biblio","id":"ref9"},{"order":"10","text":"D. Liu, T. Wang, Y. Wang, Z. Qin and Z. Shao, \"A block-level Flash memory management scheme for reducing write activities in PCM based embedded systems\", <em>Proc. Design Autom. Test Eur. Conference Exhib.</em>, pp. 1447-1450, Mar. 2012.","title":"A block-level Flash memory management scheme for reducing write activities in PCM based embedded systems","context":[{"sec":"sec2b","text":" Some researchers proposed the DRAM/PCM hybrid system [9], [10] for the main memory system.","part":"1"}],"refType":"biblio","id":"ref10"},{"order":"11","text":"X. Jin, S. Jung and Y. H. Song, \"Write-aware buffer management policy for performance and durability enhancement in NAND flash memory\", <em>IEEE Trans. Consumer Electron.</em>, vol. 56, no. 4, pp. 2393-2399, Nov. 2010.","title":"Write-aware buffer management policy for performance and durability enhancement in NAND flash memory","context":[{"sec":"sec2b","text":" [11] proposed a write-aware management policy to improve the NAND flash based SSD performance.","part":"1"}],"links":{"documentLink":"/document/5681118","pdfSize":"253KB"},"refType":"biblio","id":"ref11"},{"order":"12","text":"H. Shim, J.-S. Kim and S. Maeng, \"BEST: best-effort energy saving techniques for NAND flash-based hybrid storage\", <em>IEEE Trans. Consumer Electron.</em>, vol. 58, no. 3, pp. 841-848, Aug. 2012.","title":"BEST: best-effort energy saving techniques for NAND flash-based hybrid storage","context":[{"sec":"sec2b","text":" [12] designed the NAND flash and HDD hybrid SSD, in which NAND flash is deployed as a cache to reduce disk activities.","part":"1"}],"links":{"documentLink":"/document/6311326","pdfSize":"914KB"},"refType":"biblio","id":"ref12"},{"order":"13","text":"H. Lee, S. Jung and Y. H. Song, \"PCRAM-assisted ECC Management for enhanced data reliability in flash storage system\", <em>IEEE Trans. Consumer Electron.</em>, vol. 58, no. 3, pp. 849-856, Aug. 2012.","title":"PCRAM-assisted ECC Management for enhanced data reliability in flash storage system","context":[{"sec":"sec2b","text":" For example, a PCM-assisted error correction code (ECC) management scheme [13] keeps ECCs in PCM rather than storing it in the spare space in NAND flash page to reduce the ECC management overhead and thus enhances the system reliability and lifetime.","part":"1"}],"links":{"documentLink":"/document/6311327","pdfSize":"460KB"},"refType":"biblio","id":"ref13"},{"order":"14","text":"C. Lee and S.-H. Lim, \"Efficient logging of metadata using NVRAM for NAND flash based file system\", <em>IEEE Trans. Consumer Electron.</em>, vol. 58, no. 1, pp. 86-94, Feb. 2012.","title":"Efficient logging of metadata using NVRAM for NAND flash based file system","context":[{"sec":"sec2b","text":" [14] used SCM to store file system metadata to reduce the metadata related traffic in NAND flash memory.","part":"1"},{"sec":"sec2b","text":" As a result, these metadata storing proposals [14]–[16], which require the modification of existing file systems, are not applicable to general applications that may run on top of any file system.","part":"1"}],"links":{"documentLink":"/document/6170059","pdfSize":"1480KB"},"refType":"biblio","id":"ref14"},{"order":"15","text":"H. G. Lee, \"High-performance NAND and PRAM hybrid storage design for consumer electronics\", <em>IEEE Trans. Consumer Electron.</em>, vol. 56, no. 1, pp. 112-118, Feb. 2010.","title":"High-performance NAND and PRAM hybrid storage design for consumer electronics","context":[{"sec":"sec2b","text":" Furthermore, Lee [15] stored both metadata and page mapping table in PCM.","part":"1"},{"sec":"sec2b","text":" As a result, these metadata storing proposals [14]–[15][16], which require the modification of existing file systems, are not applicable to general applications that may run on top of any file system.","part":"1"}],"links":{"documentLink":"/document/5439133","pdfSize":"578KB"},"refType":"biblio","id":"ref15"},{"order":"16","text":"J. Kim, H. Lee, S. Choi and K. Bahng, \"A PRAM and NAND flash hybrid architecture for high-performance embedded storage subsystems\", <em>Proc. ACM International Conference Embedded Softw.</em>, pp. 31-40, Oct. 2008.","title":"A PRAM and NAND flash hybrid architecture for high-performance embedded storage subsystems","context":[{"sec":"sec2b","text":" As a result, these metadata storing proposals [14]–[16], which require the modification of existing file systems, are not applicable to general applications that may run on top of any file system.","part":"1"}],"links":{},"refType":"biblio","id":"ref16"},{"order":"17","text":"S. Lee, S. Jung and Y. H. Song, \"An efficient use of PRAM for an enhancement in the performance and durability of NAND storage system\", <em>IEEE Trans. Consumer Electron.</em>, vol. 58, no. 3, pp. 825-833, Aug. 2012.","title":"An efficient use of PRAM for an enhancement in the performance and durability of NAND storage system","context":[{"sec":"sec2b","text":" [17], PCM stores the mapping table and compressed differential data.","part":"1"}],"links":{"documentLink":"/document/6311324","pdfSize":"438KB"},"refType":"biblio","id":"ref17"},{"order":"18","text":"D. Takashima, Y. Nagadomi, K. Hatsuda, Y. Watanabe and S. Fuji, \"A 128 Mb chain FeRAM and system design for HDD application and enhanced HDD performance\", <em>IEEE Trans. Solid-State Circ.</em>, vol. 62, no. 2, pp. 530-536, Feb. 2011.","title":"A 128 Mb chain FeRAM and system design for HDD application and enhanced HDD performance","context":[{"sec":"sec2c","text":" However, no flush is required in NVM-cache due to memory persistency [18].","part":"1"},{"sec":"sec4a","text":" [18], where ferroelectric RAM (FeRAM) is the NVM-cache.","part":"1"}],"links":{"documentLink":"/document/5659871","pdfSize":"1710KB"},"refType":"biblio","id":"ref18"},{"order":"19","text":"D. Narayanan, A. Donnelly and A. Rowstron, \"Write off-loading: practical power management for enterprise storage\", <em>Proc. USENIX Symp. on File and Storage Technol.</em>, pp. 253-267, Feb. 2008.","title":"Write off-loading: practical power management for enterprise storage","context":[{"sec":"sec3","text":"Seven representative SSD workloads are selected among 36 one-week long block-level traces from Microsoft Research Cambridge [19], which are gathered per-volume (36 volumes containing 179 disks on 13 servers).","part":"1"}],"links":{},"refType":"biblio","id":"ref19"},{"order":"20","text":"C. Sun, T. O. Iwasaki, T. Onagi, K. Johguchi and K. Takeuchi, \"Cost capacity and performance analyses for hybrid SCM/NAND flash SSD\", <em>IEEE Trans. on Circuits and Systems I</em>, vol. 61, no. 8, pp. 2360-2369, Aug. 2014.","title":"Cost, capacity, and performance analyses for hybrid SCM/NAND flash SSD","context":[{"sec":"sec5a","text":"Generally, higher speed could be achieved by increasing memory chip area in basic memory design [20].","part":"1"},{"sec":"sec5d","text":" Even though actual chip cost depends on memory circuit design [20], SCM still costs much more than NAND flash memory.","part":"1"}],"links":{"documentLink":"/document/6803094","pdfSize":"1625KB"},"refType":"biblio","id":"ref20"}],"articleNumber":"7613193","issueLink":"/xpl/tocresult.jsp?isnumber=null","formulaStrippedArticleTitle":"Design guidelines of storage class memory/flash hybrid solid-state drive considering system architecture, algorithm and workload characteristic","publisher":"IEEE","displayDocTitle":"Design guidelines of storage class memory/flash hybrid solid-state drive considering system architecture, algorithm and workload characteristic","isJournal":true,"isStaticHtml":true,"htmlLink":"/document/7613193/","htmlAbstractLink":"/document/7613193/","xploreDocumentType":"Journals & Magazine","isDynamicHtml":true,"articleId":"7613193","openAccessFlag":"F","title":"Design guidelines of storage class memory/flash hybrid solid-state drive considering system architecture, algorithm and workload characteristic","contentTypeDisplay":"Journals","mlTime":"PT0.23881S","lastupdate":"2021-09-19","contentType":"periodicals","definitions":"false","publicationNumber":"30"},{"_id":7613201,"references":[{"order":"1","text":"D. Jo and G. J. Kim, \"In-situ AR manuals for ioT appliances\", <em>Proc. IEEE International Conference on Consumer Electronics</em>, pp. 411-412, 2016.","title":"In-situ AR manuals for ioT appliances","context":[{"sec":"sec1","text":" Not only does AR have many areas of application but it also empowers users in daily activities by spatially augmenting useful information to key interaction objects [1]–[3].","part":"1"}],"links":{"pdfSize":"333KB"},"refType":"biblio","id":"ref1"},{"order":"2","text":"L. Muller, I. Aslan and L. Krußen, \"GuideMe: A mobile augmented reality system to display user manuals for home appliances\", <em>Proc. Advances in Computer Entertainment</em>, pp. 152-167, 2013.","title":"GuideMe: A mobile augmented reality system to display user manuals for home appliances","context":[{"sec":"sec1","text":" Not only does AR have many areas of application but it also empowers users in daily activities by spatially augmenting useful information to key interaction objects [1]–[2][3].","part":"1"}],"links":{"crossRefLink":"https://doi.org/10.1007/978-3-319-03161-3_11"},"refType":"biblio","id":"ref2"},{"order":"3","text":"F. P. Brooks, \"The computer scientist as toolsmith\", <em>Communications of the ACM</em>, vol. 39, no. 3, pp. 61-68, Aug. 1996.","title":"The computer scientist as toolsmith","context":[{"sec":"sec1","text":" Not only does AR have many areas of application but it also empowers users in daily activities by spatially augmenting useful information to key interaction objects [1]–[3].","part":"1"}],"links":{},"refType":"biblio","id":"ref3"},{"order":"4","text":"B. R. Huang, C. H. Lin and C. H. Lee, \"Mobile augmented reality based on cloud computing\", <em>Proc. International Conference on Anti-Counterfeiting Security and Identification</em>, pp. 1-5, 2012.","title":"Mobile augmented reality based on cloud computing","context":[{"sec":"sec1","text":" A typical implementation scheme would rely on a high-end server communicating with a mobile AR client [4].","part":"1"}],"links":{"pdfSize":"1159KB"},"refType":"biblio","id":"ref4"},{"order":"5","text":"Z. Huang, W. Li, P. Hui and C. Peylo, \"CloudRidAR: A cloud-based architecture for mobile augmented reality\", <em>Proc. Workshop on Mobile Augmented Reality and Robotic Technology-based Systems</em>, pp. 29-34, 2014.","title":"CloudRidAR: A cloud-based architecture for mobile augmented reality","context":[{"sec":"sec1","text":" However, recognizing and tracking one object out of many target objects reliably and fast is difficult and is bound to exhibit performance problems (e.g., delay) [5].","part":"1"}],"links":{},"refType":"biblio","id":"ref5"},{"order":"6","text":"Y. Chen, L. Xiang, J. Zhang and L. Liu, \"Research about mobile AR system based on cloud computing\", <em>Proc. Wireless and Optical Communication Conference</em>, pp. 355-359, 2013.","title":"Research about mobile AR system based on cloud computing","context":[{"sec":"sec1","text":"A related problem is that nearly all such server-based approaches usually employ a single (visual) recognition algorithm based on some fixed visual or geometric features of the objects (e.g., color, key points, lines, texture, image template, 3D model) [6].","part":"1"},{"sec":"sec2","text":" There are several commercial as well as open-source cloud-based services offering high-end object recognition and tracking solutions with which AR services and applications can be developed [6].","part":"1"}],"links":{"documentLink":"/document/6676392","pdfSize":"823KB"},"refType":"biblio","id":"ref6"},{"order":"7","text":"R. Gimenez and M. Pous, \"Augmented reality as an enabling factor for the Internet of Things\", <em>W3C Workshop: Augmented Reality on the Web Mobile 2.0</em>, 2010.","title":"Augmented reality as an enabling factor for the Internet of Things","context":[{"sec":"sec1","text":"Incidentally, as a related concept, “Internet of Things (IoT)” has also emerged as a promising ubiquitous framework for collecting and analyzing environment information and providing people with relevant services through direct interaction with everyday objects (equipped with cheap small-end processing, storage, and network capabilities) [7].","part":"1"},{"sec":"sec2","text":"Whereas AR has recently been touted as one of the ideal interfaces for IoT [7], no notable and mature work has been conducted in this area.","part":"1"}],"refType":"biblio","id":"ref7"},{"order":"8","text":"J. S. Yun, I. Y. Ahn, N. M. Sung and J. H. Kim, \"A device software platform for consumer electronics based on the Internet of Things\", <em>IEEE Trans. Consumer Electron.</em>, vol. 61, no. 4, pp. 564-571, Nov. 2015.","title":"A device software platform for consumer electronics based on the Internet of Things","context":[{"sec":"sec1","text":" However, currently IoT is thought of more as an infrastructure, and the method of interaction with it continues to be an open problem [8].","part":"1"}],"links":{"pdfSize":"3052KB"},"refType":"biblio","id":"ref8"},{"order":"9","text":"D. Jo and G. J. Kim, \"Local context based recognition+ Internet of Things: Complementary infrastructures for future generic mixed reality space\", <em>Proc. 21st ACM Symposium on Virtual Reality Software and Technology</em>, pp. 196, 2015.","title":"Local context based recognition+ Internet of Things: Complementary infrastructures for future generic mixed reality space","context":[{"sec":"sec1","text":" Any valuable service based on IoT is likely to hinge on the way users access it and interact with it, and mobile and wearable AR is an attractive solution [9].","part":"1"}],"links":{},"refType":"biblio","id":"ref9"},{"order":"10","text":"M. Hirzer, \"Marker detection for augmented reality applications\", <em>Computer Graphics and Vision Technical Report</em>, 2008.","title":"Marker detection for augmented reality applications","context":[{"sec":"sec2","text":"In their early days, AR systems had been implemented as single applications (using APIs and toolkits) with only a limited number of objects targeted for augmentation [10].","part":"1"}],"refType":"biblio","id":"ref10"},{"order":"11","text":"H. Uchiyama and E. Marchand, \"Object detection and pose tracking for augmented reality: Recent approaches\", <em>Proc. 18th Korea-Japan Joint Workshop on Frontiers of Computer Vision</em>, Feb. 2012.","title":"Object detection and pose tracking for augmented reality: Recent approaches","context":[{"sec":"sec2","text":" Data necessary for recognition and associated contents were all pre-included within the application [11].","part":"1"}],"refType":"biblio","id":"ref11"},{"order":"12","text":"S. Kasahara, V. Heun, A. S. Lee and H. Ishii, \"Second surface: Multi-user spatial collaboration system based on augmented reality\", <em>Proc. SIGGRAPH Asia 2012 Emerging Technologies</em>, pp. 1-4, 2012.","title":"Second surface: Multi-user spatial collaboration system based on augmented reality","context":[{"sec":"sec2","text":" [12] developed the Second Surface in which users were able to create, tag, and share data around everyday objects implemented through a remote server.","part":"1"}],"links":{},"refType":"biblio","id":"ref12"},{"order":"13","text":"C. Suh and Y. B. Ko, \"Design and implementation of intelligent home control system based on active sensor networks\", <em>IEEE Trans. Consumer Electron.</em>, vol. 54, no. 3, pp. 1177-1184, Aug. 2008.","title":"Design and implementation of intelligent home control system based on active sensor networks","context":[{"sec":"sec2","text":" In the future, object specific data will be further developed and enriched for various services [13].","part":"1"}],"links":{"documentLink":"/document/4637604","pdfSize":"1051KB"},"refType":"biblio","id":"ref13"},{"order":"14","text":"J. Iglesias, D. Gomez, A. M. Bernardos and J. R. Casar, \"An attribute-based reasoning strategy to enhance interaction with augmented objects\", <em>Proc. 6th International Conference on Innovative Mobile and Internet Services in Ubiquitous Computing</em>, pp. 829-834, 2012.","title":"An attribute-based reasoning strategy to enhance interaction with augmented objects","context":[{"sec":"sec2","text":" [14] suggested an intelligent context-aware representation system for everyday objects with respect to the user's attribute, user-object proximity, relative orientation, and visibility.","part":"1"}],"refType":"biblio","id":"ref14"},{"order":"15","text":"C. Choi and H. I. Christensen, \"Real-time 3D model-based tracking using edge and keypoint features for robotic manipulation\", <em>Proc. IEEE Robotics and Automation</em>, pp. 4048-4055, 2010.","title":"Real-time 3D model-based tracking using edge and keypoint features for robotic manipulation","context":[{"sec":"sec2","text":"A recent trend in the field of AR is to do away with artificial markers (or any attachments to the target object) that are less appealing (e.g., large thick black boundaries with geometric patterns), and instead be able to recognize, track, and augment everyday objects in their original forms [15].","part":"1"}],"refType":"biblio","id":"ref15"},{"order":"16","text":"A. I. Comport, E. Marchand, M. Pressigout and F. Chaumette, \"Real-time markerless tracking for augmented reality: The virtual visual serving framework\", <em>IEEE Trans. Visualization Computer Graphics</em>, vol. 12, no. 4, pp. 615-628, 2006.","title":"Real-time markerless tracking for augmented reality: The virtual visual serving framework","context":[{"sec":"sec2","text":" Using natural features is the most prominent method of recognition and tracking of marker-less objects in AR today [16].","part":"1"}],"links":{"documentLink":"/document/1634325","pdfSize":"4265KB"},"refType":"biblio","id":"ref16"},{"order":"17","text":"T. Okuma, T. Kurata and K. Sakaue, \"A natural feature-based 3d object tracking method for wearable augmented reality\", <em>Proc. the 8th IEEE International Workshop on Advanced Motion Control</em>, pp. 451-456, 2004.","title":"A natural feature-based 3d object tracking method for wearable augmented reality","context":[{"sec":"sec2","text":" However, the method relies on a minimum number of features, typically several hundreds, that remain invariant under different usage situations (e.g., lighting or pose) and may not perform well for texture-less objects [17].","part":"1"}],"links":{"documentLink":"/document/1297911","pdfSize":"581KB"},"refType":"biblio","id":"ref17"},{"order":"18","text":"L. Lin, Y. Wang, Y. Liu, C. Xiong and K. Zeng, \"Marker-less registration based on template tracking for augmented reality\", <em>Multimedia Tools Appl.</em>, vol. 41, no. 2, pp. 235-252, 2009.","title":"Marker-less registration based on template tracking for augmented reality","context":[{"sec":"sec2","text":"For such texture-less objects, the more traditional template matching method might be more suitable [18].","part":"1"}],"links":{"crossRefLink":"https://doi.org/10.1007/s11042-008-0227-y"},"refType":"biblio","id":"ref18"},{"order":"19","text":"B. K. Seo, H. Park, J. I. Park, S. Hinterstoisser and S. Ilic, \"Optimal local searching for fast and robust textureless 3D object tracking in highly cluttered backgrounds\", <em>IEEE Trans. Vis. Computer. Graph.</em>, vol. 20, no. 1, pp. 99-110, 2014.","title":"Optimal local searching for fast and robust textureless 3D object tracking in highly cluttered backgrounds","context":[{"sec":"sec2","text":" Model-based fitting is another possible approach to handle objects that do not contain many notable features [19].","part":"1"}],"refType":"biblio","id":"ref19"},{"order":"20","text":"T. Höllerer, J. Wither and S. Diverdi, Anywhere augmentation: Towards mobile augmented reality in unprepared environments, Springer Verlag, pp. 393-416, 2007.","title":"Anywhere augmentation: Towards mobile augmented reality in unprepared environments","context":[{"sec":"sec2","text":"One notable example of a large scale AR service that is also based on a server-client architecture, is the location or GPS-based guidance for geographical locations or places of interest (e.g., the nearest restaurant, drug store, tourist sites) [20].","part":"1"}],"links":{"crossRefLink":"https://doi.org/10.1007/978-3-540-36728-4_29"},"refType":"biblio","id":"ref20"},{"order":"21","text":"J. Kim, J. Lee, B. Yoo, S. Ahn and H. Go, \"View management for webized mobile AR contents\", <em>Proc. IEEE International Symposium on Mixed and Augmented Reality</em>, pp. 271-272, 2014.","title":"View management for webized mobile AR contents","context":[{"sec":"sec2","text":" In this case, despite its large scale coverage in terms of the physical area and number of users serviced, the amount of associated data utilized in this service is much smaller (e.g., GPS coordinates) with a significant amount of the data (e.g., the map of the area) already downloaded onto the client device ahead of time [21].","part":"1"}],"links":{"pdfSize":"10915KB"},"refType":"biblio","id":"ref21"},{"order":"22","text":"R. Radkowski, \"Augmented reality to supplement work instructions\", <em>Model-Based Enterprise Summit</em>, 2013.","title":"Augmented reality to supplement work instructions","context":[{"sec":"sec2","text":" A few comparative studies have been conducted to validate the effectiveness of AR as an interface for manuals and instruction guidance [22].","part":"1"}],"refType":"biblio","id":"ref22"},{"order":"23","text":"A. M. Ullah, Md. R. Islam, S. F. Aktar and S. K. A. Hossain, \"Remote-touch: Augmented reality based marker tracking for smart home control\", <em>Proc. 15th International Conference on Computer and Information Technology</em>, pp. 473-477, 2012.","title":"Remote-touch: Augmented reality based marker tracking for smart home control","context":[{"sec":"sec2","text":" [23] presented a remote-touch system for smart home control in which the user would touch the augmented object seen on a display.","part":"1"}],"links":{"pdfSize":"1142KB"},"refType":"biblio","id":"ref23"},{"order":"24","text":"J. Rekimoto and Y. Ayatsuka, \"CyberCode: Designing augmented reality environments with visual tags\", <em>Proc. Of Designing Augmented Reality Environments</em>, pp. 1-10, 2000.","title":"CyberCode: Designing augmented reality environments with visual tags","context":[{"sec":"sec2","text":" There have been other similar approaches, all implemented as unique applications that have not addressed scalability (e.g., handling hundreds or thousands of objects) [24].","part":"1"}],"links":{},"refType":"biblio","id":"ref24"},{"order":"25","text":"D. Jin, K. Um and K. Cho, \"Development of real-time markerless augmented reality system using multi-thread design patterns\", <em>Multimedia Computer Graphics and Broadcasting</em>, pp. 155-164, 2011.","title":"Development of real-time markerless augmented reality system using multi-thread design patterns","context":[{"sec":"sec3","text":" For example, object 1 transmits information for the speeded up robust features (SURF) descriptor extraction algorithm-based tracking [25], whereas object 2 transmits information for the 3D model fitting-based tracking.","part":"1"},{"sec":"sec4a","text":" First, the experiment measured how two different recognition algorithms performed against these objects: one using the feature matching technique based on SURF descriptors [25] and the other using a template matching technique (i.e., comparing color intensities against a template image) [32].","part":"1"}],"links":{"crossRefLink":"https://doi.org/10.1007/978-3-642-27204-2_18"},"refType":"biblio","id":"ref25"},{"order":"26","text":"C. Perey, T. Engelke and C. Reed, \"Current status of standards for augmented reality\", <em>Recent Trends of Mobile Collaborative Augmented Reality Systems</em>, pp. 21-38, 2011.","title":"Current status of standards for augmented reality","context":[{"sec":"sec3","text":" Standardization of such data formats have already begun and will be developed in the near future (e.g., X3D [26], ARML 2.0 [27], ARLEM [28]).","part":"1"}],"links":{"crossRefLink":"https://doi.org/10.1007/978-1-4419-9845-3_2"},"refType":"biblio","id":"ref26"},{"order":"27","text":"M. Lechner, \"ARML 2.0: An overview\", <em>93rd Technical Committee in Open Geospatial Consortium</em>, 2014.","title":"ARML 2.0: An overview","context":[{"sec":"sec3","text":" Standardization of such data formats have already begun and will be developed in the near future (e.g., X3D [26], ARML 2.0 [27], ARLEM [28]).","part":"1"}],"refType":"biblio","id":"ref27"},{"order":"28","text":"C. Perey, \"Open and interoperable augmented reality and the IEEE standards\", <em>IEEE Consumer Electron. Magazine</em>, vol. 4, no. 4, pp. 133-135, Oct. 2015.","title":"Open and interoperable augmented reality and the IEEE standards","context":[{"sec":"sec3","text":" Standardization of such data formats have already begun and will be developed in the near future (e.g., X3D [26], ARML 2.0 [27], ARLEM [28]).","part":"1"}],"links":{"documentLink":"/document/7308148","pdfSize":"274KB"},"refType":"biblio","id":"ref28"},{"order":"29","text":"D. Diaz-Sánchez, F. Almenarez, A. Marín, D. Proserpio and P. A. Cabarcos, \"Media cloud: An open cloud computing middleware for content management\", <em>IEEE Trans. Consumer Electron.</em>, vol. 57, no. 2, pp. 970-978, May 2011.","title":"Media cloud: An open cloud computing middleware for content management","context":[{"sec":"sec4a","text":" Although fine grain locally distributed servers can alleviate the same problem, it is would not be a cost effective solution [29].","part":"1"}],"links":{"documentLink":"/document/5955247","pdfSize":"2280KB"},"refType":"biblio","id":"ref29"},{"order":"30","text":"E. Hsiao and M. Hebert, \"Occlusion Reasoning for object detection under arbitrary viewpoint\", <em>proc. IEEE Conf. Computer Vision and Pattern Recognition</em>, pp. 3146-3153, 2012.","title":"Occlusion Reasoning for object detection under arbitrary viewpoint","context":[{"sec":"sec4a","text":" The image datasets of the rich featured and texture-less items were used to create a realistic situation of matching against everyday objects with a variety of visual features and viewing conditions (e.g., angled, dark, occluded) [30].","part":"1"},{"sec":"sec4a","text":"\nDetection results between feature-based and template-based methods against everyday objects that appear in the image database of the rich featured and texture-less items [30]. (a) Samples of images and everyday objects within them with the respective tracking applied, (b) relative tracking performance for 12 different objects, half of them richly textured and the others not.","part":"1"},{"sec":"sec4a","text":"Detection results between feature-based and template-based methods against everyday objects that appear in the image database of the rich featured and texture-less items [30]. (a) Samples of images and everyday objects within them with the respective tracking applied, (b) relative tracking performance for 12 different objects, half of them richly textured and the others not.","part":"1"}],"links":{"pdfSize":"634KB"},"refType":"biblio","id":"ref30"},{"order":"31","text":"E. Hsiao, A. Collet and M. Hebert, \"Making specific features less discriminative to improve point-based 3d object recognition\", <em>Proc. Computer Vision and Pattern Recognition</em>, pp. 2653-2660, 2010.","title":"Making specific features less discriminative to improve point-based 3d object recognition","context":[{"sec":"sec4a","text":" Fig. 7(a) shows samples of images and the objects in them (e.g., juice can, pepper bottle) [31].","part":"1"}],"links":{"pdfSize":"2685KB"},"refType":"biblio","id":"ref31"},{"order":"32","text":"A. Dame and E. Marchand, \"Video mosaicing using a Mutual Information-Based Motion Estimation Process\", <em>Proc. IEEE Int. Conf. on Image Processing</em>, pp. 1525-1528, 2011.","title":"Video mosaicing using a Mutual Information-Based Motion Estimation Process","context":[{"sec":"sec4a","text":" First, the experiment measured how two different recognition algorithms performed against these objects: one using the feature matching technique based on SURF descriptors [25] and the other using a template matching technique (i.e., comparing color intensities against a template image) [32].","part":"1"}],"links":{"pdfSize":"2161KB"},"refType":"biblio","id":"ref32"},{"order":"33","text":"P. Belimpasakis and R. Walsh, \"A combined mixed reality and networked home approach to improving user interaction with consumer electronics\", <em>IEEE Trans. Consumer Electron.</em>, vol. 57, no. 1, pp. 139-144, Feb. 2011.","title":"A combined mixed reality and networked home approach to improving user interaction with consumer electronics","context":[{"sec":"sec4b","text":" There are many occasions in which providing the spatial and visual context of the IoT object in question using the spatial registration functionality of AR is desired [33].","part":"1"}],"links":{"documentLink":"/document/5735494","pdfSize":"512KB"},"refType":"biblio","id":"ref33"},{"order":"34","text":"Y. Jeong, H. Joo, G. Hong, D. Shin and S. Lee, \"AVIoT: Web-based interactive authoring and visualization of indoor internet of things\", <em>IEEE Trans. Consumer Electron.</em>, vol. 61, no. 3, pp. 295-301, Aug. 2015.","title":"AVIoT: Web-based interactive authoring and visualization of indoor internet of things","context":[{"sec":"sec5","text":" Such a physical context can be very intuitive and compelling in learning to control the device [34].","part":"1"}],"links":{"documentLink":"/document/7298088","pdfSize":"1475KB"},"refType":"biblio","id":"ref34"}],"articleNumber":"7613201","issueLink":"/xpl/tocresult.jsp?isnumber=null","formulaStrippedArticleTitle":"ARIoT: scalable augmented reality framework for interacting with Internet of Things appliances everywhere","publisher":"IEEE","isDynamicHtml":true,"htmlAbstractLink":"/document/7613201/","displayDocTitle":"ARIoT: scalable augmented reality framework for interacting with Internet of Things appliances everywhere","isJournal":true,"htmlLink":"/document/7613201/","isStaticHtml":true,"xploreDocumentType":"Journals & Magazine","articleId":"7613201","openAccessFlag":"F","title":"ARIoT: scalable augmented reality framework for interacting with Internet of Things appliances everywhere","contentTypeDisplay":"Journals","mlTime":"PT1.678088S","lastupdate":"2021-09-19","contentType":"periodicals","definitions":"false","publicationNumber":"30"}]