[{"_id":9690635,"references":[{"order":"1","text":"Q. Wu and R. Zhang, \"Toward Smart and Reconfigurable Environment: Intelligent Reflecting Surface Aided Wireless Network\", <em>IEEE Commun. Mag.</em>, vol. 58, no. 1, pp. 106-12, Jan. 2020.","title":"Toward Smart and Reconfigurable Environment: Intelligent Reflecting Surface Aided Wireless Network","context":[{"sec":"sec1","text":" In particular, as a kind of programmable metasurface, RISs are able to customize wireless signal propagation, which opens new avenues for realizing smart radio environments in future sixth generation (6G) wireless systems [1].","part":"1"},{"sec":"sec1","text":" The first model is the conventional IRS model that has been widely adopted in the literature [1], while the other two have been proposed recently, and address the need for more accurate physical propagation environment characterization [8] and enhanced IRS capabilities [9], respectively.","part":"1"},{"sec":"sec2a","text":"A widely adopted model for IRSs in the literature of wireless communications is to assume that each reflecting element individually acts as a diffusive scatterer which is able to alter the phase of the impinging electromagnetic (EM) wave during reflection [1].","part":"1"},{"sec":"sec2a","text":" Thereby, the impact of the IRS is modeled by a diagonal matrix \\$\\Phi\\$, called phase shift matrix, whose non-zero entries are the reflection coefficients.11In this article, the reflection coefficient is defined as the ratio of the amplitudes of the reflected and incident signals propagating in the wave-guide connected to each element of the IRS [1].","part":"1"},{"sec":"fn1","text":"In this article, the reflection coefficient is defined as the ratio of the amplitudes of the reflected and incident signals propagating in the wave-guide connected to each element of the IRS [1].","type":"footnote"}],"links":{"documentLink":"/document/8910627","pdfSize":"1286KB"},"refType":"biblio","id":"ref1"},{"order":"2","text":"C. Huang et al., \"Reconfigurable Intelligent Surfaces for Energy Efficiency in Wireless Communication\", <em>IEEE Trans. Wireless Commun.</em>, vol. 18, no. 8, pp. 4157-70, Aug. 2019.","title":"Reconfigurable Intelligent Surfaces for Energy Efficiency in Wireless Communication","context":[{"sec":"sec1","text":" Specifically, IRSs are typically implemented by a large number of passive elements (e.g., diodes and phase shifters) and do not require active hardware components such as radio frequency (RF) chains [2].","part":"1"}],"links":{"documentLink":"/document/8741198","pdfSize":"2691KB"},"refType":"biblio","id":"ref2"},{"order":"3","text":"X. Pei et al., <em>RIS-Aided Wireless Communications: Proto-typing Adaptive Beamforming and Indoor/Outdoor Field Trials</em>, Feb. 2021.","title":"RIS-Aided Wireless Communications: Proto-typing, Adaptive Beamforming, and Indoor/Outdoor Field Trials","context":[{"sec":"sec1","text":" Thus, IRSs consume limited power for operation (each element typically consumes less than 1 mW), which aligns with the growing need for green wireless communications [3].","part":"1"},{"sec":"sec5","text":" A promising solution for multi-IRS deployment is to leverage radio maps that capture the long-term statistical information of the radio environment [3].","part":"1"}],"refType":"biblio","id":"ref3"},{"order":"4","text":"X. Yu et al., \"Robust and Secure Wireless Communications via Intelligent Reflecting Surfaces\", <em>IEEE JSAC</em>, vol. 38, no. 11, pp. 2637-52, Nov. 2020.","title":"Robust and Secure Wireless Communications via Intelligent Reflecting Surfaces","context":[{"sec":"sec1","text":"The benefits of IRSs have been confirmed for various wireless communication scenarios in the recent literature, including physical layer security provisioning [4], full-duplex transmission [5], millimeter-wave wireless networks [6], and simultaneous wireless information and power transfer (SWIPT) systems [7].","part":"1"},{"sec":"sec2a","text":"The unit modulus constraint on the reflection coefficients significantly complicates the resource allocation algorithm design [4], [5] making it not scalable for large IRSs.","part":"1"},{"sec":"sec3a","text":" To tackle the multiplication of beamformers, a widely adopted approach is alternating optimi-zation (AO) [4], [5].","part":"1"},{"sec":"sec3a1","text":" This facilitates the design of tractable algorithms by adopting inner approximation (IA) and successive convex approximation (SCA) techniques [4].","part":"1"},{"sec":"sec4","text":" A commonly adopted method is to transform these constraints into a set of linear matrix inequalities by employing the S-procedure [4].","part":"1"},{"sec":"sec5","text":" Nevertheless, it was revealed in [4] that incorporating multiple IRSs does not incur additional difficulties for system design.","part":"1"},{"sec":"sec5","text":" Furthermore, the distributed IRSs can be thought of as one virtual “mega-IRS.” Correspondingly, the IRS reflecting matrices can be stacked and treated as one optimization variable that captures the impact of all IRS reflections [4].","part":"1"},{"sec":"sec6a","text":"We consider an IRS-assisted secure communication system that consists of one Tx and multiple legitimate Rx in the presence of potential eavesdroppers [4].","part":"1"}],"links":{"documentLink":"/document/9133130","pdfSize":"2009KB"},"refType":"biblio","id":"ref4"},{"order":"5","text":"D. Xu et al., \"Resource Allocation for IRS-Assisted Full-Du-plex Cognitive Radio Systems\", <em>IEEE Trans. Commun.</em>, vol. 68, no. 12, pp. 7376-94, Dec. 2020.","title":"Resource Allocation for IRS-Assisted Full-Du-plex Cognitive Radio Systems","context":[{"sec":"sec1","text":"The benefits of IRSs have been confirmed for various wireless communication scenarios in the recent literature, including physical layer security provisioning [4], full-duplex transmission [5], millimeter-wave wireless networks [6], and simultaneous wireless information and power transfer (SWIPT) systems [7].","part":"1"},{"sec":"sec2a","text":"The unit modulus constraint on the reflection coefficients significantly complicates the resource allocation algorithm design [4], [5] making it not scalable for large IRSs.","part":"1"},{"sec":"sec3a","text":" To tackle the multiplication of beamformers, a widely adopted approach is alternating optimi-zation (AO) [4], [5].","part":"1"},{"sec":"sec4","text":" As a compromise, one may exploit suitable inequalities (e.g., the triangle inequality) to decouple the product terms in the intractable constraints, which facilitates reformulation to a convex problem [5].","part":"1"}],"links":{"documentLink":"/document/9183907","pdfSize":"1934KB"},"refType":"biblio","id":"ref5"},{"order":"6","text":"T. Lin et al., \"Channel Estimation for Intelligent Reflecting Surface-Assisted Millimeter Wave MIMO Systems\", <em>Proc. IEEE GLOBECOM</em>, Dec. 2020.","title":"Channel Estimation for Intelligent Reflecting Surface-Assisted Millimeter Wave MIMO Systems","context":[{"sec":"sec1","text":"The benefits of IRSs have been confirmed for various wireless communication scenarios in the recent literature, including physical layer security provisioning [4], full-duplex transmission [5], millimeter-wave wireless networks [6], and simultaneous wireless information and power transfer (SWIPT) systems [7].","part":"1"},{"sec":"sec3a1","text":" Since the resulting unit modulus constraint defines a complex circle manifold, one may resort to the application of manifold optimization (MO) theory [6].","part":"1"},{"sec":"sec4","text":" Accordingly, one can estimate the two segments of the cascaded channels in an AO fashion [6].","part":"1"}],"links":{"documentLink":"/document/9322519","pdfSize":"447KB"},"refType":"biblio","id":"ref6"},{"order":"7","text":"D. Xu et al., \"Resource Allocation for Large IRS-Assisted SWIPT Systems with Non-Linear Energy Harvesting Model\", <em>IEEE Wireless Commun. Net. Conf.</em>, Mar. 2020.","title":"Resource Allocation for Large IRS-Assisted SWIPT Systems with Non-Linear Energy Harvesting Model","context":[{"sec":"sec1","text":"The benefits of IRSs have been confirmed for various wireless communication scenarios in the recent literature, including physical layer security provisioning [4], full-duplex transmission [5], millimeter-wave wireless networks [6], and simultaneous wireless information and power transfer (SWIPT) systems [7].","part":"1"},{"sec":"sec3a4","text":" Furthermore, a suboptimal solution can be obtained by employing the quadratic penalty (QP) method or alternating direction method of multipliers (ADMM) [7].","part":"1"}],"refType":"biblio","id":"ref7"},{"order":"8","text":"M. Najafi et al., \"Physics-Based Modeling and Scalable Optimization of Large Intelligent Reflecting Surfaces\", <em>IEEE Trans. Commun.</em>, vol. 69, no. 4, pp. 2673-91, Apr. 2021.","title":"Physics-Based Modeling and Scalable Optimization of Large Intelligent Reflecting Surfaces","context":[{"sec":"sec1","text":" The first model is the conventional IRS model that has been widely adopted in the literature [1], while the other two have been proposed recently, and address the need for more accurate physical propagation environment characterization [8] and enhanced IRS capabilities [9], respectively.","part":"1"},{"sec":"fn1","text":" Another definition of the reflection coefficient based on the amplitudes of the EM waves can also found in [8].","type":"footnote"},{"sec":"sec2b","text":" Furthermore, in [8], the EM discontinuities imposed by the IRS were modeled by using effective surface currents, and the reflected wave from the IRS was analyzed by solving Maxwell's equations for the electric and magnetic vector fields.","part":"1"},{"sec":"sec2b","text":" Since the physics model in [8] is compatible with the practical propagation environment, we discuss this model in detail below.","part":"1"},{"sec":"sec2b","text":" Assuming a far-field scenario, an IRS can be modeled by the generalized radar cross-section (GRCS), denoted by \\$g(\\Psi_{\\mathrm{t}},\\ \\Psi_{\\mathrm{r}})\\$, which determines how a plane wave impinging from an AoA \\$\\Psi_{\\mathrm{t}}\\$ with a given polarization is reflected in an intended AoD \\$\\Psi_{\\mathrm{r}}\\$ for a given phase shift configuration of the IRS [8].","part":"1"},{"sec":"sec2d","text":" To address this issue, a framework for scalable IRS optimization was proposed in [8] which relies on the following two design concepts:\n\n•The IRS reflecting elements are divided into \\$N\\$ subsets, referred to as tiles.\n•Instead of individually configuring each reflecting element, a predefined set of \\$M\\$ phase shift configurations for all reflecting elements of a given tile, referred to as transmission modes, are designed in an offline stage and stored in a codebook.","part":"1"},{"sec":"sec2d","text":" The tile and codebook-based (TC) framework can be applied to the IDS, physics, and INW IRS models (see [8] for the combination of the TC framework and the physics model).","part":"1"},{"sec":"sec3a2","text":"The optimization of the GRCS in the physics model in general involves a combination of binary programming for the selection of reflection beams and a unit-modulus optimization for determining the wave-front phase of each beam [8].","part":"1"}],"links":{"documentLink":"/document/9306896","pdfSize":"2879KB"},"refType":"biblio","id":"ref8"},{"order":"9","text":"S. Shen, B. Clerckx and R. Murch, <em>Modeling and Architecture Design of Intelligent Reflecting Surfaces Using Scattering Parameter Network Analysis</em>, Nov. 2020.","title":"Modeling and Architecture Design of Intelligent Reflecting Surfaces Using Scattering Parameter Network Analysis","context":[{"sec":"sec1","text":" The first model is the conventional IRS model that has been widely adopted in the literature [1], while the other two have been proposed recently, and address the need for more accurate physical propagation environment characterization [8] and enhanced IRS capabilities [9], respectively.","part":"1"},{"sec":"sec2c","text":" In contrast, in [9], it was proposed to connect all or a subset of IRS reflecting elements via an impedance network and jointly control them via an effective impedance matrix, denoted by \\$\\mathbf{Z}\\$.","part":"1"},{"sec":"sec2c","text":" In this case, the impedence-network-based (INW) model reduces to the baseline IDS model (i.e., \\$\\Theta=\\Phi\\$), and the corresponding impedance matrix \\$\\mathbf{Z}\\$ is the same as the one presented in [11].\n•Fully connected (FC) IRS: For this architecture, each IRS reflecting element is connected via an impedance to all other reflecting elements, which results in a complex-valued symmetric unitary scattering matrix \\$\\Theta\\$ [9].\n•Partially connected (PC) IRS: This architecture is a compromise between the previous two where the IRS reflecting elements are divided into groups, and all reflecting elements within a group are fully connected.","part":"1"},{"sec":"sec2c","text":"Fully connected (FC) IRS: For this architecture, each IRS reflecting element is connected via an impedance to all other reflecting elements, which results in a complex-valued symmetric unitary scattering matrix \\$\\Theta\\$ [9].","part":"1"},{"sec":"sec2c","text":" Note that the INW model in [9] can be augmented by incorporating the impact of the mutual coupling between different reflecting elements leading to a more accurate model [12].","part":"1"}],"refType":"biblio","id":"ref9"},{"order":"10","text":"F. H. Danufane et al., \"On the Path-Loss of Reconfigurable Intelligent Surfaces: An Approach Based on Green's Theorem Applied to Vector Fields\", <em>IEEE Trans. Commun.</em>, vol. 69, no. 8, pp. 5573-92, Aug. 2021.","title":"On the Path-Loss of Reconfigurable Intelligent Surfaces: An Approach Based on Green's Theorem Applied to Vector Fields","context":[{"sec":"sec2b","text":" For instance, physics-consistent analytical characterizations of both the far-field and near-field free-space path loss of a wireless link in the presence of an IRS with arbitrary functionalities were presented in [10] based on the vector generalization of Green's theorem.","part":"1"}],"links":{"documentLink":"/document/9433568","pdfSize":"3139KB"},"refType":"biblio","id":"ref10"},{"order":"11","text":"S. Abeywickrama et al., \"Intelligent Reflecting Surface: Practical Phase Shift Model and Beamforming Optimization\", <em>IEEE Trans. Commun.</em>, vol. 68, no. 9, pp. 5849-63, Sept. 2020.","title":"Intelligent Reflecting Surface: Practical Phase Shift Model and Beamforming Optimization","context":[{"sec":"sec2c","text":" For example, an impedance-based representation of the IDS model was provided in [11].","part":"1"},{"sec":"sec2c","text":" In this case, the impedence-network-based (INW) model reduces to the baseline IDS model (i.e., \\$\\Theta=\\Phi\\$), and the corresponding impedance matrix \\$\\mathbf{Z}\\$ is the same as the one presented in [11].\n•Fully connected (FC) IRS: For this architecture, each IRS reflecting element is connected via an impedance to all other reflecting elements, which results in a complex-valued symmetric unitary scattering matrix \\$\\Theta\\$ [9].\n•Partially connected (PC) IRS: This architecture is a compromise between the previous two where the IRS reflecting elements are divided into groups, and all reflecting elements within a group are fully connected.","part":"1"},{"sec":"sec2c","text":" In this case, the impedence-network-based (INW) model reduces to the baseline IDS model (i.e., \\$\\Theta=\\Phi\\$), and the corresponding impedance matrix \\$\\mathbf{Z}\\$ is the same as the one presented in [11].","part":"1"}],"links":{"documentLink":"/document/9115725","pdfSize":"2020KB"},"refType":"biblio","id":"ref11"},{"order":"12","text":"G. Gradoni and M. Di Renzo, \"End-to-End Mutual Coupling Aware Communication Model for Reconfigurable Intelligent Surfaces: An Electromagnetic-Compliant Approach Based on Mutual Impedances\", <em>IEEE Wireless Commun. Lett.</em>, vol. 10, no. 5, pp. 938-42, May 2021.","title":"End-to-End Mutual Coupling Aware Communication Model for Reconfigurable Intelligent Surfaces: An Electromagnetic-Compliant Approach Based on Mutual Impedances","context":[{"sec":"sec2c","text":" Note that the INW model in [9] can be augmented by incorporating the impact of the mutual coupling between different reflecting elements leading to a more accurate model [12].","part":"1"}],"links":{"documentLink":"/document/9319694","pdfSize":"380KB"},"refType":"biblio","id":"ref12"},{"order":"13","text":"H. Shen et al., \"Beamforming Optimization for IRS-Aided Communications with Transceiver Hardware Impairments\", <em>IEEE Trans. Commun.</em>, vol. 69, no. 2, pp. 1214-27, Feb. 2021.","title":"Beamforming Optimization for IRS-Aided Communications with Transceiver Hardware Impairments","context":[{"sec":"sec3a3","text":"The INW model, although sidestepping the unit modulus constraint, does impose a complex symmetric unitary matrix constraint for the IRS scattering matrix \\$\\Theta\\$ [13].","part":"1"},{"sec":"sec4a","text":"RF chain impairments at Tx and Rx: One widely adopted model to characterize the hardware impairments at transceivers is the extended error vector magnitude (EEVM) model [13].","part":"1"},{"sec":"sec4a","text":" Second, similar to RF chain impairments, a phase error term can be added to each IRS reflecting phase shift, which is typically modeled by a uniformly distributed or Von Mises distributed random variable [13].","part":"1"},{"sec":"sec4a","text":" Thus, majorization minimization (MM) techniques are effective for optimizing impairment-aware IRS-assisted systems [13].","part":"1"}],"links":{"documentLink":"/document/9239335","pdfSize":"1394KB"},"refType":"biblio","id":"ref13"},{"order":"14","text":"Z. Wang, L. Liu and S. Cui, \"Channel Estimation for Intelligent Reflecting Surface Assisted Multiuser Communications: Framework Algorithms and Analysis\", <em>IEEE Trans. Wireless Commun.</em>, vol. 19, no. 10, pp. 6607-20, Oct. 2020.","title":"Channel Estimation for Intelligent Reflecting Surface Assisted Multiuser Communications: Framework, Algorithms, and Analysis","context":[{"sec":"sec4","text":" Therefore, novel CSI acquisition methods are required, and system design methodologies accounting for the inevitable CSI estimation error have to be investigated [14].\n\n•Channel estimation: For the IDS and INW IRS models, discrete Fourier transform (DFT)-based passive beamforming has been widely adopted at IRSs for the CSI acquisition of the cascaded channel when the receivers (Rx) are single-antenna devices.","part":"1"}],"links":{"documentLink":"/document/9130088","pdfSize":"1544KB"},"refType":"biblio","id":"ref14"},{"order":"15","text":"V. Jamali et al., \"Power Efficiency Overhead and Complexity Tradeoff of IRS Codebook Design - Quadratic Phase-Shift Profile\", <em>IEEE Commun. Lett.</em>, vol. 25, no. 6, pp. 2048-52, June 2021.","title":"Power Efficiency, Overhead, and Complexity Tradeoff of IRS Codebook Design - Quadratic Phase-Shift Profile","context":[{"sec":"sec4","text":" In addition, the CSI acquisition overhead for algorithms developed based on the TC framework scales only with the numbers of tiles, N, and transmission modes, \\$M\\$, which are design parameters and can be chosen to trade performance with complexity and/or signaling overhead [15].","part":"1"},{"sec":"sec7","text":" This indicates that by adjusting \\$M\\$ and \\$N\\$, the physics model and the TC framework allow us to flexibly strike a balance between computational complexity and system performance, which facilitates the efficient and scalable design of large IRS-assisted systems [15].","part":"1"}],"links":{"documentLink":"/document/9350282","pdfSize":"926KB"},"refType":"biblio","id":"ref15"}],"articleNumber":"9690635","issueLink":"/xpl/tocresult.jsp?isnumber=null","formulaStrippedArticleTitle":"Smart and Reconfigurable Wireless Communications: From IRS Modeling to Algorithm Design","publisher":"IEEE","displayDocTitle":"Smart and Reconfigurable Wireless Communications: From IRS Modeling to Algorithm Design","htmlAbstractLink":"/document/9690635/","isJournal":true,"htmlLink":"/document/9690635/","xploreDocumentType":"Journals & Magazine","isDynamicHtml":true,"articleId":"9690635","openAccessFlag":"F","title":"Smart and Reconfigurable Wireless Communications: From IRS Modeling to Algorithm Design","contentTypeDisplay":"Magazines","mlTime":"PT0.213914S","lastupdate":"2022-01-26","contentType":"periodicals","definitions":"false","publicationNumber":"7742"}]