[{"_id":5128508,"paperCitations":{"ieee":[{"order":"1","displayText":"Sarath Kumara, Yuriy V. Serdyuk, Stanisalw M. Gubanski, \"Surface charge relaxation in silicone rubber and EPDM\", <i>Electrical Insulation and Dielectric Phenomena 2009. CEIDP '09. IEEE Conference on</i>, pp. 181-184, 2009.","links":{"documentLink":"/document/5377877","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=5377877","pdfSize":"205KB"},"title":"Surface charge relaxation in silicone rubber and EPDM"},{"order":"2","displayText":"Stanislaw M. Gubanski, \"Outdoor polymeric insulators: Role of corona in performance of silicone rubber housings\", <i>Electrical Insulation and Dielectric Phenomena (CEIDP) 2015 IEEE Conference on</i>, pp. 1-9, 2015.","links":{"documentLink":"/document/7352066","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7352066","pdfSize":"2593KB"},"title":"Outdoor polymeric insulators: Role of corona in performance of silicone rubber housings"},{"order":"3","displayText":"Xiangrong Chen, Anh T. Hoang, Yuriy V. Serdyuk, Stanislaw M. Gubanski, \"Surface potential decay on LDPE and its nanocomposites\", <i>Electrical Insulation and Dielectric Phenomenon (CEIDP) 2017 IEEE Conference on</i>, pp. 485-488, 2017.","links":{"documentLink":"/document/8257575","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8257575","pdfSize":"537KB"},"title":"Surface potential decay on LDPE and its nanocomposites"},{"order":"4","displayText":"S. Hou, M. L. Fu, J. Li, B. X. Du, Z. X. Liu, L. Yang, \"Effect of direct fluorination on surface charge of polyimide films using repetitive pulse power\", <i>Condition Monitoring and Diagnosis (CMD) 2016 International Conference on</i>, pp. 956-959, 2016.","links":{"documentLink":"/document/7757983","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7757983","pdfSize":"525KB"},"title":"Effect of direct fluorination on surface charge of polyimide films using repetitive pulse power"},{"order":"5","displayText":"S. W. Li, N. Wang, J. F. Guo, J. J. Zan, Y. Gao, S. H. Huang, B. X. Du, \"Effect of electron beam irradiation on trap distribution of thermally aged PET film\", <i>High Voltage Engineering and Application (ICHVE) 2016 IEEE International Conference on</i>, pp. 1-4, 2016.","links":{"documentLink":"/document/7800724","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7800724","pdfSize":"907KB"},"title":"Effect of electron beam irradiation on trap distribution of thermally aged PET film"},{"order":"6","displayText":"X. Wang, C. Chen, J.Z. Xiong, Kai Wu, D.M. Tu, \"Formation mechanism of space charge in silicone rubber insulation under low DC stress\", <i>Properties and Applications of Dielectric Materials (ICPADM) 2015 IEEE 11th International Conference on the</i>, pp. 116-119, 2015.","links":{"documentLink":"/document/7295222","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7295222","pdfSize":"3257KB"},"title":"Formation mechanism of space charge in silicone rubber insulation under low DC stress"},{"order":"7","displayText":"Stanislaw M. Gubanski, \"Role of surface charging in the performance of polymeric high voltage insulation systems\", <i>Solid Dielectrics (ICSD) 2010 10th IEEE International Conference on</i>, pp. 1-11, 2010.","links":{"documentLink":"/document/5568845","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=5568845","pdfSize":"588KB"},"title":"Role of surface charging in the performance of polymeric high voltage insulation systems"},{"order":"8","displayText":"B. X. Du, Zhonglei Li, Yu Gao, X. X. Cheng, \"Surface charge accumulate and decay of direct-fluorinated RTV silicone rubber\", <i>Solid Dielectrics (ICSD) 2013 IEEE International Conference on</i>, pp. 222-225, 2013.","links":{"documentLink":"/document/6619677","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6619677","pdfSize":"395KB"},"title":"Surface charge accumulate and decay of direct-fluorinated RTV silicone rubber"},{"order":"9","displayText":"Boxue Du, Yunqi Xing, Jian Xun Jin, Jie Li, Jin Li, \"Effects of Direct Fluorination on Space Charge and Trap Distribution of PI Film in LN2\", <i>Applied Superconductivity IEEE Transactions on</i>, vol. 26, no. 7, pp. 1-5, 2016.","links":{"documentLink":"/document/7523946","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7523946","pdfSize":"956KB"},"title":"Effects of Direct Fluorination on Space Charge and Trap Distribution of PI Film in LN2"},{"order":"10","displayText":"Sarath Kumara, Yuriy V. Serdyuk, Stanislaw M. Gubanski, \"Charging of Polymeric Surfaces by Positive Impulse Corona\", <i>Dielectrics and Electrical Insulation IEEE Transactions on</i>, vol. 16, no. 3, pp. 726-733, 2009.","links":{"documentLink":"/document/5128512","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=5128512","pdfSize":"1858KB"},"title":"Charging of Polymeric Surfaces by Positive Impulse Corona"},{"order":"11","displayText":"Sarath Kumara, Yuriy V. Serdyuk, Stanislaw M. Gubanski, \"Surface charge decay on polymeric materials under different neutralization modes in air\", <i>Dielectrics and Electrical Insulation IEEE Transactions on</i>, vol. 18, no. 5, pp. 1779-1788, 2011.","links":{"documentLink":"/document/6032850","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6032850","pdfSize":"643KB"},"title":"Surface charge decay on polymeric materials under different neutralization modes in air"},{"order":"12","displayText":"B. X. Du, J. W. Zhang, Y. Gao, \"Effects of TiO2 particles on surface charge of epoxy nanocomposites\", <i>Dielectrics and Electrical Insulation IEEE Transactions on</i>, vol. 19, no. 3, pp. 755-762, 2012.","links":{"documentLink":"/document/6215077","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6215077","pdfSize":"1047KB"},"title":"Effects of TiO2 particles on surface charge of epoxy nanocomposites"},{"order":"13","displayText":"Sarath Kumara, Imtiaz R. Hoque, Shahid Alam, Yuriy V. Serdyuk, Stanislaw M. Gubanski, \"Surface charges on cylindrical polymeric insulators\", <i>Dielectrics and Electrical Insulation IEEE Transactions on</i>, vol. 19, no. 3, pp. 1076-1083, 2012.","links":{"documentLink":"/document/6215115","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6215115","pdfSize":"770KB"},"title":"Surface charges on cylindrical polymeric insulators"},{"order":"14","displayText":"Bjoern Martin, Abhishek Rathi, Herbert Kliem, \"Surface charging of silicondioxide/silicon structures\", <i>Dielectrics and Electrical Insulation IEEE Transactions on</i>, vol. 19, no. 4, pp. 1124-1131, 2012.","links":{"documentLink":"/document/6259979","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6259979","pdfSize":"2567KB"},"title":"Surface charging of silicondioxide/silicon structures"},{"order":"15","displayText":"Sarath Kumara, Bin Ma, Yuriy V. Serdyuk, Stanislaw M. Gubanski, \"Surface charge decay on HTV silicone rubber: effect of material treatment by corona discharges\", <i>Dielectrics and Electrical Insulation IEEE Transactions on</i>, vol. 19, no. 6, pp. 2189-2195, 2012.","links":{"documentLink":"/document/6410223","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6410223","pdfSize":"1129KB"},"title":"Surface charge decay on HTV silicone rubber: effect of material treatment by corona discharges"},{"order":"16","displayText":"B. X. Du, Meng Xiao, \"Influence of surface charge on DC flashover characteristics of epoxy/BN nanocomposites\", <i>Dielectrics and Electrical Insulation IEEE Transactions on</i>, vol. 21, no. 2, pp. 529-536, 2014.","links":{"documentLink":"/document/6783044","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6783044","pdfSize":"2154KB"},"title":"Influence of surface charge on DC flashover characteristics of epoxy/BN nanocomposites"},{"order":"17","displayText":"B.X. Du, J.W. Zhang, Y. Gao, \"Effect of nanosecond rise time of pulse voltage on the surface charge of Epoxy/TiO2 nanocomposites\", <i>Dielectrics and Electrical Insulation IEEE Transactions on</i>, vol. 20, no. 1, pp. 321-328, 2013.","links":{"documentLink":"/document/6451373","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6451373","pdfSize":"702KB"},"title":"Effect of nanosecond rise time of pulse voltage on the surface charge of Epoxy/TiO2 nanocomposites"},{"order":"18","displayText":"B. X. Du, Jie Li, Wei Du, \"Dynamic behavior of surface charge on direct- fluorinated polyimide films\", <i>Dielectrics and Electrical Insulation IEEE Transactions on</i>, vol. 20, no. 3, pp. 947-954, 2013.","links":{"documentLink":"/document/6518964","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6518964","pdfSize":"510KB"},"title":"Dynamic behavior of surface charge on direct- fluorinated polyimide films"},{"order":"19","displayText":"N. Rouha, A. Beroual, \"Physico-chemical diagnosis of EPDM electrical aging by tree phenomenon\", <i>Dielectrics and Electrical Insulation IEEE Transactions on</i>, vol. 20, no. 5, pp. 1577-1583, 2013.","links":{"documentLink":"/document/6633686","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6633686","pdfSize":"2476KB"},"title":"Physico-chemical diagnosis of EPDM electrical aging by tree phenomenon"},{"order":"20","displayText":"B. X. Du, Jie Li, Wei Du, \"Surface charge accumulation and decay on directfluorinated polyimide/Al2O3 nanocomposites\", <i>Dielectrics and Electrical Insulation IEEE Transactions on</i>, vol. 20, no. 5, pp. 1764-1771, 2013.","links":{"documentLink":"/document/6633707","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6633707","pdfSize":"692KB"},"title":"Surface charge accumulation and decay on directfluorinated polyimide/Al2O3 nanocomposites"},{"order":"21","displayText":"B. X. Du, Z. L. Li, Jie Li, \"Surface charge accumulation and decay of direct-fluorinated RTV silicone rubber\", <i>Dielectrics and Electrical Insulation IEEE Transactions on</i>, vol. 21, no. 5, pp. 2338-2342, 2014.","links":{"documentLink":"/document/6927364","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6927364","pdfSize":"5743KB"},"title":"Surface charge accumulation and decay of direct-fluorinated RTV silicone rubber"},{"order":"22","displayText":"B. X. Du, Z. L. Li, \"Surface charge and dc flashover characteristics of direct-fluorinated SiR/SiO2 nanocomposites\", <i>Dielectrics and Electrical Insulation IEEE Transactions on</i>, vol. 21, no. 6, pp. 2602-2610, 2014.","links":{"documentLink":"/document/7031510","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7031510","pdfSize":"4565KB"},"title":"Surface charge and dc flashover characteristics of direct-fluorinated SiR/SiO2 nanocomposites"},{"order":"23","displayText":"B. X. Du, Jin Li, \"Electrical and mechanical ageing behaviors of used heat-shrinkable insulation tubes\", <i>Dielectrics and Electrical Insulation IEEE Transactions on</i>, vol. 21, no. 4, pp. 1875-1881, 2014.","links":{"documentLink":"/document/6878018","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6878018","pdfSize":"558KB"},"title":"Electrical and mechanical ageing behaviors of used heat-shrinkable insulation tubes"},{"order":"24","displayText":"Anh T. T. Hoang, Yuriy V. V. Serdyuk, Stanislaw M. M. Gubanski, \"Electrical characterization of a new enamel insulation\", <i>Dielectrics and Electrical Insulation IEEE Transactions on</i>, vol. 21, no. 3, pp. 1291-1301, 2014.","links":{"documentLink":"/document/6832277","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6832277","pdfSize":"983KB"},"title":"Electrical characterization of a new enamel insulation"},{"order":"25","displayText":"N. Rouha, A. Beroual, \"Diagnosis of EPDM's aging by electrical trees\", <i>Dielectrics and Electrical Insulation IEEE Transactions on</i>, vol. 22, no. 5, pp. 2852-2857, 2015.","links":{"documentLink":"/document/7311064","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7311064","pdfSize":"1438KB"},"title":"Diagnosis of EPDM's aging by electrical trees"},{"order":"26","displayText":"B. X. Du, Z. X. Liu, Y. G. Guo, \"Effect of direct fluorination on surface charge of polyimide films using repetitive pulsed power\", <i>Dielectrics and Electrical Insulation IEEE Transactions on</i>, vol. 22, no. 4, pp. 1777-1784, 2015.","links":{"documentLink":"/document/7179131","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7179131","pdfSize":"640KB"},"title":"Effect of direct fluorination on surface charge of polyimide films using repetitive pulsed power"},{"order":"27","displayText":"B. X. Du, Z. X. Liu, Meng Xiao, \"Effect of pulse duration on surface charge of direct-fluorinated polyimide films\", <i>Dielectrics and Electrical Insulation IEEE Transactions on</i>, vol. 22, no. 6, pp. 3481-3487, 2015.","links":{"documentLink":"/document/7367545","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7367545","pdfSize":"558KB"},"title":"Effect of pulse duration on surface charge of direct-fluorinated polyimide films"},{"order":"28","displayText":"B. X. Du, Y. Q. Xing, \"Surface potential behavior of fluorinated polyimide film under low temperature\", <i>Dielectrics and Electrical Insulation IEEE Transactions on</i>, vol. 23, no. 1, pp. 121-128, 2016.","links":{"documentLink":"/document/7422551","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7422551","pdfSize":"866KB"},"title":"Surface potential behavior of fluorinated polyimide film under low temperature"},{"order":"29","displayText":"J. R. S. S. Kumara, Yuriy V. Serdyuk, Stanislaw M. Gubanski, \"Surface potential decay on LDPE and LDPE/Al2O3 nano-composites: Measurements and modeling\", <i>Dielectrics and Electrical Insulation IEEE Transactions on</i>, vol. 23, no. 6, pp. 3466-3475, 2016.","links":{"documentLink":"/document/7823399","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7823399","pdfSize":"558KB"},"title":"Surface potential decay on LDPE and LDPE/Al2O3 nano-composites: Measurements and modeling"},{"order":"30","displayText":"B. X. Du, Jin Li, Qiang Du, M. L. Fu, \"Surface charge and flashover voltage of EVA/CB nanocomposite under mechanical stresses\", <i>Dielectrics and Electrical Insulation IEEE Transactions on</i>, vol. 23, no. 6, pp. 3734-3741, 2016.","links":{"documentLink":"/document/7823428","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7823428","pdfSize":"385KB"},"title":"Surface charge and flashover voltage of EVA/CB nanocomposite under mechanical stresses"}],"nonIeee":[{"order":"1","displayText":"\"On the nature of high field charge transport in reinforced silicone dielectrics: Experiment and simulation\", <i>Journal of Applied Physics</i>, vol. 120, pp. 055101, 2016.","links":{"crossRefLink":"https://doi.org/10.1063/1.4945373"},"title":"On the nature of high field charge transport in reinforced silicone dielectrics: Experiment and simulation"},{"order":"2","displayText":"Somesh Vinayak Tewari, Romesh Chandra, S K Sharma, R Sarathi, Archana Sharma, K C Mittal, \"Surface potential decay of PMMA and POM in air\", <i>Materials Research Express</i>, vol. 2, pp. 045301, 2015.","links":{"crossRefLink":"https://doi.org/10.1088/2053-1591/2/4/045301"},"title":"Surface potential decay of PMMA and POM in air"},{"order":"3","displayText":"Tomohiro Kawashima, Kaito Inoue, Kazuya Yokomi, Yoshinobu Murakami, Takahiro Ishida, Masayuki Nagao, \"Influence of Surface Charge on DC or AC Partial Discharge Inception Voltage in Insulation-Air Gap Composite System\", <i>IEEJ Transactions on Fundamentals and Materials</i>, vol. 135, pp. 235, 2015.","links":{"crossRefLink":"https://doi.org/10.1541/ieejfms.135.235"},"title":"Influence of Surface Charge on DC or AC Partial Discharge Inception Voltage in Insulation-Air Gap Composite System"},{"order":"4","displayText":"<i>Accelerating the Discovery of New Dielectric Properties in Polymer Insulation</i>, pp. 15, 2017.","links":{"crossRefLink":"https://doi.org/10.4018/978-1-5225-2309-3.ch002"},"title":""},{"order":"5","displayText":"<i>Accelerating the Discovery of New Dielectric Properties in Polymer Insulation</i>, pp. 114, 2017.","links":{"crossRefLink":"https://doi.org/10.4018/978-1-5225-2309-3.ch004"},"title":""},{"order":"6","displayText":"Yong Liu, Zhong-Lei Li, Bo-Xue Du, \"Kinetics of Charge Accumulation and Decay on Silicone Rubber/SiO2 Nanocomposite Surface\", <i>Journal of Electrical Engineering and Technology</i>, vol. 11, pp. 1332, 2016.","links":{"crossRefLink":"https://doi.org/10.5370/JEET.2016.11.5.1332"},"title":"Kinetics of Charge Accumulation and Decay on Silicone Rubber/SiO2 Nanocomposite Surface"},{"order":"7","displayText":"Palash Mishra, B.M. Ashwin Desai, Ramanujam Sarathi, Takahiro Imai, \"Performance analysis of epoxy nanocomposites due to water droplet-initiated discharges under AC and DC voltages and localisation of discharges\", <i>IET Science, Measurement & Technology</i>, 2018.","links":{"crossRefLink":"https://doi.org/10.1049/iet-smt.2018.5056"},"title":"Performance analysis of epoxy nanocomposites due to water droplet-initiated discharges under AC and DC voltages and localisation of discharges"},{"order":"8","displayText":"Muhammad Tariq Nazir, Bao Toan Phung, Yuanyuan Zhang, Shengtao Li, \"Dielectric and thermal properties of micro/nano boron nitride co-filled EPDM composites for high-voltage insulation\", <i>Micro & Nano Letters</i>, 2018.","links":{"crossRefLink":"https://doi.org/10.1049/mnl.2018.5168"},"title":"Dielectric and thermal properties of micro/nano boron nitride co-filled EPDM composites for high-voltage insulation"},{"order":"9","displayText":"Guochang Li, Mingyue Liu, Chuncheng Hao, Qingquan Lei, Yanhui Wei, \"Conductivity and interface charge accumulation between XLPE and SIR for HVDC cable accessory\", <i>Journal of Materials Science: Materials in Electronics</i>, 2018.","links":{"crossRefLink":"https://doi.org/10.1007/s10854-018-0414-1"},"title":"Conductivity and interface charge accumulation between XLPE and SIR for HVDC cable accessory"},{"order":"10","displayText":"R. Deepalaxmi, V. Rajini, \"Gamma and electron beam irradiation effects on SiR-EPDM blends\", <i>Journal of Radiation Research and Applied Sciences</i>, vol. 7, pp. 363, 2014.","links":{"crossRefLink":"https://doi.org/10.1016/j.jrras.2014.05.005"},"title":"Gamma and electron beam irradiation effects on SiR-EPDM blends"},{"order":"11","displayText":"Yan Wang, Dayuan Qiang, Zhiqiang Xu, George Chen, Alun Vaughan, \"The effect of loading ratios and electric field on charge dynamics in silica-based polyethylene nanocomposites\", <i>Journal of Physics D: Applied Physics</i>, vol. 51, pp. 395302, 2018.","links":{"crossRefLink":"https://doi.org/10.1088/1361-6463/aad7e8"},"title":"The effect of loading ratios and electric field on charge dynamics in silica-based polyethylene nanocomposites"},{"order":"12","displayText":"Shihu Yu, Shihang Wang, M. Tariq Nazir, Weiwang Wang, Shengtao Li, Toan Phung, Tatsuo Takada, \"Surface trap effects on flashover voltages of epoxy/Al2O3 nanocomposites for high voltage insulation\", <i>Journal of Materials Science: Materials in Electronics</i>, vol. 30, pp. 18135, 2019.","links":{"crossRefLink":"https://doi.org/10.1007/s10854-019-02166-3"},"title":"Surface trap effects on flashover voltages of epoxy/Al2O3 nanocomposites for high voltage insulation"},{"order":"13","displayText":"Yu Gao, Nan Li, Jing Li, Boxue Du, Ziyang Liu, \"Charge transport behavior in gamma-ray irradiated poly(ethylene terephthalate) estimated by surface potential decay\", <i>High Voltage</i>, 2020.","links":{"crossRefLink":"https://doi.org/10.1049/hve2.12037"},"title":"Charge transport behavior in gamma-ray irradiated poly(ethylene terephthalate) estimated by surface potential decay"},{"order":"14","displayText":"Nesrine Amiour, Zehira Ziari, Salah Sahli, \"Traps energy distribution in Kapton HN polyimide films through surface potential decay model under humidity conditions\", <i>Journal of Electrostatics</i>, vol. 109, pp. 103551, 2021.","links":{"crossRefLink":"https://doi.org/10.1016/j.elstat.2021.103551"},"title":"Traps energy distribution in Kapton HN polyimide films through surface potential decay model under humidity conditions"},{"order":"15","displayText":"Srijib Banerjee, Shelly Saini, Shakthi Prasad D, \"Electrical discharge resistance of polymeric nanocomposites\", <i>IET Nanodielectrics</i>, 2021.","links":{"crossRefLink":"https://doi.org/10.1049/nde2.12019"},"title":"Electrical discharge resistance of polymeric nanocomposites"}]},"formulaStrippedArticleTitle":"Charging Characteristics of EPDM and Silicone Rubbers Deduced from Surface Potential Measurements","nonIeeeCitationCount":"15","contentTypeDisplay":"Journals","patentCitationCount":"0","mlTime":"PT0.805083S","lastupdate":"2021-10-02","title":"Charging Characteristics of EPDM and Silicone Rubbers Deduced from Surface Potential Measurements","contentType":"periodicals","ieeeCitationCount":"66","publicationNumber":"94"},{"_id":5128523,"paperCitations":{"ieee":[{"order":"1","displayText":"Jixing Sun, Guoqiang Gao, Guangning Wu, Xiaobin Cao, Guangya Zhu, \"Influence of pollution distribution on insulator surface on flashover characteristics\", <i>Dielectrics and Electrical Insulation IEEE Transactions on</i>, vol. 21, no. 4, pp. 1637-1646, 2014.","links":{"documentLink":"/document/6877991","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6877991","pdfSize":"1883KB"},"title":"Influence of pollution distribution on insulator surface on flashover characteristics"},{"order":"2","displayText":"Zhijin Zhang, Dongdong Zhang, Qiang Zheng, Xing Li, Xingliang Jiang, \"Investigation of the DC arc propagation of insulator string and its performance at low air pressure\", <i>Dielectrics and Electrical Insulation IEEE Transactions on</i>, vol. 22, no. 6, pp. 3244-3252, 2015.","links":{"documentLink":"/document/7367518","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7367518","pdfSize":"939KB"},"title":"Investigation of the DC arc propagation of insulator string and its performance at low air pressure"}]},"formulaStrippedArticleTitle":"Partial Arcs above a Damp Contaminated Surface","nonIeeeCitationCount":"0","contentTypeDisplay":"Journals","patentCitationCount":"0","mlTime":"PT0.048126S","lastupdate":"2021-12-16","title":"Partial Arcs above a Damp Contaminated Surface","contentType":"periodicals","ieeeCitationCount":"2","publicationNumber":"94"},{"_id":5128529,"paperCitations":{"ieee":[{"order":"1","displayText":"Y. Gao, B.X Du, X.H. Zhu, \"Surface charging and charge decay on gamma-ray irradiated Epoxy resin laminate\", <i>Electrical Insulation and Dielectric Phenomena 2009. CEIDP '09. IEEE Conference on</i>, pp. 169-172, 2009.","links":{"documentLink":"/document/5377726","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=5377726","pdfSize":"357KB"},"title":"Surface charging and charge decay on gamma-ray irradiated Epoxy resin laminate"},{"order":"2","displayText":"Y. Gao, B. X. Du, J. D. Cui, K. Wu, \"Effect of gamma-ray irradiation on lateral charge motion on surface of laminated polymer insulating materials\", <i>Electrical Insulation and Dielectric Phenomena (CEIDP) 2011 Annual Report Conference on</i>, pp. 153-156, 2011.","links":{"documentLink":"/document/6232619","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6232619","pdfSize":"2078KB"},"title":"Effect of gamma-ray irradiation on lateral charge motion on surface of laminated polymer insulating materials"},{"order":"3","displayText":"Y. Gao, B. X. Du, Z. L. Ma, X. H. Zhu, \"Decay behavior of surface charge on gamma-ray irradiated epoxy resin\", <i>Solid Dielectrics (ICSD) 2010 10th IEEE International Conference on</i>, pp. 1-4, 2010.","links":{"documentLink":"/document/5568073","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=5568073","pdfSize":"681KB"},"title":"Decay behavior of surface charge on gamma-ray irradiated epoxy resin"},{"order":"4","displayText":"Y. Gao, B. X. Du, Z. L. Ma, X. H. Zhu, \"Effect of cross-linking temperature on charge decay behavior in XLPE\", <i>Solid Dielectrics (ICSD) 2010 10th IEEE International Conference on</i>, pp. 1-4, 2010.","links":{"documentLink":"/document/5568230","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=5568230","pdfSize":"281KB"},"title":"Effect of cross-linking temperature on charge decay behavior in XLPE"},{"order":"5","displayText":"B. X. Du, Jie Li, Wei Du, Heng Du, Yu Gao, Lin Yang, \"Dynamic behavior of surface charge on direct-fluorinated polyimide films\", <i>Solid Dielectrics (ICSD) 2013 IEEE International Conference on</i>, pp. 329-332, 2013.","links":{"documentLink":"/document/6619907","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6619907","pdfSize":"351KB"},"title":"Dynamic behavior of surface charge on direct-fluorinated polyimide films"},{"order":"6","displayText":"Zhonglei Li, B. X. Du, Hang Xu, Huanhuan Du, Yu Gao, \"Surface charge decay of direct-fluorinated RTV silicone rubber/SiO2 nanocomposites\", <i>Electrical Insulating Materials (ISEIM) Proceedings of 2014 International Symposium on</i>, pp. 477-480, 2014.","links":{"documentLink":"/document/6870822","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6870822","pdfSize":"1268KB"},"title":"Surface charge decay of direct-fluorinated RTV silicone rubber/SiO2 nanocomposites"},{"order":"7","displayText":"B. X. Du, H. J. Liu, \"Effects of atmospheric pressure on tracking failure of gamma-ray irradiated polymer insulating materials\", <i>Dielectrics and Electrical Insulation IEEE Transactions on</i>, vol. 17, no. 2, pp. 541-547, 2010.","links":{"documentLink":"/document/5448110","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=5448110","pdfSize":"484KB"},"title":"Effects of atmospheric pressure on tracking failure of gamma-ray irradiated polymer insulating materials"},{"order":"8","displayText":"B. X. Du, H. J. Liu, Yong Liu, \"Effects of magnetic field on tracking failure of gamma-ray irradiated polymer insulating materials\", <i>Dielectrics and Electrical Insulation IEEE Transactions on</i>, vol. 18, no. 1, pp. 140-148, 2011.","links":{"documentLink":"/document/5704503","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=5704503","pdfSize":"339KB"},"title":"Effects of magnetic field on tracking failure of gamma-ray irradiated polymer insulating materials"},{"order":"9","displayText":"B. X. Du, J. W. Zhang, Y. Gao, \"Effects of TiO2 particles on surface charge of epoxy nanocomposites\", <i>Dielectrics and Electrical Insulation IEEE Transactions on</i>, vol. 19, no. 3, pp. 755-762, 2012.","links":{"documentLink":"/document/6215077","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6215077","pdfSize":"1047KB"},"title":"Effects of TiO2 particles on surface charge of epoxy nanocomposites"},{"order":"10","displayText":"B. X. Du, Meng Xiao, \"Influence of surface charge on DC flashover characteristics of epoxy/BN nanocomposites\", <i>Dielectrics and Electrical Insulation IEEE Transactions on</i>, vol. 21, no. 2, pp. 529-536, 2014.","links":{"documentLink":"/document/6783044","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6783044","pdfSize":"2154KB"},"title":"Influence of surface charge on DC flashover characteristics of epoxy/BN nanocomposites"},{"order":"11","displayText":"B.X. Du, J.W. Zhang, Y. Gao, \"Effect of nanosecond rise time of pulse voltage on the surface charge of Epoxy/TiO2 nanocomposites\", <i>Dielectrics and Electrical Insulation IEEE Transactions on</i>, vol. 20, no. 1, pp. 321-328, 2013.","links":{"documentLink":"/document/6451373","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6451373","pdfSize":"702KB"},"title":"Effect of nanosecond rise time of pulse voltage on the surface charge of Epoxy/TiO2 nanocomposites"},{"order":"12","displayText":"B. X. Du, Jie Li, Wei Du, \"Dynamic behavior of surface charge on direct- fluorinated polyimide films\", <i>Dielectrics and Electrical Insulation IEEE Transactions on</i>, vol. 20, no. 3, pp. 947-954, 2013.","links":{"documentLink":"/document/6518964","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6518964","pdfSize":"510KB"},"title":"Dynamic behavior of surface charge on direct- fluorinated polyimide films"},{"order":"13","displayText":"B. X. Du, Jie Li, Wei Du, \"Surface charge accumulation and decay on directfluorinated polyimide/Al2O3 nanocomposites\", <i>Dielectrics and Electrical Insulation IEEE Transactions on</i>, vol. 20, no. 5, pp. 1764-1771, 2013.","links":{"documentLink":"/document/6633707","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6633707","pdfSize":"692KB"},"title":"Surface charge accumulation and decay on directfluorinated polyimide/Al2O3 nanocomposites"},{"order":"14","displayText":"B. X. Du, Z. L. Li, Jie Li, \"Surface charge accumulation and decay of direct-fluorinated RTV silicone rubber\", <i>Dielectrics and Electrical Insulation IEEE Transactions on</i>, vol. 21, no. 5, pp. 2338-2342, 2014.","links":{"documentLink":"/document/6927364","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6927364","pdfSize":"5743KB"},"title":"Surface charge accumulation and decay of direct-fluorinated RTV silicone rubber"},{"order":"15","displayText":"B. X. Du, Z. L. Li, \"Surface charge and dc flashover characteristics of direct-fluorinated SiR/SiO2 nanocomposites\", <i>Dielectrics and Electrical Insulation IEEE Transactions on</i>, vol. 21, no. 6, pp. 2602-2610, 2014.","links":{"documentLink":"/document/7031510","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7031510","pdfSize":"4565KB"},"title":"Surface charge and dc flashover characteristics of direct-fluorinated SiR/SiO2 nanocomposites"},{"order":"16","displayText":"B. X. Du, Jin Li, \"Electrical and mechanical ageing behaviors of used heat-shrinkable insulation tubes\", <i>Dielectrics and Electrical Insulation IEEE Transactions on</i>, vol. 21, no. 4, pp. 1875-1881, 2014.","links":{"documentLink":"/document/6878018","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6878018","pdfSize":"558KB"},"title":"Electrical and mechanical ageing behaviors of used heat-shrinkable insulation tubes"},{"order":"17","displayText":"B. X. Du, Y. G. Guo, \"Effects of surface fluorination on dielectric properties and surface charge behavior of water absorbed polyimide film\", <i>Dielectrics and Electrical Insulation IEEE Transactions on</i>, vol. 22, no. 3, pp. 1369-1375, 2015.","links":{"documentLink":"/document/7116324","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7116324","pdfSize":"290KB"},"title":"Effects of surface fluorination on dielectric properties and surface charge behavior of water absorbed polyimide film"},{"order":"18","displayText":"Yan-Oin Liu, Ke-Feng Li, Xiao-Feng Fan, Xiang-Yu Liu, Han Wang, Jun-Bo Deng, \"Influence of Metal Particles on Surface Charge Accumulation Characteristics of Spacer in SF6/N2Mixtures under Impulse Voltage\", <i>Condition Monitoring and Diagnosis (CMD) 2018</i>, pp. 1-5, 2018.","links":{"documentLink":"/document/8535611","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8535611","pdfSize":"2583KB"},"title":"Influence of Metal Particles on Surface Charge Accumulation Characteristics of Spacer in SF6/N2Mixtures under Impulse Voltage"},{"order":"19","displayText":"Yu Gao, Bangbang Xu, Tao Han, Xiaofang Wang, \"Gamma-ray irradiation induced variation in charge transport behavior of polyethylene based boron nitride/silica micro/nanocomposites\", <i>Dielectrics and Electrical Insulation IEEE Transactions on</i>, vol. 27, no. 2, pp. 459-467, 2020.","links":{"documentLink":"/document/9047089","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=9047089","pdfSize":"1254KB"},"title":"Gamma-ray irradiation induced variation in charge transport behavior of polyethylene based boron nitride/silica micro/nanocomposites"}],"nonIeee":[{"order":"1","displayText":"R. Deepalaxmi, V. Rajini, \"Gamma and electron beam irradiation effects on SiR-EPDM blends\", <i>Journal of Radiation Research and Applied Sciences</i>, vol. 7, pp. 363, 2014.","links":{"crossRefLink":"https://doi.org/10.1016/j.jrras.2014.05.005"},"title":"Gamma and electron beam irradiation effects on SiR-EPDM blends"},{"order":"2","displayText":"Deepalaxmi R., Rajini V., \"Performance evaluation of gamma irradiated SiR-EPDM blends\", <i>Nuclear Engineering and Design</i>, vol. 273, pp. 602, 2014.","links":{"crossRefLink":"https://doi.org/10.1016/j.nucengdes.2014.03.037"},"title":"Performance evaluation of gamma irradiated SiR-EPDM blends"},{"order":"3","displayText":"Y. Gao, B.X. Du, F. Shen, Z.L. Ma, T. Han, \"Tracking failure of gamma-ray irradiated polybutylene polymers under magnetic field\", <i>Polymer Degradation and Stability</i>, vol. 96, pp. 170, 2011.","links":{"crossRefLink":"https://doi.org/10.1016/j.polymdegradstab.2010.10.011"},"title":"Tracking failure of gamma-ray irradiated polybutylene polymers under magnetic field"},{"order":"4","displayText":"Boxue Du, Penghao Huang, Yunqi Xing, \"Surface charge and flashover characteristics of fluorinated PP under pulse voltage\", <i>IET Science, Measurement & Technology</i>, vol. 11, pp. 18, 2017.","links":{"crossRefLink":"https://doi.org/10.1049/iet-smt.2016.0103"},"title":"Surface charge and flashover characteristics of fluorinated PP under pulse voltage"},{"order":"5","displayText":"Jianyi Xue, Han Wang, Yanqin Liu, Kefeng Li, Xiangyu Liu, Xiaofeng Fan, Junbo Deng, Guanjun Zhang, Baohong Guo, \"Surface charge distribution patterns of a truncated cone-type spacer for high-voltage direct current gas-insulated metal-enclosed transmission line/gas-insulated metal-enclosed switchgear\", <i>IET Science, Measurement & Technology</i>, 2018.","links":{"crossRefLink":"https://doi.org/10.1049/iet-smt.2017.0325"},"title":"Surface charge distribution patterns of a truncated cone-type spacer for high-voltage direct current gas-insulated metal-enclosed transmission line/gas-insulated metal-enclosed switchgear"},{"order":"6","displayText":"Kostya (Ken) Ostrikov, \"Inorganic nanofilms for surface charge control on polymer surfaces by atmospheric-pressure plasma deposition\", <i>Journal of Applied Physics</i>, vol. 122, pp. 233302, 2017.","links":{"crossRefLink":"https://doi.org/10.1063/1.5008645"},"title":"Inorganic nanofilms for surface charge control on polymer surfaces by atmospheric-pressure plasma deposition"},{"order":"7","displayText":"<i>Accelerating the Discovery of New Dielectric Properties in Polymer Insulation</i>, pp. 316, 2017.","links":{"crossRefLink":"https://doi.org/10.4018/978-1-5225-2309-3.ch009"},"title":""},{"order":"8","displayText":"Boxue Du, Jie Li, Heng Du, \"Effects of Fluorination on Surface Charge Accumulation and Decay of Polyimide Film\", <i>Japanese Journal of Applied Physics</i>, vol. 52, pp. 120201, 2013.","links":{"crossRefLink":"https://doi.org/10.7567/JJAP.52.120201"},"title":"Effects of Fluorination on Surface Charge Accumulation and Decay of Polyimide Film"},{"order":"9","displayText":"Cheng Zhang, Yiyang Ma, Fei Kong, Ping Yan, Chao Chang, Tao Shao, \"Atmospheric pressure plasmas and direct fluorination treatment of Al2O3-filled epoxy resin: A comparison of surface charge dissipation\", <i>Surface and Coatings Technology</i>, vol. 362, pp. 1, 2019.","links":{"crossRefLink":"https://doi.org/10.1016/j.surfcoat.2019.01.081"},"title":"Atmospheric pressure plasmas and direct fluorination treatment of Al2O3-filled epoxy resin: A comparison of surface charge dissipation"},{"order":"10","displayText":"Nagaraju Guvvala, Burjupati Nageshwar Rao, Ramanujam Sarathi, \"Effect of gamma irradiation on space charge and charge trap characteristics of epoxy–MgO nanocomposites\", <i>Micro & Nano Letters</i>, 2019.","links":{"crossRefLink":"https://doi.org/10.1049/mnl.2019.0247"},"title":"Effect of gamma irradiation on space charge and charge trap characteristics of epoxy–MgO nanocomposites"},{"order":"11","displayText":"J Naveen, R Sarathi, T Imai, \"Understanding the impact of gamma irradiation of epoxy titania nanocomposites on surface and bulk charge characteristics\", <i>Nano Express</i>, vol. 1, pp. 010061, 2020.","links":{"crossRefLink":"https://doi.org/10.1088/2632-959X/ab9d6a"},"title":"Understanding the impact of gamma irradiation of epoxy titania nanocomposites on surface and bulk charge characteristics"},{"order":"12","displayText":"Cheng Zhang, Fei Kong, Tao Shao, <i>Polymer Insulation Applied for HVDC Transmission</i>, pp. 499, 2021.","links":{"crossRefLink":"https://doi.org/10.1007/978-981-15-9731-2_19"},"title":""},{"order":"13","displayText":"K. V. Aneesh Kumar, M. Raghavendra, Vinayakprasanna N. Hegde, A. P. Gnana Prakash, H. B. Ravikumar, \"Gamma irradiation induced microstructural modification and electrical conductivity of bakelite resistive plate chamber material\", <i>Journal of Radioanalytical and Nuclear Chemistry</i>, 2021.","links":{"crossRefLink":"https://doi.org/10.1007/s10967-020-07565-z"},"title":"Gamma irradiation induced microstructural modification and electrical conductivity of bakelite resistive plate chamber material"},{"order":"14","displayText":"Srijib Banerjee, Shelly Saini, Shakthi Prasad D, \"Electrical discharge resistance of polymeric nanocomposites\", <i>IET Nanodielectrics</i>, 2021.","links":{"crossRefLink":"https://doi.org/10.1049/nde2.12019"},"title":"Electrical discharge resistance of polymeric nanocomposites"},{"order":"15","displayText":"Yuchan Kang, Jiyuan Yan, Chengkai Peng, Yanze Song, Bo Bian, Tianshu Lü, Zijian Wan, Qing Xie, \"Study on the ageing effect of alumina/epoxy composites modified by atmospheric plasma jet\", <i>Polymer Composites</i>, 2021.","links":{"crossRefLink":"https://doi.org/10.1002/pc.26231"},"title":"Study on the ageing effect of alumina/epoxy composites modified by atmospheric plasma jet"}]},"formulaStrippedArticleTitle":"Gamma-ray Irradiation Inhibiting Surface Charge Accumulation on Polyethylene","nonIeeeCitationCount":"15","contentTypeDisplay":"Journals","patentCitationCount":"0","mlTime":"PT0.289389S","lastupdate":"2021-10-02","title":"Gamma-ray Irradiation Inhibiting Surface Charge Accumulation on Polyethylene","contentType":"periodicals","ieeeCitationCount":"19","publicationNumber":"94"},{"_id":5128907,"paperCitations":{"ieee":[{"order":"1","displayText":"João B. O. Souza Filho, José Manoel de Seixas, \"Class-modular multi-layer perceptron networks for supporting passive sonar signal classification\", <i>Radar Sonar & Navigation IET</i>, vol. 10, no. 2, pp. 311-317, 2016.","links":{"crossRefLink":"https://doi.org/10.1049/iet-rsn.2015.0179","pdfSize":"444KB"},"title":"Class-modular multi-layer perceptron networks for supporting passive sonar signal classification"},{"order":"2","displayText":"Sanyam Shukla, Ram Narayan Yadav, \"Regularized Weighted Circular Complex-Valued Extreme Learning Machine for Imbalanced Learning\", <i>Access IEEE</i>, vol. 3, pp. 3048-3057, 2015.","links":{"documentLink":"/document/7349136","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7349136","pdfSize":"4388KB"},"title":"Regularized Weighted Circular Complex-Valued Extreme Learning Machine for Imbalanced Learning"},{"order":"3","displayText":"Wei Liu, Miaohui Zhang, Zhiming Luo, Yuanzheng Cai, \"An Ensemble Deep Learning Method for Vehicle Type Classification on Visual Traffic Surveillance Sensors\", <i>Access IEEE</i>, vol. 5, pp. 24417-24425, 2017.","links":{"documentLink":"/document/8082506","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8082506","pdfSize":"1183KB"},"title":"An Ensemble Deep Learning Method for Vehicle Type Classification on Visual Traffic Surveillance Sensors"},{"order":"4","displayText":"Wei Wang, Yiqiang Sheng, Jinlin Wang, Xuewen Zeng, Xiaozhou Ye, Yongzhong Huang, Ming Zhu, \"HAST-IDS: Learning Hierarchical Spatial-Temporal Features Using Deep Neural Networks to Improve Intrusion Detection\", <i>Access IEEE</i>, vol. 6, pp. 1792-1806, 2018.","links":{"documentLink":"/document/8171733","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8171733","pdfSize":"9918KB"},"title":"HAST-IDS: Learning Hierarchical Spatial-Temporal Features Using Deep Neural Networks to Improve Intrusion Detection"},{"order":"5","displayText":"Remi Trichet, Francois Bremond, \"Dataset Optimization for Real-Time Pedestrian Detection\", <i>Access IEEE</i>, vol. 6, pp. 7719-7727, 2018.","links":{"documentLink":"/document/8272024","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8272024","pdfSize":"10639KB"},"title":"Dataset Optimization for Real-Time Pedestrian Detection"},{"order":"6","displayText":"Monica Perusquía-Hernández, Mazakasu Hirokawa, Kenji Suzuki, \"Spontaneous and posed smile recognition based on spatial and temporal patterns of facial EMG\", <i>Affective Computing and Intelligent Interaction (ACII) 2017 Seventh International Conference on</i>, pp. 537-541, 2017.","links":{"documentLink":"/document/8273651","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8273651","pdfSize":"336KB"},"title":"Spontaneous and posed smile recognition based on spatial and temporal patterns of facial EMG"},{"order":"7","displayText":"Xiaoyuan Jing, Chao Lan, Min Li, Yongfang Yao, David Zhang, Jingyu Yang, \"Class-imbalance learning based discriminant analysis\", <i>Pattern Recognition (ACPR) 2011 First Asian Conference on</i>, pp. 545-549, 2011.","links":{"documentLink":"/document/6166659","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6166659","pdfSize":"771KB"},"title":"Class-imbalance learning based discriminant analysis"},{"order":"8","displayText":"ZhiQiang Zeng, ShunZhi Zhu, \"A kernel-based sampling to train SVM with imbalanced data set\", <i>Conference Anthology IEEE</i>, pp. 1-5, 2013.","links":{"documentLink":"/document/6784693","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6784693","pdfSize":"87KB"},"title":"A kernel-based sampling to train SVM with imbalanced data set"},{"order":"9","displayText":"Jian Zhou, Zhaoqiang Ge, Shang Gao, Yanli Xu, \"Fault record detection with random forests in data center of large power grid\", <i>Power and Energy Engineering Conference (APPEEC) 2016 IEEE PES Asia-Pacific</i>, pp. 1641-1645, 2016.","links":{"documentLink":"/document/7779771","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7779771","pdfSize":"3927KB"},"title":"Fault record detection with random forests in data center of large power grid"},{"order":"10","displayText":"Marko Gasparic, Tural Gurbanov, Francesco Ricci, \"Context-aware integrated development environment command recommender systems\", <i>Automated Software Engineering (ASE) 2017 32nd IEEE/ACM International Conference on</i>, pp. 688-693, 2017.","links":{"documentLink":"/document/8115679","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8115679","pdfSize":"182KB"},"title":"Context-aware integrated development environment command recommender systems"},{"order":"11","displayText":"Chris Mills, \"Towards the automatic classification of traceability links\", <i>Automated Software Engineering (ASE) 2017 32nd IEEE/ACM International Conference on</i>, pp. 1018-1021, 2017.","links":{"documentLink":"/document/8115723","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8115723","pdfSize":"146KB"},"title":"Towards the automatic classification of traceability links"},{"order":"12","displayText":"Remi Trichet, Noel E. O'Connor, \"A flexible ensemble-SVM for computer vision tasks\", <i>Advanced Video and Signal Based Surveillance (AVSS) 2016 13th IEEE International Conference on</i>, pp. 51-58, 2016.","links":{"documentLink":"/document/7738028","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7738028","pdfSize":"229KB"},"title":"A flexible ensemble-SVM for computer vision tasks"},{"order":"13","displayText":"Yucel Kocyigit, Huseyin Seker, \"Imbalanced data classifier by using ensemble fuzzy c-means clustering\", <i>Biomedical and Health Informatics (BHI) 2012 IEEE-EMBS International Conference on</i>, pp. 952-955, 2012.","links":{"documentLink":"/document/6211746","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6211746","pdfSize":"672KB"},"title":"Imbalanced data classifier by using ensemble fuzzy c-means clustering"},{"order":"14","displayText":"Cristina Soguero-Ruiz, Kristian Hindberg, José Luis Rojo-Álvarez, Stein Olav Skrøvseth, Fred Godtliebsen, Kim Mortensen, Arthur Revhaug, Rolv-Ole Lindsetmo, Inma Mora-Jiménez, Knut Magne Augestad, Robert Jenssen, \"Bootstrap resampling feature selection and Support Vector Machine for early detection of Anastomosis Leakage\", <i>Biomedical and Health Informatics (BHI) 2014 IEEE-EMBS International Conference on</i>, pp. 577-580, 2014.","links":{"documentLink":"/document/6864430","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6864430","pdfSize":"962KB"},"title":"Bootstrap resampling feature selection and Support Vector Machine for early detection of Anastomosis Leakage"},{"order":"15","displayText":"David J. Dittman, Taghi M. Khoshgoftaar, Amri Napolitano, \"Selecting the Appropriate Data Sampling Approach for Imbalanced and High-Dimensional Bioinformatics Datasets\", <i>Bioinformatics and Bioengineering (BIBE) 2014 IEEE International Conference on</i>, pp. 304-310, 2014.","links":{"documentLink":"/document/7033597","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7033597","pdfSize":"163KB"},"title":"Selecting the Appropriate Data Sampling Approach for Imbalanced and High-Dimensional Bioinformatics Datasets"},{"order":"16","displayText":"Randall Wald, Taghi M. Khoshgoftaar, Amri Napolitano, \"Using Correlation-Based Feature Selection for a Diverse Collection of Bioinformatics Datasets\", <i>Bioinformatics and Bioengineering (BIBE) 2014 IEEE International Conference on</i>, pp. 156-162, 2014.","links":{"documentLink":"/document/7033574","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7033574","pdfSize":"171KB"},"title":"Using Correlation-Based Feature Selection for a Diverse Collection of Bioinformatics Datasets"},{"order":"17","displayText":"Taghi M. Khoshgoftaar, Alireza Fazelpour, David J. Dittman, Amri Napolitano, \"Effects of the Use of Boosting on Classification Performance of Imbalanced Bioinformatics Datasets\", <i>Bioinformatics and Bioengineering (BIBE) 2014 IEEE International Conference on</i>, pp. 420-426, 2014.","links":{"documentLink":"/document/7033616","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7033616","pdfSize":"174KB"},"title":"Effects of the Use of Boosting on Classification Performance of Imbalanced Bioinformatics Datasets"},{"order":"18","displayText":"Mengwen Liu, Yuan An, Xiaohua Hu, Debra Langer, Craig Newschaffer, Lindsay Shea, \"An evaluation of identification of suspected autism spectrum disorder (ASD) cases in early intervention (EI) records\", <i>Bioinformatics and Biomedicine (BIBM) 2013 IEEE International Conference on</i>, pp. 566-571, 2013.","links":{"documentLink":"/document/6732559","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6732559","pdfSize":"299KB"},"title":"An evaluation of identification of suspected autism spectrum disorder (ASD) cases in early intervention (EI) records"},{"order":"19","displayText":"Dechang Xu, Jianzhong Li, \"An experimental research for automatic classification of unbalanced single-channel protein sub-cellular location fluorescence image set\", <i>Bioinformatics and Biomedicine (BIBM) 2013 IEEE International Conference on</i>, pp. 68-70, 2013.","links":{"documentLink":"/document/6732766","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6732766","pdfSize":"1458KB"},"title":"An experimental research for automatic classification of unbalanced single-channel protein sub-cellular location fluorescence image set"},{"order":"20","displayText":"Jing Zhao, Aron Henriksson, Lars Asker, Henrik Boström, \"Detecting adverse drug events with multiple representations of clinical measurements\", <i>Bioinformatics and Biomedicine (BIBM) 2014 IEEE International Conference on</i>, pp. 536-543, 2014.","links":{"documentLink":"/document/6999216","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6999216","pdfSize":"146KB"},"title":"Detecting adverse drug events with multiple representations of clinical measurements"},{"order":"21","displayText":"Kai Tian, Mingyu Shao, Shuigeng Zhou, Jihong Guan, \"Boosting compound-protein interaction prediction by deep learning\", <i>Bioinformatics and Biomedicine (BIBM) 2015 IEEE International Conference on</i>, pp. 29-34, 2015.","links":{"documentLink":"/document/7359651","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7359651","pdfSize":"1526KB"},"title":"Boosting compound-protein interaction prediction by deep learning"},{"order":"22","displayText":"Hayda Almeida, Marie-Jean Meurs, Leila Kosseim, Adrian Tsang, \"Supporting HIV literature screening with data sampling and supervised learning\", <i>Bioinformatics and Biomedicine (BIBM) 2015 IEEE International Conference on</i>, pp. 491-496, 2015.","links":{"documentLink":"/document/7359733","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7359733","pdfSize":"1129KB"},"title":"Supporting HIV literature screening with data sampling and supervised learning"},{"order":"23","displayText":"Harsh Shrivastava, Vijay Huddar, Sakyajit Bhattacharya, Vaibhav Rajan, \"Classification with imbalance: A similarity-based method for predicting respiratory failure\", <i>Bioinformatics and Biomedicine (BIBM) 2015 IEEE International Conference on</i>, pp. 707-714, 2015.","links":{"documentLink":"/document/7359773","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7359773","pdfSize":"999KB"},"title":"Classification with imbalance: A similarity-based method for predicting respiratory failure"},{"order":"24","displayText":"Anand Avati, Kenneth Jung, Stephanie Harman, Lance Downing, Andrew Ng, Nigam H. Shah, \"Improving palliative care with deep learning\", <i>Bioinformatics and Biomedicine (BIBM) 2017 IEEE International Conference on</i>, pp. 311-316, 2017.","links":{"documentLink":"/document/8217669","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8217669","pdfSize":"763KB"},"title":"Improving palliative care with deep learning"},{"order":"25","displayText":"Vítor Teixeira, Rui Camacho, Pedro G. Ferreira, \"Learning influential genes on cancer gene expression data with stacked denoising autoencoders\", <i>Bioinformatics and Biomedicine (BIBM) 2017 IEEE International Conference on</i>, pp. 1201-1205, 2017.","links":{"documentLink":"/document/8217828","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8217828","pdfSize":"106KB"},"title":"Learning influential genes on cancer gene expression data with stacked denoising autoencoders"},{"order":"26","displayText":"Dailing Zhang, Wei Xu, \"A Data-Distribution-Based Imbalanced Data Classification Method for Credit Scoring Using Neural Networks\", <i>Business Intelligence and Financial Engineering (BIFE) 2013 Sixth International Conference on</i>, pp. 557-561, 2013.","links":{"documentLink":"/document/6961200","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6961200","pdfSize":"362KB"},"title":"A Data-Distribution-Based Imbalanced Data Classification Method for Credit Scoring Using Neural Networks"},{"order":"27","displayText":"Jin Xiao, Yi Hu, Shouyang Wang, \"Complex-Valued GMDH-type Neural Network for Real-Valued Classification Problems\", <i>Business Intelligence and Financial Engineering (BIFE) 2013 Sixth International Conference on</i>, pp. 70-74, 2013.","links":{"documentLink":"/document/6961093","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6961093","pdfSize":"314KB"},"title":"Complex-Valued GMDH-type Neural Network for Real-Valued Classification Problems"},{"order":"28","displayText":"Jia Pengfei, Zhang Chunkai, He Zhenyu, \"A new sampling approach for classification of imbalanced data sets with high density\", <i>Big Data and Smart Computing (BIGCOMP) 2014 International Conference on</i>, pp. 217-222, 2014.","links":{"documentLink":"/document/6741439","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6741439","pdfSize":"450KB"},"title":"A new sampling approach for classification of imbalanced data sets with high density"},{"order":"29","displayText":"Yan-Bo Lin, Xiao-Ou Ping, Te-Wei Ho, Feipei Lai, \"Processing and analysis of imbalanced liver cancer patient data by case-based reasoning\", <i>Biomedical Engineering International Conference (BMEiCON) 2014 7th</i>, pp. 1-5, 2014.","links":{"documentLink":"/document/7017371","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7017371","pdfSize":"658KB"},"title":"Processing and analysis of imbalanced liver cancer patient data by case-based reasoning"},{"order":"30","displayText":"Romero F.A.B. de Morais, Péricles B.C. Miranda, Ricardo M.A. Silva, \"A Meta-Learning Method to Select Under-Sampling Algorithms for Imbalanced Data Sets\", <i>Intelligent Systems (BRACIS) 2016 5th Brazilian Conference on</i>, pp. 385-390, 2016.","links":{"documentLink":"/document/7839617","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7839617","pdfSize":"247KB"},"title":"A Meta-Learning Method to Select Under-Sampling Algorithms for Imbalanced Data Sets"}],"nonIeee":[{"order":"1","displayText":"André Stumpf, Emmanuel Augereau, Christophe Delacourt, Julien Bonnier, \"Photogrammetric discharge monitoring of small tropical mountain rivers: A case study at Rivière des Pluies Réunion Island\", <i>Water Resources Research</i>, vol. 52, pp. 4550, 2016.","links":{"crossRefLink":"https://doi.org/10.1002/2015WR018292"},"title":"Photogrammetric discharge monitoring of small tropical mountain rivers: A case study at Rivière des Pluies, Réunion Island"},{"order":"2","displayText":"<i>Self-Adaptive Systems for Machine Intelligence</i>, pp. 44, 2011.","links":{"crossRefLink":"https://doi.org/10.1002/9781118025604.ch3"},"title":""},{"order":"3","displayText":"Haibo He, <i>Imbalanced Learning</i>, pp. 1, 2013.","links":{"crossRefLink":"https://doi.org/10.1002/9781118646106.ch1"},"title":""},{"order":"4","displayText":"Sheng Chen, Haibo He, <i>Imbalanced Learning</i>, pp. 151, 2013.","links":{"crossRefLink":"https://doi.org/10.1002/9781118646106.ch7"},"title":""},{"order":"5","displayText":"Nathalie Japkowicz, <i>Imbalanced Learning</i>, pp. 187, 2013.","links":{"crossRefLink":"https://doi.org/10.1002/9781118646106.ch8"},"title":""},{"order":"6","displayText":"<i>Activity Learning</i>, pp. 237, 2015.","links":{"crossRefLink":"https://doi.org/10.1002/9781119010258.biblio"},"title":""},{"order":"7","displayText":"Cesare Alippi, Giacomo Boracchi, Manuel Roveri, Gregory Ditzler, Robi Polikar, <i>Contemporary Issues in Systems Science and Engineering</i>, pp. 265, 2015.","links":{"crossRefLink":"https://doi.org/10.1002/9781119036821.ch7"},"title":""},{"order":"8","displayText":"<i>Pattern Recognition</i>, pp. 133, 2018.","links":{"crossRefLink":"https://doi.org/10.1002/9781119302872.ch4"},"title":""},{"order":"9","displayText":"<i>Pattern Recognition</i>, pp. 275, 2018.","links":{"crossRefLink":"https://doi.org/10.1002/9781119302872.ch9"},"title":""},{"order":"10","displayText":"Noa P. Cruz, Maite Taboada, Ruslan Mitkov, \"A machine-learning approach to negation and speculation detection for sentiment analysis\", <i>Journal of the Association for Information Science and Technology</i>, vol. 67, pp. 2118, 2016.","links":{"crossRefLink":"https://doi.org/10.1002/asi.23533"},"title":"A machine-learning approach to negation and speculation detection for sentiment analysis"},{"order":"11","displayText":"Laura Schlieker, Anna Telaar, Angelika Lueking, Peter Schulz-Knappe, Carmen Theek, Katja Ickstadt, \"Multivariate binary classification of imbalanced datasets-A case study based on high-dimensional multiplex autoimmune assay data\", <i>Biometrical Journal</i>, 2017.","links":{"crossRefLink":"https://doi.org/10.1002/bimj.201600207"},"title":"Multivariate binary classification of imbalanced datasets-A case study based on high-dimensional multiplex autoimmune assay data"},{"order":"12","displayText":"Chaoliang Li, Shigang Liu, \"A comparative study of the class imbalance problem in Twitter spam detection\", <i>Concurrency and Computation: Practice and Experience</i>, vol. 30, pp. e4281, 2018.","links":{"crossRefLink":"https://doi.org/10.1002/cpe.4281"},"title":"A comparative study of the class imbalance problem in Twitter spam detection"},{"order":"13","displayText":"Ryan A. Hill, Eric W. Fox, Scott G. Leibowitz, Anthony R. Olsen, Darren J. Thornbrugh, Marc H. Weber, \"Predictive mapping of the biotic condition of conterminous U.S. rivers and streams\", <i>Ecological Applications</i>, 2017.","links":{"crossRefLink":"https://doi.org/10.1002/eap.1617"},"title":"Predictive mapping of the biotic condition of conterminous U.S. rivers and streams"},{"order":"14","displayText":"Frédéric Mortier, Dakis-Yaoba Ouédraogo, Florian Claeys, Mahlet G. Tadesse, Guillaume Cornu, Fidèle Baya, Fabrice Benedet, Vincent Freycon, Sylvie Gourlet-Fleury, Nicolas Picard, \"Mixture of inhomogeneous matrix models for species-rich ecosystems\", <i>Environmetrics</i>, vol. 26, pp. 39, 2015.","links":{"crossRefLink":"https://doi.org/10.1002/env.2320"},"title":"Mixture of inhomogeneous matrix models for species-rich ecosystems"},{"order":"15","displayText":"Anhui Huang, Eden R. Martin, Jeffery M. Vance, Xiaodong Cai, \"Detecting Genetic Interactions in Pathway-Based Genome-Wide Association Studies\", <i>Genetic Epidemiology</i>, vol. 38, pp. 300, 2014.","links":{"crossRefLink":"https://doi.org/10.1002/gepi.21803"},"title":"Detecting Genetic Interactions in Pathway-Based Genome-Wide Association Studies"},{"order":"16","displayText":"Dong-Jun Yu, Jun Hu, Yan Huang, Hong-Bin Shen, Yong Qi, Zhen-Min Tang, Jing-Yu Yang, \"TargetATPsite: A template-free method for ATP-binding sites prediction with residue evolution image sparse representation and classifier ensemble\", <i>Journal of Computational Chemistry</i>, vol. 34, pp. 974, 2013.","links":{"crossRefLink":"https://doi.org/10.1002/jcc.23219"},"title":"TargetATPsite: A template-free method for ATP-binding sites prediction with residue evolution image sparse representation and classifier ensemble"},{"order":"17","displayText":"Ronald C. Kessler, Irving Hwang, Claire A. Hoffmire, John F. McCarthy, Maria V. Petukhova, Anthony J. Rosellini, Nancy A. Sampson, Alexandra L. Schneider, Paul A. Bradley, Ira R. Katz, Caitlin Thompson, Robert M. Bossarte, \"Developing a practical suicide risk prediction model for targeting high-risk patients in the Veterans health Administration\", <i>International Journal of Methods in Psychiatric Research</i>, pp. e1575, 2017.","links":{"crossRefLink":"https://doi.org/10.1002/mpr.1575"},"title":"Developing a practical suicide risk prediction model for targeting high-risk patients in the Veterans health Administration"},{"order":"18","displayText":"Niloufar Zarinabad, Martin Wilson, Simrandip K Gill, Karen A Manias, Nigel P Davies, Andrew C Peet, \"Multiclass imbalance learning: Improving classification of pediatric brain tumors from magnetic resonance spectroscopy\", <i>Magnetic Resonance in Medicine</i>, 2016.","links":{"crossRefLink":"https://doi.org/10.1002/mrm.26318"},"title":"Multiclass imbalance learning: Improving classification of pediatric brain tumors from magnetic resonance spectroscopy"},{"order":"19","displayText":"Yu-Yen Ou, Shu-An Chen, Yun-Min Chang, Devadasan Velmurugan, Kazuhiko Fukui, M. Michael Gromiha, \"Identification of efflux proteins using efficient radial basis function networks with position-specific scoring matrices and biochemical properties\", <i>Proteins: Structure, Function, and Bioinformatics</i>, vol. 81, pp. 1634, 2013.","links":{"crossRefLink":"https://doi.org/10.1002/prot.24322"},"title":"Identification of efflux proteins using efficient radial basis function networks with position-specific scoring matrices and biochemical properties"},{"order":"20","displayText":"Bohdan Monastyrskyy, Daniel D''Andrea, Krzysztof Fidelis, Anna Tramontano, Andriy Kryshtafovych, \"Evaluation of residue-residue contact prediction in CASP10\", <i>Proteins: Structure, Function, and Bioinformatics</i>, vol. 82, pp. 138, 2014.","links":{"crossRefLink":"https://doi.org/10.1002/prot.24340"},"title":"Evaluation of residue-residue contact prediction in CASP10"},{"order":"21","displayText":"Bohdan Monastyrskyy, Andriy Kryshtafovych, John Moult, Anna Tramontano, Krzysztof Fidelis, \"Assessment of protein disorder region predictions in CASP10\", <i>Proteins: Structure, Function, and Bioinformatics</i>, vol. 82, pp. 127, 2014.","links":{"crossRefLink":"https://doi.org/10.1002/prot.24391"},"title":"Assessment of protein disorder region predictions in CASP10"},{"order":"22","displayText":"Guang Xu, Xin Liu, Qing Yan Liu, Jianjun Li, Yanhong Zhou, \"Automatic annotation and visualization tool for mass spectrometry based glycomics\", <i>Rapid Communications in Mass Spectrometry</i>, vol. 30, pp. 2471, 2016.","links":{"crossRefLink":"https://doi.org/10.1002/rcm.7735"},"title":"Automatic annotation and visualization tool for mass spectrometry based glycomics"},{"order":"23","displayText":"Lu Wang, Dongxiao Zhu, Ming Dong, \"Clustering over-dispersed data with mixed feature types\", <i>Statistical Analysis and Data Mining: The ASA Data Science Journal</i>, vol. 11, pp. 55, 2018.","links":{"crossRefLink":"https://doi.org/10.1002/sam.11369"},"title":"Clustering over-dispersed data with mixed feature types"},{"order":"24","displayText":"Tiejian Wang, Zhiwu Zhang, Xiaoyuan Jing, Yanli Liu, \"Non-negative sparse-based SemiBoost for software defect prediction\", <i>Software Testing, Verification and Reliability</i>, vol. 26, pp. 498, 2016.","links":{"crossRefLink":"https://doi.org/10.1002/stvr.1610"},"title":"Non-negative sparse-based SemiBoost for software defect prediction"},{"order":"25","displayText":"Zhiqiang Li, Xiao-Yuan Jing, Xiaoke Zhu, \"Heterogeneous fault prediction with cost-sensitive domain adaptation\", <i>Software Testing, Verification and Reliability</i>, vol. 28, pp. e1658, 2018.","links":{"crossRefLink":"https://doi.org/10.1002/stvr.1658"},"title":"Heterogeneous fault prediction with cost-sensitive domain adaptation"},{"order":"26","displayText":"Bo Zhou, Weite Li, Jinglu Hu, \"A new segmented oversampling method for imbalanced data classification using quasi‐linear SVM\", <i>IEEJ Transactions on Electrical and Electronic Engineering</i>, vol. 12, pp. 891, 2017.","links":{"crossRefLink":"https://doi.org/10.1002/tee.22480"},"title":"A new segmented oversampling method for imbalanced data classification using quasi‐linear SVM"},{"order":"27","displayText":"Nicholas A. Povak, Paul F. Hessburg, Keith M. Reynolds, Timothy J. Sullivan, Todd C. McDonnell, R. Brion Salter, \"Machine learning and hurdle models for improving regional predictions of stream water acid neutralizing capacity\", <i>Water Resources Research</i>, vol. 49, pp. 3531, 2013.","links":{"crossRefLink":"https://doi.org/10.1002/wrcr.20308"},"title":"Machine learning and hurdle models for improving regional predictions of stream water acid neutralizing capacity"},{"order":"28","displayText":"Kousik Kundu, Rolf Backofen, <i>SH2 Domains</i>, vol. 1555, pp. 83, 2017.","links":{"crossRefLink":"https://doi.org/10.1007/978-1-4939-6762-9_6"},"title":""},{"order":"29","displayText":"Hadi Tadayyon, Mehrdad J. Gangeh, Roxana Vlad, Michael C. Kolios, Gregory J. Czarnota, <i>Fast Detection of DNA Damage</i>, vol. 1644, pp. 41, 2017.","links":{"crossRefLink":"https://doi.org/10.1007/978-1-4939-7187-9_4"},"title":""},{"order":"30","displayText":"Part Pramokchon, Punpiti Piamsa-nga, <i>Recent Advances in Information and Communication Technology</i>, vol. 265, pp. 263, 2014.","links":{"crossRefLink":"https://doi.org/10.1007/978-3-319-06538-0_26"},"title":""}]},"formulaStrippedArticleTitle":"Learning from Imbalanced Data","nonIeeeCitationCount":"2322","contentTypeDisplay":"Journals","patentCitationCount":"7","mlTime":"PT1.417262S","lastupdate":"2021-09-27","title":"Learning from Imbalanced Data","contentType":"periodicals","ieeeCitationCount":"1093","publicationNumber":"69"},{"_id":5128909,"paperCitations":{"ieee":[{"order":"1","displayText":"Hong Han, Qiqiang Han, Xiaojun Li, Jianyin Gu, \"Hierarchical spatial pyramid max pooling based on SIFT features and sparse coding for image classification\", <i>Computer Vision IET</i>, vol. 7, no. 2, pp. 144-150, 2013.","links":{"crossRefLink":"https://doi.org/10.1049/iet-cvi.2012.0145","pdfSize":"325KB"},"title":"Hierarchical spatial pyramid max pooling based on SIFT features and sparse coding for image classification"},{"order":"2","displayText":"Song Gao, Chunheng Wang, Baihua Xiao, Cunzhao Shi, Wen Zhou, Zhong Zhang, \"Scene text recognition by learning co-occurrence of strokes based on spatiality embedded dictionary\", <i>Computer Vision IET</i>, vol. 9, no. 1, pp. 138-148, 2015.","links":{"crossRefLink":"https://doi.org/10.1049/iet-cvi.2014.0022","pdfSize":"769KB"},"title":"Scene text recognition by learning co-occurrence of strokes based on spatiality embedded dictionary"},{"order":"3","displayText":"Mohammad Mehdi Farhangi, Mohsen Soryani, Mahmood Fathy, \"Informative visual words construction to improve bag of words image representation\", <i>Image Processing IET</i>, vol. 8, no. 5, pp. 310-318, 2014.","links":{"crossRefLink":"https://doi.org/10.1049/iet-ipr.2013.0449","pdfSize":"755KB"},"title":"Informative visual words construction to improve bag of words image representation"},{"order":"4","displayText":"Wangming Xu, Shiqian Wu, Meng Joo Er, Chaobing Zheng, Yimin Qiu, \"New non-negative sparse feature learning approach for content-based image retrieval\", <i>Image Processing IET</i>, vol. 11, no. 9, pp. 724-733, 2017.","links":{"crossRefLink":"https://doi.org/10.1049/iet-ipr.2016.0726","pdfSize":"4510KB"},"title":"New non-negative sparse feature learning approach for content-based image retrieval"},{"order":"5","displayText":"Cheng-Yaw Low, \"Learning compact discriminant local face descriptor with VLAD\", <i>Signal and Information Processing Association Annual Summit and Conference (APSIPA) 2015 Asia-Pacific</i>, pp. 825-833, 2015.","links":{"documentLink":"/document/7415388","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7415388","pdfSize":"672KB"},"title":"Learning compact discriminant local face descriptor with VLAD"},{"order":"6","displayText":"Kenjiro Sugimoto, Norishige Fukushima, Sei-ichiro Kamata, \"Fast bilateral filter for multichannel images via soft-assignment coding\", <i>Signal and Information Processing Association Annual Summit and Conference (APSIPA) 2016 Asia-Pacific</i>, pp. 1-4, 2016.","links":{"documentLink":"/document/7820813","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7820813","pdfSize":"1547KB"},"title":"Fast bilateral filter for multichannel images via soft-assignment coding"},{"order":"7","displayText":"Jun Tang, Ling Shao, Xiantong Zhen, \"Human Action Retrieval via efficient feature matching\", <i>Advanced Video and Signal Based Surveillance (AVSS) 2013 10th IEEE International Conference on</i>, pp. 306-311, 2013.","links":{"documentLink":"/document/6636657","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6636657","pdfSize":"374KB"},"title":"Human Action Retrieval via efficient feature matching"},{"order":"8","displayText":"Xiaodan Zhuang, Viktor Rozgić, Michael Crystal, \"Compact unsupervised EEG response representation for emotion recognition\", <i>Biomedical and Health Informatics (BHI) 2014 IEEE-EMBS International Conference on</i>, pp. 736-739, 2014.","links":{"documentLink":"/document/6864469","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6864469","pdfSize":"543KB"},"title":"Compact unsupervised EEG response representation for emotion recognition"},{"order":"9","displayText":"Usman Niaz, Bernard Merialdo, \"Leveraging from group classification for video concept detection\", <i>Content-Based Multimedia Indexing (CBMI) 2013 11th International Workshop on</i>, pp. 173-178, 2013.","links":{"documentLink":"/document/6576577","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6576577","pdfSize":"711KB"},"title":"Leveraging from group classification for video concept detection"},{"order":"10","displayText":"Wei Wu, Guanglai Gao, Jianyun Nie, \"Gaussian mixture model with semantic distance for image classification\", <i>Control and Decision Conference (2014 CCDC) The 26th Chinese</i>, pp. 1687-1691, 2014.","links":{"documentLink":"/document/6852440","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6852440","pdfSize":"144KB"},"title":"Gaussian mixture model with semantic distance for image classification"},{"order":"11","displayText":"Minguang Song, Ping Guo, \"Scene Recognition via Combining Information of Neighbors\", <i>Computational Intelligence and Security (CIS) 2012 Eighth International Conference on</i>, pp. 345-349, 2012.","links":{"documentLink":"/document/6405942","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6405942","pdfSize":"874KB"},"title":"Scene Recognition via Combining Information of Neighbors"},{"order":"12","displayText":"Chunxiao Zhang, Gaojin Wen, Zhaorong Lin, Na Yao, Zhiming Shang, Can Zhong, \"An effective bag-of-visual-word scheme for object recognition\", <i>Image and Signal Processing BioMedical Engineering and Informatics (CISP-BMEI) International Congress on</i>, pp. 417-421, 2016.","links":{"documentLink":"/document/7852747","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7852747","pdfSize":"1260KB"},"title":"An effective bag-of-visual-word scheme for object recognition"},{"order":"13","displayText":"Dongjian He, Yu Zheng, Shirui Pan, Jinglei Tang, \"Ensemble of multiple descriptors for automatic image annotation\", <i>Image and Signal Processing (CISP) 2010 3rd International Congress on</i>, vol. 4, pp. 1642-1646, 2010.","links":{"documentLink":"/document/5647738","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=5647738","pdfSize":"1037KB"},"title":"Ensemble of multiple descriptors for automatic image annotation"},{"order":"14","displayText":"Feng Tang, Huan Lu, Tanfeng Sun, Xinghao Jiang, \"Efficient image classification using sparse coding and random forest\", <i>Image and Signal Processing (CISP) 2012 5th International Congress on</i>, pp. 781-785, 2012.","links":{"documentLink":"/document/6469695","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6469695","pdfSize":"577KB"},"title":"Efficient image classification using sparse coding and random forest"},{"order":"15","displayText":"Quoc Duy Vo, Pradipta De, \"A Survey of Fingerprint-Based Outdoor Localization\", <i>Communications Surveys & Tutorials IEEE</i>, vol. 18, no. 1, pp. 491-506, 2016.","links":{"documentLink":"/document/7131436","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7131436","pdfSize":"1924KB"},"title":"A Survey of Fingerprint-Based Outdoor Localization"},{"order":"16","displayText":"Y-Lan Boureau, Francis Bach, Yann LeCun, Jean Ponce, \"Learning mid-level features for recognition\", <i>Computer Vision and Pattern Recognition (CVPR) 2010 IEEE Conference on</i>, pp. 2559-2566, 2010.","links":{"documentLink":"/document/5539963","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=5539963","pdfSize":"214KB"},"title":"Learning mid-level features for recognition"},{"order":"17","displayText":"Hervé Jégou, Matthijs Douze, Cordelia Schmid, Patrick Pérez, \"Aggregating local descriptors into a compact image representation\", <i>Computer Vision and Pattern Recognition (CVPR) 2010 IEEE Conference on</i>, pp. 3304-3311, 2010.","links":{"documentLink":"/document/5540039","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=5540039","pdfSize":"1691KB"},"title":"Aggregating local descriptors into a compact image representation"},{"order":"18","displayText":"Liang Li, Shuqiang Jiang, Qingming Huang, \"Learning image Vicept description via mixed-norm regularization for large scale semantic image search\", <i>Computer Vision and Pattern Recognition (CVPR) 2011 IEEE Conference on</i>, pp. 825-832, 2011.","links":{"documentLink":"/document/5995570","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=5995570","pdfSize":"1234KB"},"title":"Learning image Vicept description via mixed-norm regularization for large scale semantic image search"},{"order":"19","displayText":"Pradeep Natarajan, Shuang Wu, Shiv Vitaladevuni, Xiaodan Zhuang, Stavros Tsakalidis, Unsang Park, Rohit Prasad, Premkumar Natarajan, \"Multimodal feature fusion for robust event detection in web videos\", <i>Computer Vision and Pattern Recognition (CVPR) 2012 IEEE Conference on</i>, pp. 1298-1305, 2012.","links":{"documentLink":"/document/6247814","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6247814","pdfSize":"380KB"},"title":"Multimodal feature fusion for robust event detection in web videos"},{"order":"20","displayText":"Aymen Shabou, Hervé LeBorgne, \"Locality-constrained and spatially regularized coding for scene categorization\", <i>Computer Vision and Pattern Recognition (CVPR) 2012 IEEE Conference on</i>, pp. 3618-3625, 2012.","links":{"documentLink":"/document/6248107","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6248107","pdfSize":"904KB"},"title":"Locality-constrained and spatially regularized coding for scene categorization"},{"order":"21","displayText":"Greg Flitton, Toby P. Breckon, Najla Megherbi, \"A 3D extension to cortex like mechanisms for 3D object class recognition\", <i>Computer Vision and Pattern Recognition (CVPR) 2012 IEEE Conference on</i>, pp. 3634-3641, 2012.","links":{"documentLink":"/document/6248109","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6248109","pdfSize":"657KB"},"title":"A 3D extension to cortex like mechanisms for 3D object class recognition"},{"order":"22","displayText":"Akihiko Torii, Josef Sivic, Tomá Pajdla, Masatoshi Okutomi, \"Visual Place Recognition with Repetitive Structures\", <i>Computer Vision and Pattern Recognition (CVPR) 2013 IEEE Conference on</i>, pp. 883-890, 2013.","links":{"documentLink":"/document/6618963","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6618963","pdfSize":"6129KB"},"title":"Visual Place Recognition with Repetitive Structures"},{"order":"23","displayText":"Liang Zheng, Shengjin Wang, Ziqiong Liu, Qi Tian, \"Lp-Norm IDF for Large Scale Image Search\", <i>Computer Vision and Pattern Recognition (CVPR) 2013 IEEE Conference on</i>, pp. 1626-1633, 2013.","links":{"documentLink":"/document/6619057","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6619057","pdfSize":"1449KB"},"title":"Lp-Norm IDF for Large Scale Image Search"},{"order":"24","displayText":"Amirreza Shaban, Hamid R. Rabiee, Mehrdad Farajtabar, Marjan Ghazvininejad, \"From Local Similarity to Global Coding: An Application to Image Classification\", <i>Computer Vision and Pattern Recognition (CVPR) 2013 IEEE Conference on</i>, pp. 2794-2801, 2013.","links":{"documentLink":"/document/6619204","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6619204","pdfSize":"830KB"},"title":"From Local Similarity to Global Coding: An Application to Image Classification"},{"order":"25","displayText":"Xavier Boix, Michael Gygli, Gemma Roig, Luc Van Gool, \"Sparse Quantization for Patch Description\", <i>Computer Vision and Pattern Recognition (CVPR) 2013 IEEE Conference on</i>, pp. 2842-2849, 2013.","links":{"documentLink":"/document/6619210","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6619210","pdfSize":"526KB"},"title":"Sparse Quantization for Patch Description"},{"order":"26","displayText":"Waqas Sultani, Imran Saleemi, \"Human Action Recognition across Datasets by Foreground-Weighted Histogram Decomposition\", <i>Computer Vision and Pattern Recognition (CVPR) 2014 IEEE Conference on</i>, pp. 764-771, 2014.","links":{"documentLink":"/document/6909498","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6909498","pdfSize":"404KB"},"title":"Human Action Recognition across Datasets by Foreground-Weighted Histogram Decomposition"},{"order":"27","displayText":"Chunyuan Li, Maks Ovsjanikov, Frederic Chazal, \"Persistence-Based Structural Recognition\", <i>Computer Vision and Pattern Recognition (CVPR) 2014 IEEE Conference on</i>, pp. 2003-2010, 2014.","links":{"documentLink":"/document/6909654","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6909654","pdfSize":"3150KB"},"title":"Persistence-Based Structural Recognition"},{"order":"28","displayText":"Koen E. A. Van De Sande, Cees G.M. Snoek, Arnold W.M. Smeulders, \"Fisher and VLAD with FLAIR\", <i>Computer Vision and Pattern Recognition (CVPR) 2014 IEEE Conference on</i>, pp. 2377-2384, 2014.","links":{"documentLink":"/document/6909701","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6909701","pdfSize":"847KB"},"title":"Fisher and VLAD with FLAIR"},{"order":"29","displayText":"Shuang Wu, Sravanthi Bondugula, Florian Luisier, Xiaodan Zhuang, Pradeep Natarajan, \"Zero-Shot Event Detection Using Multi-modal Fusion of Weakly Supervised Concepts\", <i>Computer Vision and Pattern Recognition (CVPR) 2014 IEEE Conference on</i>, pp. 2665-2672, 2014.","links":{"documentLink":"/document/6909737","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6909737","pdfSize":"542KB"},"title":"Zero-Shot Event Detection Using Multi-modal Fusion of Weakly Supervised Concepts"},{"order":"30","displayText":"Hervé Jégou, Andrew Zisserman, \"Triangulation Embedding and Democratic Aggregation for Image Search\", <i>Computer Vision and Pattern Recognition (CVPR) 2014 IEEE Conference on</i>, pp. 3310-3317, 2014.","links":{"documentLink":"/document/6909819","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6909819","pdfSize":"624KB"},"title":"Triangulation Embedding and Democratic Aggregation for Image Search"}],"nonIeee":[{"order":"1","displayText":"<i>Color in Computer Vision</i>, pp. 341, 2012.","links":{"crossRefLink":"https://doi.org/10.1002/9781118350089.refs"},"title":""},{"order":"2","displayText":"Hervé Le Borgne, Aymen Shabou, <i>Intelligent Video Surveillance Systems</i>, pp. 273, 2013.","links":{"crossRefLink":"https://doi.org/10.1002/9781118577851.ch16"},"title":""},{"order":"3","displayText":"Arnold Wiliem, Peter Hobson, Rodney F. Minchin, Brian C. Lovell, \"A bag of cells approach for antinuclear antibodies HEp-2 image classification\", <i>Cytometry Part A</i>, vol. 87, pp. 549, 2015.","links":{"crossRefLink":"https://doi.org/10.1002/cyto.a.22597"},"title":"A bag of cells approach for antinuclear antibodies HEp-2 image classification"},{"order":"4","displayText":"Camille Kurtz, Paul-André Idoux, Avinash Thangali, Florence Cloppet, Christopher F. Beaulieu, Daniel L. Rubin, <i>Multimodal Retrieval in the Medical Domain</i>, vol. 9059, pp. 11, 2015.","links":{"crossRefLink":"https://doi.org/10.1007/978-3-319-24471-6_2"},"title":""},{"order":"5","displayText":"Kimiaki Shirahama, Marcin Grzegorzek, <i>Information Technologies in Medicine</i>, vol. 472, pp. 27, 2016.","links":{"crossRefLink":"https://doi.org/10.1007/978-3-319-39904-1_3"},"title":""},{"order":"6","displayText":"Xiang Xu, Xingkun Wu, Feng Lin, <i>Cellular Image Classification</i>, pp. 81, 2017.","links":{"crossRefLink":"https://doi.org/10.1007/978-3-319-47629-2_4"},"title":""},{"order":"7","displayText":"Qingfeng Liu, Yukhe Lavinia, Abhishek Verma, Joyoung Lee, Lazar Spasovic, Chengjun Liu, <i>Recent Advances in Intelligent Image Search and Video Retrieval</i>, vol. 121, pp. 1, 2017.","links":{"crossRefLink":"https://doi.org/10.1007/978-3-319-52081-0_1"},"title":""},{"order":"8","displayText":"Qingfeng Liu, Chengjun Liu, <i>Recent Advances in Intelligent Image Search and Video Retrieval</i>, vol. 121, pp. 45, 2017.","links":{"crossRefLink":"https://doi.org/10.1007/978-3-319-52081-0_3"},"title":""},{"order":"9","displayText":"Miguel Pagola, Juan I. Forcen, Edurne Barrenechea, Javier Fernández, Humberto Bustince, <i>Pattern Recognition and Image Analysis</i>, vol. 10255, pp. 437, 2017.","links":{"crossRefLink":"https://doi.org/10.1007/978-3-319-58838-4_48"},"title":""},{"order":"10","displayText":"Raquel Almeida, Benjamin Bustos, Zenilton Kleber G. do Patrocínio, Silvio Jamil F. Guimarães, <i>Image Analysis and Processing - ICIAP 2017</i>, vol. 10484, pp. 185, 2017.","links":{"crossRefLink":"https://doi.org/10.1007/978-3-319-68560-1_17"},"title":""},{"order":"11","displayText":"Reede Ren, John Collomosse, Joemon Jose, <i>Advances in Multimedia Modeling</i>, vol. 6523, pp. 118, 2011.","links":{"crossRefLink":"https://doi.org/10.1007/978-3-642-17832-0_12"},"title":""},{"order":"12","displayText":"Snehasis Mukherjee, Sujoy Kumar Biswas, Dipti Prasad Mukherjee, <i>Computer Vision – ACCV 2010</i>, vol. 6492, pp. 244, 2011.","links":{"crossRefLink":"https://doi.org/10.1007/978-3-642-19315-6_19"},"title":""},{"order":"13","displayText":"Martin Solli, Reiner Lenz, <i>Image Analysis</i>, vol. 6688, pp. 218, 2011.","links":{"crossRefLink":"https://doi.org/10.1007/978-3-642-21227-7_21"},"title":""},{"order":"14","displayText":"Yinghao Cai, Matti Pietikäinen, <i>Computer Vision – ACCV 2010 Workshops</i>, vol. 6468, pp. 205, 2011.","links":{"crossRefLink":"https://doi.org/10.1007/978-3-642-22822-3_21"},"title":""},{"order":"15","displayText":"Hervé Le Borgne, Pablo Muñoz Fuentes, <i>Advanced Concepts for Intelligent Vision Systems</i>, vol. 6915, pp. 22, 2011.","links":{"crossRefLink":"https://doi.org/10.1007/978-3-642-23687-7_3"},"title":""},{"order":"16","displayText":"Otávio A. B. Penatti, Eduardo Valle, Ricardo da S. Torres, <i>Progress in Pattern Recognition, Image Analysis, Computer Vision, and Applications</i>, vol. 7042, pp. 240, 2011.","links":{"crossRefLink":"https://doi.org/10.1007/978-3-642-25085-9_28"},"title":""},{"order":"17","displayText":"Gabriela Csurka, Florent Perronnin, <i>Computer Vision, Imaging and Computer Graphics. Theory and Applications</i>, vol. 229, pp. 28, 2011.","links":{"crossRefLink":"https://doi.org/10.1007/978-3-642-25382-9_2"},"title":""},{"order":"18","displayText":"Fahad Shahbaz Khan, Joost van de Weijer, Rao Muhammad Anwer, Andrew D. Bagdanov, Michael Felsberg, Jorma Laaksonen, \"Scale coding bag of deep features for human attribute and action recognition\", <i>Machine Vision and Applications</i>, vol. 29, pp. 55, 2018.","links":{"crossRefLink":"https://doi.org/10.1007/s00138-017-0871-1"},"title":"Scale coding bag of deep features for human attribute and action recognition"},{"order":"19","displayText":"Yang Li, Junyong Ye, Tongqing Wang, Shijian Huang, \"Augmenting bag-of-words: a robust contextual representation of spatiotemporal interest points for action recognition\", <i>The Visual Computer</i>, vol. 31, pp. 1383, 2015.","links":{"crossRefLink":"https://doi.org/10.1007/s00371-014-1020-8"},"title":"Augmenting bag-of-words: a robust contextual representation of spatiotemporal interest points for action recognition"},{"order":"20","displayText":"Zhi Liu, Shuqiong Xu, Yun Zhang, Xin Chen, C.L. Philip Chen, \"Interval type-2 fuzzy kernel based support vector machine algorithm for scene classification of humanoid robot\", <i>Soft Computing</i>, vol. 18, pp. 589, 2014.","links":{"crossRefLink":"https://doi.org/10.1007/s00500-013-1080-0"},"title":"Interval type-2 fuzzy kernel based support vector machine algorithm for scene classification of humanoid robot"},{"order":"21","displayText":"Chunyuan Li, A. Ben Hamza, \"Spatially aggregating spectral descriptors for nonrigid 3D shape retrieval: a comparative survey\", <i>Multimedia Systems</i>, vol. 20, pp. 253, 2014.","links":{"crossRefLink":"https://doi.org/10.1007/s00530-013-0318-0"},"title":"Spatially aggregating spectral descriptors for nonrigid 3D shape retrieval: a comparative survey"},{"order":"22","displayText":"Liang Zheng, Shengjin Wang, Peizhen Guo, Hanyue Liang, Qi Tian, \"Tensor index for large scale image retrieval\", <i>Multimedia Systems</i>, vol. 21, pp. 569, 2015.","links":{"crossRefLink":"https://doi.org/10.1007/s00530-014-0415-8"},"title":"Tensor index for large scale image retrieval"},{"order":"23","displayText":"Bin Wang, Wen Gai, Shouchun Guo, Yu Liu, Wei Wang, Maojun Zhang, \"Spatially regularized and locality-constrained linear coding for human action recognition\", <i>Optical Review</i>, vol. 21, pp. 226, 2014.","links":{"crossRefLink":"https://doi.org/10.1007/s10043-014-0033-x"},"title":"Spatially regularized and locality-constrained linear coding for human action recognition"},{"order":"24","displayText":"Peng Tang, Jin Zhang, Xinggang Wang, Bin Feng, Fabio Roli, Wenyu Liu, \"Learning extremely shared middle-level image representation for scene classification\", <i>Knowledge and Information Systems</i>, vol. 52, pp. 509, 2017.","links":{"crossRefLink":"https://doi.org/10.1007/s10115-016-1015-z"},"title":"Learning extremely shared middle-level image representation for scene classification"},{"order":"25","displayText":"Wei Yang, Zhentai Lu, Mei Yu, Meiyan Huang, Qianjin Feng, Wufan Chen, \"Content-Based Retrieval of Focal Liver Lesions Using Bag-of-Visual-Words Representations of Single- and Multiphase Contrast-Enhanced CT Images\", <i>Journal of Digital Imaging</i>, vol. 25, pp. 708, 2012.","links":{"crossRefLink":"https://doi.org/10.1007/s10278-012-9495-1"},"title":"Content-Based Retrieval of Focal Liver Lesions Using Bag-of-Visual-Words Representations of Single- and Multiphase Contrast-Enhanced CT Images"},{"order":"26","displayText":"Qiling Tang, Jirong Yang, Xianfu Xia, \"Medical Image Retrieval Using Multi-Texton Assignment\", <i>Journal of Digital Imaging</i>, vol. 31, pp. 107, 2018.","links":{"crossRefLink":"https://doi.org/10.1007/s10278-017-0017-z"},"title":"Medical Image Retrieval Using Multi-Texton Assignment"},{"order":"27","displayText":"Qi-Hai Zhu, Zhe-Zheng Wang, Xiao-Jiao Mao, Yu-Bin Yang, \"Spatial locality-preserving feature coding for image classification\", <i>Applied Intelligence</i>, 2017.","links":{"crossRefLink":"https://doi.org/10.1007/s10489-016-0887-7"},"title":"Spatial locality-preserving feature coding for image classification"},{"order":"28","displayText":"Pedro R. Mendes Júnior, Roberto M. de Souza, Rafael de O. Werneck, Bernardo V. Stein, Daniel V. Pazinato, Waldir R. de Almeida, Otávio A. B. Penatti, Ricardo da S. Torres, Anderson Rocha, \"Nearest neighbors distance ratio open-set classifier\", <i>Machine Learning</i>, 2016.","links":{"crossRefLink":"https://doi.org/10.1007/s10994-016-5610-8"},"title":"Nearest neighbors distance ratio open-set classifier"},{"order":"29","displayText":"Qi Tian, Shiliang Zhang, Wengang Zhou, Rongrong Ji, Bingbing Ni, Nicu Sebe, \"Building descriptive and discriminative visual codebook for large-scale image applications\", <i>Multimedia Tools and Applications</i>, vol. 51, pp. 441, 2011.","links":{"crossRefLink":"https://doi.org/10.1007/s11042-010-0636-6"},"title":"Building descriptive and discriminative visual codebook for large-scale image applications"},{"order":"30","displayText":"Zhen Li, Kim-Hui Yap, \"Beyond Bag-of-Words: combining generative and discriminative models for scene categorization\", <i>Multimedia Tools and Applications</i>, vol. 71, pp. 1033, 2014.","links":{"crossRefLink":"https://doi.org/10.1007/s11042-012-1245-3"},"title":"Beyond Bag-of-Words: combining generative and discriminative models for scene categorization"}]},"formulaStrippedArticleTitle":"Visual Word Ambiguity","nonIeeeCitationCount":"262","contentTypeDisplay":"Journals","patentCitationCount":"3","mlTime":"PT1.042745S","lastupdate":"2021-11-07","title":"Visual Word Ambiguity","contentType":"periodicals","ieeeCitationCount":"273","publicationNumber":"34"},{"_id":5128911,"paperCitations":{"ieee":[{"order":"1","displayText":"Shervin Rahimzadeh Arashloo, Josef Kittler, \"Efficient processing of MRFs for unconstrained-pose face recognition\", <i>Biometrics: Theory Applications and Systems (BTAS) 2013 IEEE Sixth International Conference on</i>, pp. 1-8, 2013.","links":{"documentLink":"/document/6712721","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6712721","pdfSize":"256KB"},"title":"Efficient processing of MRFs for unconstrained-pose face recognition"},{"order":"2","displayText":"Yun Zheng, Pei Chen, Jiang-Zhong Cao, \"MAP-MRF inference based on extended junction tree representation\", <i>Computer Vision and Pattern Recognition (CVPR) 2012 IEEE Conference on</i>, pp. 1696-1703, 2012.","links":{"documentLink":"/document/6247864","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6247864","pdfSize":"321KB"},"title":"MAP-MRF inference based on extended junction tree representation"},{"order":"3","displayText":"Yun Zeng, Chaohui Wang, Stefano Soatto, Shing-Tung Yau, \"Nonlinearly Constrained MRFs: Exploring the Intrinsic Dimensions of Higher-Order Cliques\", <i>Computer Vision and Pattern Recognition (CVPR) 2013 IEEE Conference on</i>, pp. 1706-1713, 2013.","links":{"documentLink":"/document/6619067","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6619067","pdfSize":"1358KB"},"title":"Nonlinearly Constrained MRFs: Exploring the Intrinsic Dimensions of Higher-Order Cliques"},{"order":"4","displayText":"Jörg Hendrik Kappes, Markus Speth, Gerhard Reinelt, Christoph Schnörr, \"Towards Efficient and Exact MAP-Inference for Large Scale Discrete Computer Vision Problems via Combinatorial Optimization\", <i>Computer Vision and Pattern Recognition (CVPR) 2013 IEEE Conference on</i>, pp. 1752-1758, 2013.","links":{"documentLink":"/document/6619073","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6619073","pdfSize":"397KB"},"title":"Towards Efficient and Exact MAP-Inference for Large Scale Discrete Computer Vision Problems via Combinatorial Optimization"},{"order":"5","displayText":"Zhen Zhang, Qinfeng Shi, Julian McAuley, Wei Wei, Yanning Zhang, Anton van den Hengel, \"Pairwise Matching through Max-Weight Bipartite Belief Propagation\", <i>Computer Vision and Pattern Recognition (CVPR) 2016 IEEE Conference on</i>, pp. 1202-1210, 2016.","links":{"documentLink":"/document/7780504","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7780504","pdfSize":"650KB"},"title":"Pairwise Matching through Max-Weight Bipartite Belief Propagation"},{"order":"6","displayText":"Paul Swoboda, Jan Kuske, Bogdan Savchynskyy, \"A Dual Ascent Framework for Lagrangean Decomposition of Combinatorial Problems\", <i>Computer Vision and Pattern Recognition (CVPR) 2017 IEEE Conference on</i>, pp. 4950-4960, 2017.","links":{"documentLink":"/document/8100009","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8100009","pdfSize":"331KB"},"title":"A Dual Ascent Framework for Lagrangean Decomposition of Combinatorial Problems"},{"order":"7","displayText":"Paul Swoboda, Carsten Rother, Hassan Abu Alhaija, Dagmar Kainmüller, Bogdan Savchynskyy, \"A Study of Lagrangean Decompositions and Dual Ascent Solvers for Graph Matching\", <i>Computer Vision and Pattern Recognition (CVPR) 2017 IEEE Conference on</i>, pp. 7062-7071, 2017.","links":{"documentLink":"/document/8100230","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8100230","pdfSize":"327KB"},"title":"A Study of Lagrangean Decompositions and Dual Ascent Solvers for Graph Matching"},{"order":"8","displayText":"Carl Olsson, Johannes Ulén, Yuri Boykov, Vladimir Kolmogorov, \"Partial Enumeration and Curvature Regularization\", <i>Computer Vision (ICCV) 2013 IEEE International Conference on</i>, pp. 2936-2943, 2013.","links":{"documentLink":"/document/6751476","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6751476","pdfSize":"467KB"},"title":"Partial Enumeration and Curvature Regularization"},{"order":"9","displayText":"Yun Zeng, Chaohui Wang, Xianfeng Gu, Dimitris Samaras, Nikos Paragios, \"A Generic Deformation Model for Dense Non-rigid Surface Registration: A Higher-Order MRF-Based Approach\", <i>Computer Vision (ICCV) 2013 IEEE International Conference on</i>, pp. 3360-3367, 2013.","links":{"documentLink":"/document/6751529","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6751529","pdfSize":"1335KB"},"title":"A Generic Deformation Model for Dense Non-rigid Surface Registration: A Higher-Order MRF-Based Approach"},{"order":"10","displayText":"Dina Goldin, David Burshtein, \"Iterative Linear Programming Decoding of Nonbinary LDPC Codes With Linear Complexity\", <i>Information Theory IEEE Transactions on</i>, vol. 59, no. 1, pp. 282-300, 2013.","links":{"documentLink":"/document/6261547","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6261547","pdfSize":"5290KB"},"title":"Iterative Linear Programming Decoding of Nonbinary LDPC Codes With Linear Complexity"},{"order":"11","displayText":"Christopher Zach, Christian Häne, Marc Pollefeys, \"What Is Optimized in Convex Relaxations for Multilabel Problems: Connecting Discrete and Continuously Inspired MAP Inference\", <i>Pattern Analysis and Machine Intelligence IEEE Transactions on</i>, vol. 36, no. 1, pp. 157-170, 2014.","links":{"documentLink":"/document/6523224","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6523224","pdfSize":"1073KB"},"title":"What Is Optimized in Convex Relaxations for Multilabel Problems: Connecting Discrete and Continuously Inspired MAP Inference"},{"order":"12","displayText":"Vladimir Kolmogorov, \"A New Look at Reweighted Message Passing\", <i>Pattern Analysis and Machine Intelligence IEEE Transactions on</i>, vol. 37, no. 5, pp. 919-930, 2015.","links":{"documentLink":"/document/6926846","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6926846","pdfSize":"573KB"},"title":"A New Look at Reweighted Message Passing"},{"order":"13","displayText":"Tomáš Werner, \"Marginal Consistency: Upper-Bounding Partition Functions over Commutative Semirings\", <i>Pattern Analysis and Machine Intelligence IEEE Transactions on</i>, vol. 37, no. 7, pp. 1455-1468, 2015.","links":{"documentLink":"/document/6928491","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6928491","pdfSize":"258KB"},"title":"Marginal Consistency: Upper-Bounding Partition Functions over Commutative Semirings"},{"order":"14","displayText":"Yun Zeng, Chaohui Wang, Xianfeng Gu, Dimitris Samaras, Nikos Paragios, \"Higher-Order Graph Principles towards Non-Rigid Surface Registration\", <i>Pattern Analysis and Machine Intelligence IEEE Transactions on</i>, vol. 38, no. 12, pp. 2416-2429, 2016.","links":{"documentLink":"/document/7404254","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7404254","pdfSize":"1496KB"},"title":"Higher-Order Graph Principles towards Non-Rigid Surface Registration"},{"order":"15","displayText":"Safa Messaoud, Maghav Kumar, Alexander G. Schwing, \"Can We Learn Heuristics For Graphical Model Inference Using Reinforcement Learning?\", <i>Computer Vision and Pattern Recognition Workshops (CVPRW)2020 IEEE/CVF Conference on</i>, pp. 3313-3323, 2020.","links":{"documentLink":"/document/9151034","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=9151034","pdfSize":"1419KB"},"title":"Can We Learn Heuristics For Graphical Model Inference Using Reinforcement Learning?"},{"order":"16","displayText":"Safa Messaoud, Maghav Kumar, Alexander G. Schwing, \"Can We Learn Heuristics for Graphical Model Inference Using Reinforcement Learning?\", <i>Computer Vision and Pattern Recognition (CVPR) 2020 IEEE/CVF Conference on</i>, pp. 7586-7596, 2020.","links":{"documentLink":"/document/9156920","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=9156920","pdfSize":"1943KB"},"title":"Can We Learn Heuristics for Graphical Model Inference Using Reinforcement Learning?"}],"nonIeee":[{"order":"1","displayText":"Chaohui Wang, Nikos Komodakis, Nikos Paragios, \"Markov Random Field modeling inference & learning in computer vision & image understanding: A survey\", <i>Computer Vision and Image Understanding</i>, vol. 117, pp. 1610, 2013.","links":{"crossRefLink":"https://doi.org/10.1016/j.cviu.2013.07.004"},"title":"Markov Random Field modeling, inference & learning in computer vision & image understanding: A survey"},{"order":"2","displayText":"Alexander Shekhovtsov, \"Higher order maximum persistency and comparison theorems\", <i>Computer Vision and Image Understanding</i>, vol. 143, pp. 54, 2016.","links":{"crossRefLink":"https://doi.org/10.1016/j.cviu.2015.05.002"},"title":"Higher order maximum persistency and comparison theorems"},{"order":"3","displayText":"Shervin Rahimzadeh Arashloo, Josef Kittler, \"Fast pose invariant face recognition using super coupled multiresolution Markov Random Fields on a GPU\", <i>Pattern Recognition Letters</i>, vol. 48, pp. 49, 2014.","links":{"crossRefLink":"https://doi.org/10.1016/j.patrec.2014.05.017"},"title":"Fast pose invariant face recognition using super coupled multiresolution Markov Random Fields on a GPU"},{"order":"4","displayText":"Wei Gao, \"Three algorithms for graph locally harmonious colouring\", <i>Journal of Difference Equations and Applications</i>, pp. 1, 2015.","links":{"crossRefLink":"https://doi.org/10.1080/10236198.2015.1124101"},"title":"Three algorithms for graph locally harmonious colouring"},{"order":"5","displayText":"Michail I. Schlesinger, \"Pattern Recognition as an Implementation of a Certain Type of Thought Processes\", <i>Upravlâûŝie sistemy i mašiny</i>, pp. 20, 2017.","links":{"crossRefLink":"https://doi.org/10.15407/usim.2017.02.020"},"title":"Pattern Recognition as an Implementation of a Certain Type of Thought Processes"},{"order":"6","displayText":"","links":{"crossRefLink":"https://doi.org/10.1007/978-3-642-33885-4_29"},"title":""},{"order":"7","displayText":"Stanislav Živný, <i>The Complexity of Valued Constraint Satisfaction Problems</i>, pp. 131, 2012.","links":{"crossRefLink":"https://doi.org/10.1007/978-3-642-33974-5_8"},"title":""},{"order":"8","displayText":"Hariprasad Kannan, Nikos Komodakis, Nikos Paragios, <i></i>, 2019.","links":{"crossRefLink":"https://doi.org/10.1016/bs.hna.2019.06.001"},"title":""}]},"formulaStrippedArticleTitle":"Revisiting the Linear Programming Relaxation Approach to Gibbs Energy Minimization and Weighted Constraint Satisfaction","nonIeeeCitationCount":"8","contentTypeDisplay":"Journals","patentCitationCount":"0","mlTime":"PT0.36072S","lastupdate":"2021-10-02","title":"Revisiting the Linear Programming Relaxation Approach to Gibbs Energy Minimization and Weighted Constraint Satisfaction","contentType":"periodicals","ieeeCitationCount":"16","publicationNumber":"34"},{"_id":5129275,"paperCitations":{"ieee":[{"order":"1","displayText":"David Frederic Crouse, \"How to incorporate generic refraction models into multistatic tracking algorithms\", <i>Aerospace Conference 2013 IEEE</i>, pp. 1-16, 2013.","links":{"documentLink":"/document/6496875","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6496875","pdfSize":"514KB"},"title":"How to incorporate generic refraction models into multistatic tracking algorithms"},{"order":"2","displayText":"Jarno Mielikainen, Bormin Huang, Hung-Lung Allen Huang, \"GPU-Accelerated Multi-Profile Radiative Transfer Model for the Infrared Atmospheric Sounding Interferometer\", <i>Selected Topics in Applied Earth Observations and Remote Sensing IEEE Journal of</i>, vol. 4, no. 3, pp. 691-700, 2011.","links":{"documentLink":"/document/5948390","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=5948390","pdfSize":"990KB"},"title":"GPU-Accelerated Multi-Profile Radiative Transfer Model for the Infrared Atmospheric Sounding Interferometer"},{"order":"3","displayText":"Craig A. Lee, Samuel D. Gasster, Antonio Plaza, Chein-I Chang, Bormin Huang, \"Recent Developments in High Performance Computing for Remote Sensing: A Review\", <i>Selected Topics in Applied Earth Observations and Remote Sensing IEEE Journal of</i>, vol. 4, no. 3, pp. 508-527, 2011.","links":{"documentLink":"/document/5981407","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=5981407","pdfSize":"1665KB"},"title":"Recent Developments in High Performance Computing for Remote Sensing: A Review"},{"order":"4","displayText":"Jarno Mielikainen, Bormin Huang, Hung-Lung Allen Huang, Mitchell D. Goldberg, \"GPU Implementation of Stony Brook University 5-Class Cloud Microphysics Scheme in the WRF\", <i>Selected Topics in Applied Earth Observations and Remote Sensing IEEE Journal of</i>, vol. 5, no. 2, pp. 625-633, 2012.","links":{"documentLink":"/document/6180006","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6180006","pdfSize":"1497KB"},"title":"GPU Implementation of Stony Brook University 5-Class Cloud Microphysics Scheme in the WRF"},{"order":"5","displayText":"Jarno Mielikainen, Bormin Huang, Hung-Lung Allen Huang, Mitchell D. Goldberg, \"Improved GPU/CUDA Based Parallel Weather and Research Forecast (WRF) Single Moment 5-Class (WSM5) Cloud Microphysics\", <i>Selected Topics in Applied Earth Observations and Remote Sensing IEEE Journal of</i>, vol. 5, no. 4, pp. 1256-1265, 2012.","links":{"documentLink":"/document/6182591","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6182591","pdfSize":"1885KB"},"title":"Improved GPU/CUDA Based Parallel Weather and Research Forecast (WRF) Single Moment 5-Class (WSM5) Cloud Microphysics"},{"order":"6","displayText":"Pascal Gegout, Pascal Oberlé, Camille Desjardins, John Moyard, Pierre-Marie Brunet, \"Ray-Tracing of GNSS Signal Through the Atmosphere Powered by CUDA HMPP and GPUs Technologies\", <i>Selected Topics in Applied Earth Observations and Remote Sensing IEEE Journal of</i>, vol. 7, no. 5, pp. 1592-1602, 2014.","links":{"documentLink":"/document/6570742","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6570742","pdfSize":"1842KB"},"title":"Ray-Tracing of GNSS Signal Through the Atmosphere Powered by CUDA, HMPP and GPUs Technologies"},{"order":"7","displayText":"Mi Wang, Liuyang Fang, Deren Li, Jun Pan, \"Using Multiple GPUs to Accelerate MTF Compensation and Georectification of High-Resolution Optical Satellite Images\", <i>Selected Topics in Applied Earth Observations and Remote Sensing IEEE Journal of</i>, vol. 8, no. 10, pp. 4952-4972, 2015.","links":{"documentLink":"/document/7312409","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7312409","pdfSize":"5264KB"},"title":"Using Multiple GPUs to Accelerate MTF Compensation and Georectification of High-Resolution Optical Satellite Images"},{"order":"8","displayText":"Norberto Garcia, \"Parallel power flow solutions using a biconjugate gradient algorithm and a Newton method: A GPU-based approach\", <i>Power and Energy Society General Meeting 2010 IEEE</i>, pp. 1-4, 2010.","links":{"documentLink":"/document/5589682","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=5589682","pdfSize":"262KB"},"title":"Parallel power flow solutions using a biconjugate gradient algorithm and a Newton method: A GPU-based approach"},{"order":"9","displayText":"Vahab Nafisi, Landon Urquhart, Marcelo C. Santos, Felipe G. Nievinski, Johannes Bohm, Dudy D. Wijaya, Harald Schuh, Alireza Azmoudeh Ardalan, Thomas Hobiger, Ryuichi Ichikawa, Florian Zus, Jens Wickert, Pascal Gegout, \"Comparison of Ray-Tracing Packages for Troposphere Delays\", <i>Geoscience and Remote Sensing IEEE Transactions on</i>, vol. 50, no. 2, pp. 469-481, 2012.","links":{"documentLink":"/document/5979156","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=5979156","pdfSize":"986KB"},"title":"Comparison of Ray-Tracing Packages for Troposphere Delays"},{"order":"10","displayText":"Zhuoqun Wang, Yajun Li, Canle Li, Hongzhi Li, Shuangshuang Li, \"An Improved RD Imaging Method for SAR on Geosynchronous Orbit\", <i>SAR Symposium (CISS) 2018 China International</i>, pp. 1-4, 2018.","links":{"documentLink":"/document/8551990","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8551990","pdfSize":"456KB"},"title":"An Improved RD Imaging Method for SAR on Geosynchronous Orbit"}],"nonIeee":[{"order":"1","displayText":"Florian Zus, Galina Dick, Jan Dou&#x0161;a, Stefan Heise, Jens Wickert, \"The rapid and precise computation of GPS slant total delays and mapping factors utilizing a numerical weather model\", <i>Radio Science</i>, vol. 49, pp. 207, 2014.","links":{"documentLink":"/document/7771449","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7771449"},"title":"The rapid and precise computation of GPS slant total delays and mapping factors utilizing a numerical weather model"},{"order":"2","displayText":"Thomas Hobiger, Youhei Kinoshita, Shingo Shimizu, Ryuichi Ichikawa, Masato Furuya, Tetsuro Kondo, Yasuhiro Koyama, \"On the importance of accurately ray-traced troposphere corrections for Interferometric SAR data\", <i>Journal of Geodesy</i>, vol. 84, pp. 537, 2010.","links":{"crossRefLink":"https://doi.org/10.1007/s00190-010-0393-3"},"title":"On the importance of accurately ray-traced troposphere corrections for Interferometric SAR data"},{"order":"3","displayText":"Landon Urquhart, Felipe G. Nievinski, Marcelo C. Santos, \"Ray-traced slant factors for mitigating the tropospheric delay at the observation level\", <i>Journal of Geodesy</i>, vol. 86, pp. 149, 2012.","links":{"crossRefLink":"https://doi.org/10.1007/s00190-011-0503-x"},"title":"Ray-traced slant factors for mitigating the tropospheric delay at the observation level"},{"order":"4","displayText":"Jarno Mielikainen, Bormin Huang, Jun Wang, H.-L. Allen Huang, Mitchell D. Goldberg, \"Compute unified device architecture (CUDA)-based parallelization of WRF Kessler cloud microphysics scheme\", <i>Computers & Geosciences</i>, vol. 52, pp. 292, 2013.","links":{"crossRefLink":"https://doi.org/10.1016/j.cageo.2012.10.006"},"title":"Compute unified device architecture (CUDA)-based parallelization of WRF Kessler cloud microphysics scheme"},{"order":"5","displayText":"Liuyang Fang, Mi Wang, Deren Li, Jun Pan, \"CPU/GPU near real-time preprocessing for ZY-3 satellite images: Relative radiometric correction MTF compensation and geocorrection\", <i>ISPRS Journal of Photogrammetry and Remote Sensing</i>, vol. 87, pp. 229, 2014.","links":{"crossRefLink":"https://doi.org/10.1016/j.isprsjprs.2013.11.010"},"title":"CPU/GPU near real-time preprocessing for ZY-3 satellite images: Relative radiometric correction, MTF compensation, and geocorrection"},{"order":"6","displayText":"Thomas Hobiger, Seiichi Shimada, Shingo Shimizu, Ryuichi Ichikawa, Yasuhiro Koyama, Tetsuro Kondo, \"Improving GPS positioning estimates during extreme weather situations by the help of fine-mesh numerical weather models\", <i>Journal of Atmospheric and Solar-Terrestrial Physics</i>, vol. 72, pp. 262, 2010.","links":{"crossRefLink":"https://doi.org/10.1016/j.jastp.2009.11.018"},"title":"Improving GPS positioning estimates during extreme weather situations by the help of fine-mesh numerical weather models"},{"order":"7","displayText":"Jarno Mielikainen, \"Accelerating the RTTOV-7 IASI and AMSU-A radiative transfer models on graphics processing units: evaluating central processing unit/graphics processing unit-hybrid and pure-graphics processing unit approaches\", <i>Journal of Applied Remote Sensing</i>, vol. 5, pp. 051503, 2011.","links":{"crossRefLink":"https://doi.org/10.1117/1.3658028"},"title":"Accelerating the RTTOV-7 IASI and AMSU-A radiative transfer models on graphics processing units: evaluating central processing unit/graphics processing unit-hybrid and pure-graphics processing unit approaches"},{"order":"8","displayText":"Bormin Huang, Chein-I Chang, Chulhee Lee, Yunsong Li, Qian Du, Melin Huang, Bormin Huang, Allen H.-L. Huang, <i>Satellite Data Compression, Communications, and Processing XI</i>, vol. 9501, pp. 95010K, 2015.","links":{"crossRefLink":"https://doi.org/10.1117/12.2180039"},"title":""}]},"formulaStrippedArticleTitle":"Computation of Troposphere Slant Delays on a GPU","nonIeeeCitationCount":"8","contentTypeDisplay":"Journals","patentCitationCount":"0","mlTime":"PT0.318157S","lastupdate":"2021-11-07","title":"Computation of Troposphere Slant Delays on a GPU","contentType":"periodicals","ieeeCitationCount":"10","publicationNumber":"36"},{"_id":5129278,"paperCitations":{"ieee":[{"order":"1","displayText":"Yuntao Qian, Yanhao Shen, Minchao Ye, Qi Wang, \"3-D nonlocal means filter with noise estimation for hyperspectral imagery denoising\", <i>Geoscience and Remote Sensing Symposium (IGARSS) 2012 IEEE International</i>, pp. 1345-1348, 2012.","links":{"documentLink":"/document/6351287","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6351287","pdfSize":"232KB"},"title":"3-D nonlocal means filter with noise estimation for hyperspectral imagery denoising"},{"order":"2","displayText":"Yuntao Qian, Minchao Ye, \"Hyperspectral Imagery Restoration Using Nonlocal Spectral-Spatial Structured Sparse Representation With Noise Estimation\", <i>Selected Topics in Applied Earth Observations and Remote Sensing IEEE Journal of</i>, vol. 6, no. 2, pp. 499-515, 2013.","links":{"documentLink":"/document/6392911","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6392911","pdfSize":"10963KB"},"title":"Hyperspectral Imagery Restoration Using Nonlocal Spectral-Spatial Structured Sparse Representation With Noise Estimation"},{"order":"3","displayText":"Linlin Xu, Fan Li, Alexander Wong, David A. Clausi, \"Hyperspectral Image Denoising Using a Spatial–Spectral Monte Carlo Sampling Approach\", <i>Selected Topics in Applied Earth Observations and Remote Sensing IEEE Journal of</i>, vol. 8, no. 6, pp. 3025-3038, 2015.","links":{"documentLink":"/document/7063939","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7063939","pdfSize":"5163KB"},"title":"Hyperspectral Image Denoising Using a Spatial–Spectral Monte Carlo Sampling Approach"},{"order":"4","displayText":"Mikhail L. Uss, Benoît Vozel, Vladimir V. Lukin, Kacem Chehdi, \"Local Signal-Dependent Noise Variance Estimation From Hyperspectral Textural Images\", <i>Selected Topics in Signal Processing IEEE Journal of</i>, vol. 5, no. 3, pp. 469-486, 2011.","links":{"documentLink":"/document/5716656","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=5716656","pdfSize":"2877KB"},"title":"Local Signal-Dependent Noise Variance Estimation From Hyperspectral Textural Images"},{"order":"5","displayText":"Begüm Demir, Sarp Ertürk, \"Empirical Mode Decomposition of Hyperspectral Images for Support Vector Machine Classification\", <i>Geoscience and Remote Sensing IEEE Transactions on</i>, vol. 48, no. 11, pp. 4071-4084, 2010.","links":{"documentLink":"/document/5593878","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=5593878","pdfSize":"760KB"},"title":"Empirical Mode Decomposition of Hyperspectral Images for Support Vector Machine Classification"},{"order":"6","displayText":"Yuntao Qian, Minchao Ye, Jun Zhou, \"Hyperspectral Image Classification Based on Structured Sparse Logistic Regression and Three-Dimensional Wavelet Texture Features\", <i>Geoscience and Remote Sensing IEEE Transactions on</i>, vol. 51, no. 4, pp. 2276-2291, 2013.","links":{"documentLink":"/document/6307840","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6307840","pdfSize":"2176KB"},"title":"Hyperspectral Image Classification Based on Structured Sparse Logistic Regression and Three-Dimensional Wavelet Texture Features"},{"order":"7","displayText":"Zhi He, Qiang Wang, Yi Shen, Mingjian Sun, \"Kernel Sparse Multitask Learning for Hyperspectral Image Classification With Empirical Mode Decomposition and Morphological Wavelet-Based Features\", <i>Geoscience and Remote Sensing IEEE Transactions on</i>, vol. 52, no. 8, pp. 5150-5163, 2014.","links":{"documentLink":"/document/6656851","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6656851","pdfSize":"2436KB"},"title":"Kernel Sparse Multitask Learning for Hyperspectral Image Classification With Empirical Mode Decomposition and Morphological Wavelet-Based Features"},{"order":"8","displayText":"Yicong Zhou, Jiangtao Peng, C. L. Philip Chen, \"Dimension Reduction Using Spatial and Spectral Regularized Local Discriminant Embedding for Hyperspectral Image Classification\", <i>Geoscience and Remote Sensing IEEE Transactions on</i>, vol. 53, no. 2, pp. 1082-1095, 2015.","links":{"documentLink":"/document/6856200","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6856200","pdfSize":"3266KB"},"title":"Dimension Reduction Using Spatial and Spectral Regularized Local Discriminant Embedding for Hyperspectral Image Classification"},{"order":"9","displayText":"Jaime Zabalza, Jinchang Ren, Jiangbin Zheng, Junwei Han, Huimin Zhao, Shutao Li, Stephen Marshall, \"Novel Two-Dimensional Singular Spectrum Analysis for Effective Feature Extraction and Data Classification in Hyperspectral Imaging\", <i>Geoscience and Remote Sensing IEEE Transactions on</i>, vol. 53, no. 8, pp. 4418-4433, 2015.","links":{"documentLink":"/document/7046411","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7046411","pdfSize":"2094KB"},"title":"Novel Two-Dimensional Singular Spectrum Analysis for Effective Feature Extraction and Data Classification in Hyperspectral Imaging"},{"order":"10","displayText":"Lin He, Jun Li, Chenying Liu, Shutao Li, \"Recent Advances on Spectral–Spatial Hyperspectral Image Classification: An Overview and New Guidelines\", <i>Geoscience and Remote Sensing IEEE Transactions on</i>, vol. 56, no. 3, pp. 1579-1597, 2018.","links":{"documentLink":"/document/8101519","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8101519","pdfSize":"3580KB"},"title":"Recent Advances on Spectral–Spatial Hyperspectral Image Classification: An Overview and New Guidelines"},{"order":"11","displayText":"Shan Zeng, Zhiyong Wang, Chongjun Gao, Zhen Kang, Dagan Feng, \"Hyperspectral Image Classification With Global–Local Discriminant Analysis and Spatial–Spectral Context\", <i>Selected Topics in Applied Earth Observations and Remote Sensing IEEE Journal of</i>, vol. 11, no. 12, pp. 5005-5018, 2018.","links":{"documentLink":"/document/8526288","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8526288","pdfSize":"8078KB"},"title":"Hyperspectral Image Classification With Global–Local Discriminant Analysis and Spatial–Spectral Context"},{"order":"12","displayText":"Hugh L. Kennedy, \"Whitening Pre-Filters with Circular Symmetry for Anomaly Detection in Hyperspectral Imagery\", <i>Digital Image Computing: Techniques and Applications (DICTA) 2018</i>, pp. 1-8, 2018.","links":{"documentLink":"/document/8615818","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8615818","pdfSize":"978KB"},"title":"Whitening Pre-Filters with Circular Symmetry for Anomaly Detection in Hyperspectral Imagery"},{"order":"13","displayText":"Wei Zhang, Peijun Du, Cong Lin, Pingjie Fu, Xin Wang, Xuyu Bai, Hongrui Zheng, Junshi Xia, Alim Samat, \"An Improved Feature Set for Hyperspectral Image Classification: Harmonic Analysis Optimized by Multiscale Guided Filter\", <i>Selected Topics in Applied Earth Observations and Remote Sensing IEEE Journal of</i>, vol. 13, pp. 3903-3916, 2020.","links":{"documentLink":"/document/9133320","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=9133320","pdfSize":"10699KB"},"title":"An Improved Feature Set for Hyperspectral Image Classification: Harmonic Analysis Optimized by Multiscale Guided Filter"},{"order":"14","displayText":"Hongmin Gao, Yawen Miao, Xueying Cao, Chenming Li, \"Densely Connected Multiscale Attention Network for Hyperspectral Image Classification\", <i>Selected Topics in Applied Earth Observations and Remote Sensing IEEE Journal of</i>, vol. 14, pp. 2563-2576, 2021.","links":{"documentLink":"/document/9345335","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=9345335","pdfSize":"7848KB"},"title":"Densely Connected Multiscale Attention Network for Hyperspectral Image Classification"}],"nonIeee":[{"order":"1","displayText":"V.L. Mulder, S. de Bruin, M.E. Schaepman, T.R. Mayr, \"The use of remote sensing in soil and terrain mapping — A review\", <i>Geoderma</i>, vol. 162, pp. 1, 2011.","links":{"crossRefLink":"https://doi.org/10.1016/j.geoderma.2010.12.018"},"title":"The use of remote sensing in soil and terrain mapping — A review"},{"order":"2","displayText":"Jaime Zabalza, Chunmei Qing, Jinchang Ren, Genyun Sun, Huimin Zhao, Peter Yuen, \"Fast Implementation of Two-Dimensional Singular Spectrum Analysis for Effective Data Classification in Hyperspectral Imaging\", <i>Journal of the Franklin Institute</i>, 2017.","links":{"crossRefLink":"https://doi.org/10.1016/j.jfranklin.2017.05.020"},"title":"Fast Implementation of Two-Dimensional Singular Spectrum Analysis for Effective Data Classification in Hyperspectral Imaging"},{"order":"3","displayText":"Xiangyong Cao, Lin Xu, Deyu Meng, Qian Zhao, Zongben Xu, \"Integration of 3-dimensional discrete wavelet transform and Markov random field for hyperspectral image classification\", <i>Neurocomputing</i>, vol. 226, pp. 90, 2017.","links":{"crossRefLink":"https://doi.org/10.1016/j.neucom.2016.11.034"},"title":"Integration of 3-dimensional discrete wavelet transform and Markov random field for hyperspectral image classification"},{"order":"4","displayText":"Asim Banskota, Randolph H. Wynne, Nilam Kayastha, \"Improving within-genus tree species discrimination using the discrete wavelet transform applied to airborne hyperspectral data\", <i>International Journal of Remote Sensing</i>, vol. 32, pp. 3551, 2011.","links":{"crossRefLink":"https://doi.org/10.1080/01431161003698302"},"title":"Improving within-genus tree species discrimination using the discrete wavelet transform applied to airborne hyperspectral data"},{"order":"5","displayText":"Sandra Lorenz, Sara Salehi, Moritz Kirsch, Robert Zimmermann, Gabriel Unger, Erik Vest Sørensen, Richard Gloaguen, \"Radiometric Correction and 3D Integration of Long-Range Ground-Based Hyperspectral Imagery for Mineral Exploration of Vertical Outcrops\", <i>Remote Sensing</i>, vol. 10, pp. 176, 2018.","links":{"crossRefLink":"https://doi.org/10.3390/rs10020176"},"title":"Radiometric Correction and 3D Integration of Long-Range Ground-Based Hyperspectral Imagery for Mineral Exploration of Vertical Outcrops"},{"order":"6","displayText":"Razika Bazine, Huayi Wu, Kamel Boukhechba, \"Spatial Filtering in DCT Domain-Based Frameworks for Hyperspectral Imagery Classification\", <i>Remote Sensing</i>, vol. 11, pp. 1405, 2019.","links":{"crossRefLink":"https://doi.org/10.3390/rs11121405"},"title":"Spatial Filtering in DCT Domain-Based Frameworks for Hyperspectral Imagery Classification"},{"order":"7","displayText":"Ping Xu, Bingqiang Chen, Jingcheng Zhang, Lingyun Xue, Lei Zhu, \"A new HSI denoising method via interpolated block matching 3D and guided filter\", <i>PeerJ</i>, vol. 9, pp. e11642, 2021.","links":{"crossRefLink":"https://doi.org/10.7717/peerj.11642"},"title":"A new HSI denoising method via interpolated block matching 3D and guided filter"}]},"formulaStrippedArticleTitle":"An Adaptive Noise-Filtering Algorithm for AVIRIS Data With Implications for Classification Accuracy","nonIeeeCitationCount":"7","contentTypeDisplay":"Journals","patentCitationCount":"1","mlTime":"PT2.323301S","lastupdate":"2021-11-07","title":"An Adaptive Noise-Filtering Algorithm for AVIRIS Data With Implications for Classification Accuracy","contentType":"periodicals","ieeeCitationCount":"14","publicationNumber":"36"},{"_id":5129279,"paperCitations":{"ieee":[{"order":"1","displayText":"Du Yang, Chao Xu, Lie-Liang Yang, Lajos Hanzo, \"Transmit-Diversity-Assisted Space-Shift Keying for Colocated and Distributed/Cooperative MIMO Elements\", <i>Vehicular Technology IEEE Transactions on</i>, vol. 60, no. 6, pp. 2864-2869, 2011.","links":{"documentLink":"/document/5875908","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=5875908","pdfSize":"439KB"},"title":"Transmit-Diversity-Assisted Space-Shift Keying for Colocated and Distributed/Cooperative MIMO Elements"}]},"formulaStrippedArticleTitle":"A New Iterative Joint Detection and Decoding Algorithm for V-BLAST Architecture","nonIeeeCitationCount":"0","contentTypeDisplay":"Journals","patentCitationCount":"0","mlTime":"PT0.037926S","lastupdate":"2021-10-15","title":"A New Iterative Joint Detection and Decoding Algorithm for V-BLAST Architecture","contentType":"periodicals","ieeeCitationCount":"1","publicationNumber":"97"},{"_id":5129395,"formulaStrippedArticleTitle":"First-Principles Calculations of Elastic Properties of Cu-Sn and Cu-Sn- Intermetallics","nonIeeeCitationCount":"0","contentTypeDisplay":"Journals","patentCitationCount":"0","mlTime":"PT0.009494S","lastupdate":"2021-10-02","title":"First-Principles Calculations of Elastic Properties of Cu<formula formulatype=\"inline\"><tex Notation=\"TeX\">$_{3}$</tex></formula>Sn and Cu<formula formulatype=\"inline\"><tex Notation=\"TeX\">$_{6}$</tex></formula>Sn<formula formulatype=\"inline\"><tex Notation=\"TeX\">$_{5}$</tex></formula> Intermetallics","contentType":"periodicals","ieeeCitationCount":"0","publicationNumber":"6040"},{"_id":5129607,"paperCitations":{"ieee":[{"order":"1","displayText":"Junichi Takaku, Takeo Tadono, \"High resolution dsm generation from alos prism - processing status and influence of attitude fluctuation -\", <i>Geoscience and Remote Sensing Symposium (IGARSS) 2010 IEEE International</i>, pp. 4228-4231, 2010.","links":{"documentLink":"/document/5653527","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=5653527","pdfSize":"1939KB"},"title":"High resolution dsm generation from alos prism - processing status and influence of attitude fluctuation -"},{"order":"2","displayText":"Junichi Takaku, Takeo Tadono, \"RPC generations on ALOS PRISM and AVNIR-2\", <i>Geoscience and Remote Sensing Symposium (IGARSS) 2011 IEEE International</i>, pp. 539-542, 2011.","links":{"documentLink":"/document/6049184","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6049184","pdfSize":"776KB"},"title":"RPC generations on ALOS PRISM and AVNIR-2"},{"order":"3","displayText":"David McAlpin, Franz Meyer, Peter Webley, \"A new multi-sensor approach to measurement of topographic changes resulting from active volcanism\", <i>Geoscience and Remote Sensing Symposium (IGARSS) 2011 IEEE International</i>, pp. 586-589, 2011.","links":{"documentLink":"/document/6049196","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6049196","pdfSize":"872KB"},"title":"A new multi-sensor approach to measurement of topographic changes resulting from active volcanism"},{"order":"4","displayText":"Takeo Tadono, Masanobu Shimada, Tsutomu Yamanokuchi, Jinro Ukita, Chiyuki Narama, Nobuhiro Tomiyama, Sachi Kawamoto, Koji Fujita, Kouichi Nishimura, \"Development of glacial lake inventory in Bhutan using “Daichi” (ALOS)\", <i>Geoscience and Remote Sensing Symposium (IGARSS) 2011 IEEE International</i>, pp. 3202-3205, 2011.","links":{"documentLink":"/document/6049900","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6049900","pdfSize":"4185KB"},"title":"Development of glacial lake inventory in Bhutan using “Daichi” (ALOS)"},{"order":"5","displayText":"Junichi Takaku, Takeo Tadono, \"High resolution DSM generation from ALOS PRISM - Archiving and mosaicking\", <i>Geoscience and Remote Sensing Symposium (IGARSS) 2011 IEEE International</i>, pp. 4336-4339, 2011.","links":{"documentLink":"/document/6050191","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6050191","pdfSize":"1407KB"},"title":"High resolution DSM generation from ALOS PRISM - Archiving and mosaicking"},{"order":"6","displayText":"Junichi Takaku, Takeo Tadono, \"High resolution DSM generation from ALOS PRISM - mosaic dataset -\", <i>Geoscience and Remote Sensing Symposium (IGARSS) 2012 IEEE International</i>, pp. 2687-2690, 2012.","links":{"documentLink":"/document/6350375","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6350375","pdfSize":"617KB"},"title":"High resolution DSM generation from ALOS PRISM - mosaic dataset -"},{"order":"7","displayText":"Takeo Tadono, Mark L. Williams, Scott Hensley, \"Comparison of stereo-optical and dual-band InSAR DEMs in Papua New Guinea\", <i>Geoscience and Remote Sensing Symposium (IGARSS) 2012 IEEE International</i>, pp. 3158-3161, 2012.","links":{"documentLink":"/document/6350755","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6350755","pdfSize":"1742KB"},"title":"Comparison of stereo-optical and dual-band InSAR DEMs in Papua New Guinea"},{"order":"8","displayText":"Wenjian Ni, Zhifeng Guo, Zhiyu Zhang, Guoqing Sun, Wenli Huang, \"Semi-automatic extraction of digital surface model using ALOS/PRISM data with ENVI\", <i>Geoscience and Remote Sensing Symposium (IGARSS) 2012 IEEE International</i>, pp. 6557-6560, 2012.","links":{"documentLink":"/document/6352097","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6352097","pdfSize":"1477KB"},"title":"Semi-automatic extraction of digital surface model using ALOS/PRISM data with ENVI"},{"order":"9","displayText":"Takeo Tadono, Masanobu Shimada, Junichi Takaku, Hiroshi Murakami, \"Update calibration results of prism and AVNIR-2 onboard ALOS ‘Daichi’\", <i>Geoscience and Remote Sensing Symposium (IGARSS) 2012 IEEE International</i>, pp. 5029-5032, 2012.","links":{"documentLink":"/document/6352481","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6352481","pdfSize":"435KB"},"title":"Update calibration results of prism and AVNIR-2 onboard ALOS ‘Daichi’"},{"order":"10","displayText":"Masuo Takahashi, Masanobu Shimada, Takeo Tadono, Manabu Watanabe, \"Calculation of trees height using PRISM-DSM\", <i>Geoscience and Remote Sensing Symposium (IGARSS) 2012 IEEE International</i>, pp. 6495-6498, 2012.","links":{"documentLink":"/document/6352748","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6352748","pdfSize":"350KB"},"title":"Calculation of trees height using PRISM-DSM"},{"order":"11","displayText":"Takeshi Motohka, Toshiya Yoshida, Hideaki Shibata, Takeo Tadono, Masanobu Shimada, \"Mapping forest biomass using ALOS digital surface model and pan-sharpen image\", <i>Geoscience and Remote Sensing Symposium (IGARSS) 2013 IEEE International</i>, pp. 968-971, 2013.","links":{"documentLink":"/document/6721323","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6721323","pdfSize":"522KB"},"title":"Mapping forest biomass using ALOS digital surface model and pan-sharpen image"},{"order":"12","displayText":"Junichi Takaku, Takeo Tadono, \"Automatic DSM generation from ALOS PRISM\", <i>Geoscience and Remote Sensing Symposium (IGARSS) 2013 IEEE International</i>, pp. 2392-2395, 2013.","links":{"documentLink":"/document/6723301","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6723301","pdfSize":"1857KB"},"title":"Automatic DSM generation from ALOS PRISM"},{"order":"13","displayText":"Takeo Tadono, Hiroko Imai, Fumi Ohgushi, Junichi Takaku, Tomohiro Watanabe, \"Feasibility study of PRISM-2 onboard ALOS-3 - Simulated image generation\", <i>Geoscience and Remote Sensing Symposium (IGARSS) 2013 IEEE International</i>, pp. 4439-4442, 2013.","links":{"documentLink":"/document/6723820","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6723820","pdfSize":"1544KB"},"title":"Feasibility study of PRISM-2 onboard ALOS-3 - Simulated image generation"},{"order":"14","displayText":"Junichi Takaku, Takeo Tadono, Ken Tsutsui, \"Algorithm development of high resolution global DSM generation by ALOS prism\", <i>Geoscience and Remote Sensing Symposium (IGARSS) 2014 IEEE International</i>, pp. 4784-4787, 2014.","links":{"documentLink":"/document/6947564","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6947564","pdfSize":"1145KB"},"title":"Algorithm development of high resolution global DSM generation by ALOS prism"},{"order":"15","displayText":"Tao Sun, Li Huang, Hui Long, Bao-Cheng Liu, \"A new method for attitude refinement of earth observation satellite with asynchronous images\", <i>Geoscience and Remote Sensing Symposium (IGARSS) 2016 IEEE International</i>, pp. 1221-1224, 2016.","links":{"documentLink":"/document/7729309","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7729309","pdfSize":"653KB"},"title":"A new method for attitude refinement of earth observation satellite with asynchronous images"},{"order":"16","displayText":"Junichi Takaku, Akira Iwasaki, Takeo Tadono, \"Adaptive filter for improving quality of ALOS PRISM DSM\", <i>Geoscience and Remote Sensing Symposium (IGARSS) 2016 IEEE International</i>, pp. 5370-5373, 2016.","links":{"documentLink":"/document/7730399","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7730399","pdfSize":"920KB"},"title":"Adaptive filter for improving quality of ALOS PRISM DSM"},{"order":"17","displayText":"Junichi Takaku, Takeo Tadono, \"Quality updates of ‘AW3D’ global DSM generated from ALOS PRISM\", <i>Geoscience and Remote Sensing Symposium (IGARSS) 2017 IEEE International</i>, pp. 5666-5669, 2017.","links":{"documentLink":"/document/8128293","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8128293","pdfSize":"1086KB"},"title":"Quality updates of ‘AW3D’ global DSM generated from ALOS PRISM"},{"order":"18","displayText":"Bo Jia, Ting Jiang, Gang-wu Jiang, Yao-yao Yu, Guo Li, \"Method of DEM Generation Based on Three-Line Array CCD Lunar Images\", <i>Image and Data Fusion (ISIDF) 2011 International Symposium on</i>, pp. 1-5, 2011.","links":{"documentLink":"/document/6024239","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6024239","pdfSize":"723KB"},"title":"Method of DEM Generation Based on Three-Line Array CCD Lunar Images"},{"order":"19","displayText":"Lijun Xu, Teng Xu, Jianjun Wang, Xiaolu Li, \"A Fuzzy PID Controller-Based Two-Axis Compensation Device for Airborne Laser Scanning\", <i>Sensors Journal IEEE</i>, vol. 17, no. 5, pp. 1353-1362, 2017.","links":{"documentLink":"/document/7802602","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7802602","pdfSize":"2896KB"},"title":"A Fuzzy PID Controller-Based Two-Axis Compensation Device for Airborne Laser Scanning"},{"order":"20","displayText":"Zisis I. Petrou, Ioannis Manakos, Tania Stathaki, Caspar A. Mücher, Maria Adamo, \"Discrimination of Vegetation Height Categories With Passive Satellite Sensor Imagery Using Texture Analysis\", <i>Selected Topics in Applied Earth Observations and Remote Sensing IEEE Journal of</i>, vol. 8, no. 4, pp. 1442-1455, 2015.","links":{"documentLink":"/document/7061969","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7061969","pdfSize":"1298KB"},"title":"Discrimination of Vegetation Height Categories With Passive Satellite Sensor Imagery Using Texture Analysis"},{"order":"21","displayText":"Yuanzhen Ren, Huadong Guo, Guang Liu, Hanlin Ye, \"Simulation Study of Geometric Characteristics and Coverage for Moon-Based Earth Observation in the Electro-Optical Region\", <i>Selected Topics in Applied Earth Observations and Remote Sensing IEEE Journal of</i>, vol. 10, no. 6, pp. 2431-2440, 2017.","links":{"documentLink":"/document/7946282","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7946282","pdfSize":"1014KB"},"title":"Simulation Study of Geometric Characteristics and Coverage for Moon-Based Earth Observation in the Electro-Optical Region"},{"order":"22","displayText":"Yongjun Zhang, Maoteng Zheng, Xiaodong Xiong, Jinxin Xiong, \"Multistrip Bundle Block Adjustment of ZY-3 Satellite Imagery by Rigorous Sensor Model Without Ground Control Point\", <i>Geoscience and Remote Sensing Letters IEEE</i>, vol. 12, no. 4, pp. 865-869, 2015.","links":{"documentLink":"/document/6951418","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6951418","pdfSize":"283KB"},"title":"Multistrip Bundle Block Adjustment of ZY-3 Satellite Imagery by Rigorous Sensor Model Without Ground Control Point"},{"order":"23","displayText":"Ying-Dong Pi, Bo Yang, Mi Wang, Xin Li, Yu-Feng Cheng, Wen-Li Tang, \"On-Orbit Geometric Calibration Using a Cross-Image Pair for the Linear Sensor Aboard the Agile Optical Satellite\", <i>Geoscience and Remote Sensing Letters IEEE</i>, vol. 14, no. 7, pp. 1176-1180, 2017.","links":{"documentLink":"/document/7934372","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7934372","pdfSize":"1105KB"},"title":"On-Orbit Geometric Calibration Using a Cross-Image Pair for the Linear Sensor Aboard the Agile Optical Satellite"},{"order":"24","displayText":"Jun Chen, Jun-Gang Yang, Wei An, Zhi-Jie Chen, \"An Attitude Jitter Correction Method for Multispectral Parallax Imagery Based on Compressive Sensing\", <i>Geoscience and Remote Sensing Letters IEEE</i>, vol. 14, no. 11, pp. 1903-1907, 2017.","links":{"documentLink":"/document/8057985","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8057985","pdfSize":"1437KB"},"title":"An Attitude Jitter Correction Method for Multispectral Parallax Imagery Based on Compressive Sensing"},{"order":"25","displayText":"Tee-Ann Teo, Chaoyi Yu, \"Three-dimensional positioning using ALOS/Prism triple linear-array satellite images\", <i>Signal and Image Processing (ICSIP) 2017 IEEE 2nd International Conference on</i>, pp. 232-236, 2017.","links":{"documentLink":"/document/8124539","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8124539","pdfSize":"472KB"},"title":"Three-dimensional positioning using ALOS/Prism triple linear-array satellite images"},{"order":"26","displayText":"Takeo Tadono, Masanobu Shimada, Hiroshi Murakami, Junichi Takaku, \"Calibration of PRISM and AVNIR-2 Onboard ALOS “Daichi”\", <i>Geoscience and Remote Sensing IEEE Transactions on</i>, vol. 47, no. 12, pp. 4042-4050, 2009.","links":{"documentLink":"/document/5208235","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=5208235","pdfSize":"1163KB"},"title":"Calibration of PRISM and AVNIR-2 Onboard ALOS “Daichi”"},{"order":"27","displayText":"Gareth Llewellyn Keith Morgan, Jian Guo Liu, Hongshi Yan, \"Precise Subpixel Disparity Measurement From Very Narrow Baseline Stereo\", <i>Geoscience and Remote Sensing IEEE Transactions on</i>, vol. 48, no. 9, pp. 3424-3433, 2010.","links":{"documentLink":"/document/5466239","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=5466239","pdfSize":"1751KB"},"title":"Precise Subpixel Disparity Measurement From Very Narrow Baseline Stereo"},{"order":"28","displayText":"Steven J. Mills, Marcos P. Gerardo Castro, Zhengrong Li, Jinhai Cai, Ross Hayward, Luis Mejias, Rodney A. Walker, \"Evaluation of Aerial Remote Sensing Techniques for Vegetation Management in Power-Line Corridors\", <i>Geoscience and Remote Sensing IEEE Transactions on</i>, vol. 48, no. 9, pp. 3379-3390, 2010.","links":{"documentLink":"/document/5466249","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=5466249","pdfSize":"1216KB"},"title":"Evaluation of Aerial Remote Sensing Techniques for Vegetation Management in Power-Line Corridors"},{"order":"29","displayText":"Masaru Koga, Akira Iwasaki, \"Improving the Measurement Accuracy of Three-Dimensional Topography Changes Using Optical Satellite Stereo Image Data\", <i>Geoscience and Remote Sensing IEEE Transactions on</i>, vol. 49, no. 8, pp. 2918-2923, 2011.","links":{"documentLink":"/document/5752843","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=5752843","pdfSize":"623KB"},"title":"Improving the Measurement Accuracy of Three-Dimensional Topography Changes Using Optical Satellite Stereo Image Data"},{"order":"30","displayText":"Yongjun Zhang, Maoteng Zheng, Jinxin Xiong, Yihui Lu, Xiaodong Xiong, \"On-Orbit Geometric Calibration of ZY-3 Three-Line Array Imagery With Multistrip Data Sets\", <i>Geoscience and Remote Sensing IEEE Transactions on</i>, vol. 52, no. 1, pp. 224-234, 2014.","links":{"documentLink":"/document/6451250","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6451250","pdfSize":"1253KB"},"title":"On-Orbit Geometric Calibration of ZY-3 Three-Line Array Imagery With Multistrip Data Sets"}],"nonIeee":[{"order":"1","displayText":"David McAlpin, Franz J. Meyer, \"Multi-sensor data fusion for remote sensing of post-eruptive deformation and depositional features at Redoubt Volcano\", <i>Journal of Volcanology and Geothermal Research</i>, vol. 259, pp. 414, 2013.","links":{"crossRefLink":"https://doi.org/10.1016/j.jvolgeores.2012.08.006"},"title":"Multi-sensor data fusion for remote sensing of post-eruptive deformation and depositional features at Redoubt Volcano"},{"order":"2","displayText":"Sunal Ojha, Koji Fujita, Akiko Sakai, Hiroto Nagai, Damodar Lamsal, \"Topographic controls on the debris-cover extent of glaciers in the Eastern Himalayas: Regional analysis using a novel high-resolution glacier inventory\", <i>Quaternary International</i>, 2017.","links":{"crossRefLink":"https://doi.org/10.1016/j.quaint.2017.08.007"},"title":"Topographic controls on the debris-cover extent of glaciers in the Eastern Himalayas: Regional analysis using a novel high-resolution glacier inventory"},{"order":"3","displayText":"Hepi H. Handayani, Ronald C. Estoque, Yuji Murayama, \"Estimation of built-up and green volume using geospatial techniques: A case study of Surabaya Indonesia\", <i>Sustainable Cities and Society</i>, vol. 37, pp. 581, 2018.","links":{"crossRefLink":"https://doi.org/10.1016/j.scs.2017.10.017"},"title":"Estimation of built-up and green volume using geospatial techniques: A case study of Surabaya, Indonesia"},{"order":"4","displayText":"Atsuko Nonomura, Yuki Uehara, Takuro Masuda, Takeo Tadono, \"Impact of mid-high rise buildings on summer air temperatures in the coastal city of Takamatsu in southwestern Japan\", <i>Urban Climate</i>, vol. 9, pp. 75, 2014.","links":{"crossRefLink":"https://doi.org/10.1016/j.uclim.2014.07.003"},"title":"Impact of mid-high rise buildings on summer air temperatures in the coastal city of Takamatsu in southwestern Japan"},{"order":"5","displayText":"Guo Zhang, Kai Xu, Wenchao Huang, \"Auto-calibration of GF-1 WFV images using flat terrain\", <i>ISPRS Journal of Photogrammetry and Remote Sensing</i>, vol. 134, pp. 59, 2017.","links":{"crossRefLink":"https://doi.org/10.1016/j.isprsjprs.2017.10.009"},"title":"Auto-calibration of GF-1 WFV images using flat terrain"},{"order":"6","displayText":"Yi Wan, Yongjun Zhang, \"The P2L method of mismatch detection for push broom high-resolution satellite images\", <i>ISPRS Journal of Photogrammetry and Remote Sensing</i>, vol. 130, pp. 317, 2017.","links":{"crossRefLink":"https://doi.org/10.1016/j.isprsjprs.2017.06.009"},"title":"The P2L method of mismatch detection for push broom high-resolution satellite images"},{"order":"7","displayText":"Mi Wang, Yufeng Cheng, Xueli Chang, Shuying Jin, Ying Zhu, \"On-orbit geometric calibration and geometric quality assessment for the high-resolution geostationary optical satellite GaoFen4\", <i>ISPRS Journal of Photogrammetry and Remote Sensing</i>, vol. 125, pp. 63, 2017.","links":{"crossRefLink":"https://doi.org/10.1016/j.isprsjprs.2017.01.004"},"title":"On-orbit geometric calibration and geometric quality assessment for the high-resolution geostationary optical satellite GaoFen4"},{"order":"8","displayText":"Chiyuki Narama, Mirlan Daiyrov, Takeo Tadono, Minako Yamamoto, Andreas Kääb, Reira Morita, Ukita Jinro, \"Seasonal drainage of supraglacial lakes on debris-covered glaciers in the Tien Shan Mountains Central Asia\", <i>Geomorphology</i>, 2017.","links":{"crossRefLink":"https://doi.org/10.1016/j.geomorph.2017.03.002"},"title":"Seasonal drainage of supraglacial lakes on debris-covered glaciers in the Tien Shan Mountains, Central Asia"},{"order":"9","displayText":"Daniel Falaschi, Mariano Castro, Mariano Masiokas, Takeo Tadono, Ana Lía Ahumada, \"Rock Glacier Inventory of the Valles Calchaquíes Region (~ 25°S) Salta Argentina Derived from ALOS Data\", <i>Permafrost and Periglacial Processes</i>, vol. 25, pp. 69, 2014.","links":{"crossRefLink":"https://doi.org/10.1002/ppp.1801"},"title":"Rock Glacier Inventory of the Valles Calchaquíes Region (~ 25°S), Salta, Argentina, Derived from ALOS Data"},{"order":"10","displayText":"Kai Xu, Yonghua Jiang, Guo Zhang, Qingjun Zhang, Xia Wang, \"Geometric Potential Assessment for ZY3-02 Triple Linear Array Imagery\", <i>Remote Sensing</i>, vol. 9, pp. 658, 2017.","links":{"crossRefLink":"https://doi.org/10.3390/rs9070658"},"title":"Geometric Potential Assessment for ZY3-02 Triple Linear Array Imagery"},{"order":"11","displayText":"Seungwoo Lee, Dongseok Shin, \"On-Orbit Camera Misalignment Estimation Framework and Its Application to Earth Observation Satellite\", <i>Remote Sensing</i>, vol. 7, pp. 3320, 2015.","links":{"crossRefLink":"https://doi.org/10.3390/rs70303320"},"title":"On-Orbit Camera Misalignment Estimation Framework and Its Application to Earth Observation Satellite"},{"order":"12","displayText":"Mi Wang, Bo Yang, Fen Hu, Xi Zang, \"On-Orbit Geometric Calibration Model and Its Applications for High-Resolution Optical Satellite Imagery\", <i>Remote Sensing</i>, vol. 6, pp. 4391, 2014.","links":{"crossRefLink":"https://doi.org/10.3390/rs6054391"},"title":"On-Orbit Geometric Calibration Model and Its Applications for High-Resolution Optical Satellite Imagery"},{"order":"13","displayText":"Daniel Falaschi, Takeo Tadono, Mariano Masiokas, \"ROCK GLACIERS IN THE PATAGONIAN ANDES: AN INVENTORY FOR THE MONTE SAN LORENZO (CERRO COCHRANE) MASSIF 47° S\", <i>Geografiska Annaler: Series A, Physical Geography</i>, pp. n/a, 2015.","links":{"crossRefLink":"https://doi.org/10.1111/geoa.12113"},"title":"ROCK GLACIERS IN THE PATAGONIAN ANDES: AN INVENTORY FOR THE MONTE SAN LORENZO (CERRO COCHRANE) MASSIF, 47° S"},{"order":"14","displayText":"Guo Zhang, Yonghua Jiang, Deren Li, Wenchao Huang, Hongbo Pan, Xinming Tang, Xiaoyong Zhu, \"In-Orbit Geometric Calibration And Validation Of Zy-3 Linear Array Sensors\", <i>The Photogrammetric Record</i>, vol. 29, pp. 68, 2014.","links":{"crossRefLink":"https://doi.org/10.1111/phor.12052"},"title":"In-Orbit Geometric Calibration And Validation Of Zy-3 Linear Array Sensors"},{"order":"15","displayText":"Dean Gesch, <i>Advances in Mapping from Remote Sensor Imagery</i>, pp. 91, 2012.","links":{"crossRefLink":"https://doi.org/10.1201/b13770-5"},"title":""},{"order":"16","displayText":"Masashi Matsuoka, Hiroyuki Miura, Saburoh Midorikawa, Miguel Estrada, \"Extraction of Urban Information for Seismic Hazard and Risk Assessment in Lima Peru Using Satellite Imagery\", <i>Journal of Disaster Research</i>, vol. 8, pp. 328, 2013.","links":{"crossRefLink":"https://doi.org/10.20965/jdr.2013.p0328"},"title":"Extraction of Urban Information for Seismic Hazard and Risk Assessment in Lima, Peru Using Satellite Imagery"},{"order":"17","displayText":"Carlos Gonzales, Shoichi Nakai, Toru Sekiguchi, Diana Calderon, Zenon Aguilar, Fernando Lazares, \"Analysis of Topographic Effects in Dynamic Response of a Typical Rocky Populated Slope in Lima Peru\", <i>Journal of Disaster Research</i>, vol. 9, pp. 946, 2014.","links":{"crossRefLink":"https://doi.org/10.20965/jdr.2014.p0946"},"title":"Analysis of Topographic Effects in Dynamic Response of a Typical Rocky Populated Slope in Lima, Peru"},{"order":"18","displayText":"Masashi Matsuoka, Shun Mito, Saburoh Midorikawa, Hiroyuki Miura, Luis G. Quiroz, Yoshihisa Maruyama, Miguel Estrada, \"Development of Building Inventory Data and  Earthquake Damage Estimation in Lima Peru for Future Earthquakes\", <i>Journal of Disaster Research</i>, vol. 9, pp. 1032, 2014.","links":{"crossRefLink":"https://doi.org/10.20965/jdr.2014.p1032"},"title":"Development of Building Inventory Data and  Earthquake Damage Estimation in Lima, Peru for Future Earthquakes"},{"order":"19","displayText":"Mirlan Daiyrov, Chiyuki Narama, Tsutomu Yamanokuchi, Takeo Tadono, Andreas Kääb, Jinro Ukita, \"Regional Geomorphological Conditions Related to Recent Changes of Glacial Lakes in the Issyk-Kul Basin Northern Tien Shan\", <i>Geosciences</i>, vol. 8, pp. 99, 2018.","links":{"crossRefLink":"https://doi.org/10.3390/geosciences8030099"},"title":"Regional Geomorphological Conditions Related to Recent Changes of Glacial Lakes in the Issyk-Kul Basin, Northern Tien Shan"},{"order":"20","displayText":"Zhichao Guan, Yonghua Jiang, Guo Zhang, \"Vertical Accuracy Simulation of Stereo Mapping Using a Small Matrix Charge-Coupled Device\", <i>Remote Sensing</i>, vol. 10, pp. 29, 2017.","links":{"crossRefLink":"https://doi.org/10.3390/rs10010029"},"title":"Vertical Accuracy Simulation of Stereo Mapping Using a Small Matrix Charge-Coupled Device"},{"order":"21","displayText":"Xiaohua Tong, Zhen Ye, Yusheng Xu, Xinming Tang, Shijie Liu, Lingyun Li, Huan Xie, Fengxiang Wang, Tianpeng Li, Zhonghua Hong, \"Framework of Jitter Detection and Compensation for High Resolution Satellites\", <i>Remote Sensing</i>, vol. 6, pp. 3944, 2014.","links":{"crossRefLink":"https://doi.org/10.3390/rs6053944"},"title":"Framework of Jitter Detection and Compensation for High Resolution Satellites"},{"order":"22","displayText":"Kai Xu, Guo Zhang, Mingjun Deng, Qingjun Zhang, Deren Li, \"Improving Geometric Performance for Imagery Captured by Non-Cartographic Optical Satellite: A Case Study of GF-1 WFV Imagery\", <i>Remote Sensing</i>, vol. 10, pp. 971, 2018.","links":{"crossRefLink":"https://doi.org/10.3390/rs10060971"},"title":"Improving Geometric Performance for Imagery Captured by Non-Cartographic Optical Satellite: A Case Study of GF-1 WFV Imagery"},{"order":"23","displayText":"H. Nagai, K. Fujita, A. Sakai, T. Nuimura, T. Tadono, \"Comparison of multiple glacier inventories with a new inventory derived from  high-resolution ALOS imagery in the Bhutan Himalaya\", <i>The Cryosphere</i>, vol. 10, pp. 65, 2016.","links":{"crossRefLink":"https://doi.org/10.5194/tc-10-65-2016"},"title":"Comparison of multiple glacier inventories with a new inventory derived from  high-resolution ALOS imagery in the Bhutan Himalaya"},{"order":"24","displayText":"Daniel Falaschi, Tobias Bolch, Maria Gabriela Lenzano, Takeo Tadono, Andrés Lo Vecchio, Luis Lenzano, \"New evidence of glacier surges in the Central Andes of Argentina and Chile\", <i>Progress in Physical Geography: Earth and Environment</i>, pp. 030913331880301, 2018.","links":{"crossRefLink":"https://doi.org/10.1177/0309133318803014"},"title":"New evidence of glacier surges in the Central Andes of Argentina and Chile"},{"order":"25","displayText":"Hepi Handayani, Yuji Murayama, Manjula Ranagalage, Fei Liu, DMSLB Dissanayake, \"Geospatial Analysis of Horizontal and Vertical Urban Expansion Using Multi-Spatial Resolution Data: A Case Study of Surabaya Indonesia\", <i>Remote Sensing</i>, vol. 10, pp. 1599, 2018.","links":{"crossRefLink":"https://doi.org/10.3390/rs10101599"},"title":"Geospatial Analysis of Horizontal and Vertical Urban Expansion Using Multi-Spatial Resolution Data: A Case Study of Surabaya, Indonesia"},{"order":"26","displayText":"Kai Li, Yongsheng Zhang, Zhenchao Zhang, Ying Yu, \"An Automatic Recognition and Positioning Method for Point Source Targets on Satellite Images\", <i>ISPRS International Journal of Geo-Information</i>, vol. 7, pp. 434, 2018.","links":{"crossRefLink":"https://doi.org/10.3390/ijgi7110434"},"title":"An Automatic Recognition and Positioning Method for Point Source Targets on Satellite Images"},{"order":"27","displayText":"Yingdong Pi, Bo Yang, Xin Li, Mi Wang, \"Study of full-link on-orbit geometric calibration using multi-attitude imaging with linear agile optical satellite\", <i>Optics Express</i>, vol. 27, pp. 980, 2019.","links":{"crossRefLink":"https://doi.org/10.1364/OE.27.000980"},"title":"Study of full-link on-orbit geometric calibration using multi-attitude imaging with linear agile optical satellite"},{"order":"28","displayText":"Yang Dong, Dazhao Fan, Qiuhe Ma, Song Ji, Huan Ouyang, \"Automatic on-orbit geometric calibration framework for geostationary optical satellite imagery using open access data\", <i>International Journal of Remote Sensing</i>, vol. 40, pp. 6154, 2019.","links":{"crossRefLink":"https://doi.org/10.1080/01431161.2019.1587206"},"title":"Automatic on-orbit geometric calibration framework for geostationary optical satellite imagery using open access data"},{"order":"29","displayText":"Keqi Zhang, Daniel Gann, Michael Ross, Quin Robertson, Juan Sarmiento, Sheyla Santana, Jamie Rhome, Cody Fritz, \"Accuracy assessment of ASTER SRTM ALOS and TDX DEMs for Hispaniola and implications for mapping vulnerability to coastal flooding\", <i>Remote Sensing of Environment</i>, vol. 225, pp. 290, 2019.","links":{"crossRefLink":"https://doi.org/10.1016/j.rse.2019.02.028"},"title":"Accuracy assessment of ASTER, SRTM, ALOS, and TDX DEMs for Hispaniola and implications for mapping vulnerability to coastal flooding"},{"order":"30","displayText":"Jinro Ukita, Chiyuki Narama, Takeo Tadono, Tsutomu Yamanokuchi, Nobuhiro Tomiyama, Sachi Kawamoto, Chika Abe, Tsuyoshi Uda, Hironori Yabuki, Koji Fujita, Kouichi Nishimura, \"Glacial lake inventory of Bhutan using ALOS data: methods and preliminary results\", <i>Annals of Glaciology</i>, vol. 52, pp. 65, 2011.","links":{"crossRefLink":"https://doi.org/10.3189/172756411797252293"},"title":"Glacial lake inventory of Bhutan using ALOS data: methods and preliminary results"}]},"formulaStrippedArticleTitle":"PRISM On-Orbit Geometric Calibration and DSM Performance","nonIeeeCitationCount":"44","contentTypeDisplay":"Journals","patentCitationCount":"0","mlTime":"PT7.240593S","lastupdate":"2021-11-07","title":"PRISM On-Orbit Geometric Calibration and DSM Performance","contentType":"periodicals","ieeeCitationCount":"40","publicationNumber":"36"},{"_id":5129789,"paperCitations":{"ieee":[{"order":"1","displayText":"Arum Han, \"Microsystems for single cell analysis\", <i>Circuits and Systems for Medical and Environmental Applications Workshop (CASME) 2010 2nd</i>, pp. 1-2, 2010.","links":{"documentLink":"/document/5706686","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=5706686","pdfSize":"53KB"},"title":"Microsystems for single cell analysis"},{"order":"2","displayText":"Abdul Hafiz Mat Sulaiman, Mohd Ridzuan Ahmad, \"Integrated dual nanoprobe-microfluidic system for single cell penetration\", <i>Control System Computing and Engineering (ICCSCE) 2013 IEEE International Conference on</i>, pp. 568-572, 2013.","links":{"documentLink":"/document/6720029","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6720029","pdfSize":"1084KB"},"title":"Integrated dual nanoprobe-microfluidic system for single cell penetration"},{"order":"3","displayText":"Federica Caselli, Paolo Bisegna, Franco Maceri, \"EIT-Inspired Microfluidic Cytometer for Single-Cell Dielectric Spectroscopy\", <i>Microelectromechanical Systems Journal of</i>, vol. 19, no. 5, pp. 1029-1040, 2010.","links":{"documentLink":"/document/5565373","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=5565373","pdfSize":"1977KB"},"title":"EIT-Inspired Microfluidic Cytometer for Single-Cell Dielectric Spectroscopy"},{"order":"4","displayText":"Rajapaksha W. R. L. Gajasinghe, Alperen Toprak, Sukru U. Senveli, Yagmur Akin Yildirim, Michelle Jones, Tan Ince, Onur Tigli, \"Rare Cell Immobilization on MEMS Scale Sensors Using Micro-Electromagnets\", <i>Sensors Journal IEEE</i>, vol. 16, no. 21, pp. 7572-7580, 2016.","links":{"documentLink":"/document/7544558","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7544558","pdfSize":"2118KB"},"title":"Rare Cell Immobilization on MEMS Scale Sensors Using Micro-Electromagnets"},{"order":"5","displayText":"Song-Bin Huang, Yang Zhao, Deyong Chen, Yana Luo, Hsin-Chieh Lee, Tzu-Keng Chiu, Junbo Wang, Jian Chen, Min-Hsien Wu, \"A clogging-free microfluidic platform for size independent single cancer cellular electrical property characterization\", <i>Nano/Micro Engineered and Molecular Systems (NEMS) 2014 9th IEEE International Conference on</i>, pp. 398-402, 2014.","links":{"documentLink":"/document/6908836","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6908836","pdfSize":"411KB"},"title":"A clogging-free microfluidic platform for size independent single cancer cellular electrical property characterization"},{"order":"6","displayText":"Tiffany Baëtens, Grégoire Perret, Yuki Takayama, Momoko Kumemura, Laurent Jalabert, Samuel Meignan, Chann Lagadec, Fujita Hiroyuki, Dominique Collard, Mehmet Cagatay Tarhan, \"A practical single cell analysis method for mechanical characterization of cancer cells\", <i>Micro Electro Mechanical Systems (MEMS) 2017 IEEE 30th International Conference on</i>, pp. 608-611, 2017.","links":{"documentLink":"/document/7863481","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7863481","pdfSize":"1817KB"},"title":"A practical single cell analysis method for mechanical characterization of cancer cells"},{"order":"7","displayText":"Jinlong Gu, Nicole McFarlane, \"Low power current mode ramp ADC for multi-frequency cell impedance measurement\", <i>Circuits and Systems (MWSCAS) 2012 IEEE 55th International Midwest Symposium on</i>, pp. 1016-1019, 2012.","links":{"documentLink":"/document/6292195","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6292195","pdfSize":"566KB"},"title":"Low power current mode ramp ADC for multi-frequency cell impedance measurement"}],"nonIeee":[{"order":"1","displayText":"Akram El Hasni, Carlo Schmitz, Katrin Bui-Göbbels, Peter Bräunig, Wilhelm Jahnen-Dechent, Uwe Schnakenberg, \"Electrical Impedance Spectroscopy of Single Cells in Hydrodynamic Traps\", <i>Sensors and Actuators B: Chemical</i>, 2017.","links":{"crossRefLink":"https://doi.org/10.1016/j.snb.2017.04.019"},"title":"Electrical Impedance Spectroscopy of Single Cells in Hydrodynamic Traps"},{"order":"2","displayText":"Nora Haase, Arne F. Jacob, \"Dielectric contrast measurements on biological substances with resonant microwave near-field sensors\", <i>International Journal of Microwave and Wireless Technologies</i>, vol. 5, pp. 221, 2013.","links":{"crossRefLink":"https://doi.org/10.1017/S1759078713000469"},"title":"Dielectric contrast measurements on biological substances with resonant microwave near-field sensors"},{"order":"3","displayText":"Verena Charwat, Mario Rothbauer, Sandro F. Tedde, Oliver Hayden, Jacobus J. Bosch, Paul Muellner, Rainer Hainberger, Peter Ertl, \"Monitoring Dynamic Interactions of Tumor Cells with Tissue and Immune Cells in a Lab-on-a-Chip\", <i>Analytical Chemistry</i>, vol. 85, pp. 11471, 2013.","links":{"crossRefLink":"https://doi.org/10.1021/ac4033406"},"title":"Monitoring Dynamic Interactions of Tumor Cells with Tissue and Immune Cells in a Lab-on-a-Chip"},{"order":"4","displayText":"Yang Zhao, Mei Jiang, Deyong Chen, Xiaoting Zhao, Chengcheng Xue, Rui Hao, Wentao Yue, Junbo Wang, Jian Chen, \"Single-Cell Electrical Phenotyping Enabling the Classification of Mouse Tumor Samples\", <i>Scientific Reports</i>, vol. 6, pp. 19487, 2016.","links":{"crossRefLink":"https://doi.org/10.1038/srep19487"},"title":"Single-Cell Electrical Phenotyping Enabling the Classification of Mouse Tumor Samples"},{"order":"5","displayText":"Omer Osman Saeed, Rui Li, Yulin Deng, \"Microfluidic Approaches for Cancer Cell Separation: Review\", <i>Journal of Biomedical Science and Engineering</i>, vol. 07, pp. 1005, 2014.","links":{"crossRefLink":"https://doi.org/10.4236/jbise.2014.712098"},"title":"Microfluidic Approaches for Cancer Cell Separation: Review"},{"order":"6","displayText":"Sunil K. Arya, Kok Chuan Lee, Dhiya''uddin Bin Dah''alan,  Daniel, Abdur Rub Abdur Rahman, \"Breast tumor cell detection at single cell resolution using an electrochemical impedance technique\", <i>Lab on a Chip</i>, vol. 12, pp. 2362, 2012.","links":{"crossRefLink":"https://doi.org/10.1039/c2lc21174b"},"title":"Breast tumor cell detection at single cell resolution using an electrochemical impedance technique"},{"order":"7","displayText":"Jian Chen, Jason Li, Yu Sun, \"Microfluidic approaches for cancer cell detection characterization and separation\", <i>Lab on a Chip</i>, vol. 12, pp. 1753, 2012.","links":{"crossRefLink":"https://doi.org/10.1039/c2lc21273k"},"title":"Microfluidic approaches for cancer cell detection, characterization, and separation"},{"order":"8","displayText":"Yuan Luo, Xu Cao, Pingbo Huang, Levent Yobas, \"Microcapillary-assisted dielectrophoresis for single-particle positioning\", <i>Lab on a Chip</i>, vol. 12, pp. 4085, 2012.","links":{"crossRefLink":"https://doi.org/10.1039/c2lc40150a"},"title":"Microcapillary-assisted dielectrophoresis for single-particle positioning"},{"order":"9","displayText":"Vaishnavi Srinivasaraghavan, Jeannine Strobl, Masoud Agah, \"Bioimpedance rise in response to histone deacetylase inhibitor is a marker of mammary cancer cells within a mixed culture of normal breast cells\", <i>Lab on a Chip</i>, vol. 12, pp. 5168, 2012.","links":{"crossRefLink":"https://doi.org/10.1039/c2lc40778g"},"title":"Bioimpedance rise in response to histone deacetylase inhibitor is a marker of mammary cancer cells within a mixed culture of normal breast cells"},{"order":"10","displayText":"Hongjun Song, Yi Wang, Jenna M. Rosano, Balabhaskar Prabhakarpandian, Charles Garson, Kapil Pant, Eva Lai, \"A microfluidic impedance flow cytometer for identification of differentiation state of stem cells\", <i>Lab on a Chip</i>, vol. 13, pp. 2300, 2013.","links":{"crossRefLink":"https://doi.org/10.1039/c3lc41321g"},"title":"A microfluidic impedance flow cytometer for identification of differentiation state of stem cells"},{"order":"11","displayText":"Yang Zhao, Deyong Chen, Yana Luo, Hao Li, Bin Deng, Song-Bin Huang, Tzu-Keng Chiu, Min-Hsien Wu, Rong Long, Hao Hu, Xiaoting Zhao, Wentao Yue, Junbo Wang, Jian Chen, \"A microfluidic system for cell type classification based on cellular size-independent electrical properties\", <i>Lab on a Chip</i>, vol. 13, pp. 2272, 2013.","links":{"crossRefLink":"https://doi.org/10.1039/c3lc41361f"},"title":"A microfluidic system for cell type classification based on cellular size-independent electrical properties"},{"order":"12","displayText":"Yi Zheng, John Nguyen, Yuan Wei, Yu Sun, \"Recent advances in microfluidic techniques for single-cell biophysical characterization\", <i>Lab on a Chip</i>, vol. 13, pp. 2464, 2013.","links":{"crossRefLink":"https://doi.org/10.1039/c3lc50355k"},"title":"Recent advances in microfluidic techniques for single-cell biophysical characterization"},{"order":"13","displayText":"Jian Chen, Yi Zheng, Qingyuan Tan, Yan Liang Zhang, Jason Li, William R. Geddie, Michael A. S. Jewett, Yu Sun, \"A microfluidic device for simultaneous electrical and mechanical measurements on single cells\", <i>Biomicrofluidics</i>, vol. 5, pp. 014113, 2011.","links":{"crossRefLink":"https://doi.org/10.1063/1.3571530"},"title":"A microfluidic device for simultaneous electrical and mechanical measurements on single cells"},{"order":"14","displayText":"Yangkyu Park, Jung-Joon Cha, Seungwan Seo, Joho Yun, Hyeon Woo Kim, Changju Park, Giseok Gang, Juhun Lim, Jong-Hyun Lee, \"Ex vivo characterization of age-associated impedance changes of single vascular endothelial cells using micro electrical impedance spectroscopy with a cell trap\", <i>Biomicrofluidics</i>, vol. 10, pp. 014114, 2016.","links":{"crossRefLink":"https://doi.org/10.1063/1.4941044"},"title":"Ex vivo characterization of age-associated impedance changes of single vascular endothelial cells using micro electrical impedance spectroscopy with a cell trap"},{"order":"15","displayText":"Whitney Longsine-Parker, Arum Han, \"Laser stenciling: a low-cost high-resolution CO2laser micromachining method\", <i>Journal of Micromechanics and Microengineering</i>, vol. 22, pp. 015006, 2012.","links":{"crossRefLink":"https://doi.org/10.1088/0960-1317/22/1/015006"},"title":"Laser stenciling: a low-cost high-resolution CO2laser micromachining method"},{"order":"16","displayText":"Guan-Ting Chen, Chia-Feng Liu, Ling-Sheng Jang, Shun-Lai Li, Min-Haw Wang, \"Particle trapping and impedance measurement using bilayer electrodes integrated with microcavity structure\", <i>Journal of Micromechanics and Microengineering</i>, vol. 27, pp. 035007, 2017.","links":{"crossRefLink":"https://doi.org/10.1088/1361-6439/aa4e9d"},"title":"Particle trapping and impedance measurement using bilayer electrodes integrated with microcavity structure"},{"order":"17","displayText":"Fareid Asphahani, Kui Wang, Myo Thein, Omid Veiseh, Sandy Yung, Jian Xu, Miqin Zhang, \"Single-cell bioelectrical impedance platform for monitoring cellular response to drug treatment\", <i>Physical Biology</i>, vol. 8, pp. 015006, 2011.","links":{"crossRefLink":"https://doi.org/10.1088/1478-3975/8/1/015006"},"title":"Single-cell bioelectrical impedance platform for monitoring cellular response to drug treatment"},{"order":"18","displayText":"Ida Laila Ahmad, Mohd Ridzuan Ahmad, \"Trends in characterizing single cell’s stiffness properties\", <i>Micro and Nano Systems Letters</i>, vol. 2, 2014.","links":{"crossRefLink":"https://doi.org/10.1186/s40486-014-0008-5"},"title":"Trends in characterizing single cell’s stiffness properties"},{"order":"19","displayText":"Sara Crocetti, Christian Beyer, Grit Schade, Marcel Egli, Jürg Fröhlich, Alfredo Franco-Obregón, Ilya Ulasov, \"Low Intensity and Frequency Pulsed Electromagnetic Fields Selectively Impair Breast Cancer Cell Viability\", <i>PLoS ONE</i>, vol. 8, pp. e72944, 2013.","links":{"crossRefLink":"https://doi.org/10.1371/journal.pone.0072944"},"title":"Low Intensity and Frequency Pulsed Electromagnetic Fields Selectively Impair Breast Cancer Cell Viability"},{"order":"20","displayText":"Yang Zhao, Qingxi Liu, He Sun, Deyong Chen, Zhaohui Li, Beiyuan Fan, Julian George, Chengcheng Xue, Zhanfeng Cui, Junbo Wang, Jian Chen, Wenhui Hu, \"Electrical Property Characterization of Neural Stem Cells in Differentiation\", <i>PLOS ONE</i>, vol. 11, pp. e0158044, 2016.","links":{"crossRefLink":"https://doi.org/10.1371/journal.pone.0158044"},"title":"Electrical Property Characterization of Neural Stem Cells in Differentiation"},{"order":"21","displayText":"Amelia Ahmad Khalili, Mohd Ahmad, Masaru Takeuchi, Masahiro Nakajima, Yasuhisa Hasegawa, Razauden Mohamed Zulkifli, \"A Microfluidic Device for Hydrodynamic Trapping and Manipulation Platform of a Single Biological Cell\", <i>Applied Sciences</i>, vol. 6, pp. 40, 2016.","links":{"crossRefLink":"https://doi.org/10.3390/app6020040"},"title":"A Microfluidic Device for Hydrodynamic Trapping and Manipulation Platform of a Single Biological Cell"},{"order":"22","displayText":"Mario Rothbauer, Irene Praisler, Dominic Docter, Roland Stauber, Peter Ertl, \"Microfluidic Impedimetric Cell Regeneration Assay to Monitor the Enhanced Cytotoxic Effect of Nanomaterial Perfusion\", <i>Biosensors</i>, vol. 5, pp. 736, 2015.","links":{"crossRefLink":"https://doi.org/10.3390/bios5040736"},"title":"Microfluidic Impedimetric Cell Regeneration Assay to Monitor the Enhanced Cytotoxic Effect of Nanomaterial Perfusion"},{"order":"23","displayText":"Jian Chen, Chengcheng Xue, Yang Zhao, Deyong Chen, Min-Hsien Wu, Junbo Wang, \"Microfluidic Impedance Flow Cytometry Enabling High-Throughput Single-Cell Electrical Property Characterization\", <i>International Journal of Molecular Sciences</i>, vol. 16, pp. 9804, 2015.","links":{"crossRefLink":"https://doi.org/10.3390/ijms16059804"},"title":"Microfluidic Impedance Flow Cytometry Enabling High-Throughput Single-Cell Electrical Property Characterization"},{"order":"24","displayText":"Muhammad Mansor, Mohd Ahmad, \"Single Cell Electrical Characterization Techniques\", <i>International Journal of Molecular Sciences</i>, vol. 16, pp. 12686, 2015.","links":{"crossRefLink":"https://doi.org/10.3390/ijms160612686"},"title":"Single Cell Electrical Characterization Techniques"},{"order":"25","displayText":"Ke Wang, Yang Zhao, Deyong Chen, Chengjun Huang, Beiyuan Fan, Rong Long, Chia-Hsun Hsieh, Junbo Wang, Min-Hsien Wu, Jian Chen, \"The Instrumentation of a Microfluidic Analyzer Enabling the Characterization of the Specific Membrane Capacitance Cytoplasm Conductivity and Instantaneous Young’s Modulus of Single Cells\", <i>International Journal of Molecular Sciences</i>, vol. 18, pp. 1158, 2017.","links":{"crossRefLink":"https://doi.org/10.3390/ijms18061158"},"title":"The Instrumentation of a Microfluidic Analyzer Enabling the Characterization of the Specific Membrane Capacitance, Cytoplasm Conductivity, and Instantaneous Young’s Modulus of Single Cells"},{"order":"26","displayText":"Song-Bin Huang, Yang Zhao, Deyong Chen, Shing-Lun Liu, Yana Luo, Tzu-Keng Chiu, Junbo Wang, Jian Chen, Min-Hsien Wu, \"Classification of Cells with Membrane Staining and/or Fixation Based on Cellular Specific Membrane Capacitance and Cytoplasm Conductivity\", <i>Micromachines</i>, vol. 6, pp. 163, 2015.","links":{"crossRefLink":"https://doi.org/10.3390/mi6020163"},"title":"Classification of Cells with Membrane Staining and/or Fixation Based on Cellular Specific Membrane Capacitance and Cytoplasm Conductivity"},{"order":"27","displayText":"Virgilio Valente, Andreas Demosthenous, \"Wideband Fully-Programmable Dual-Mode CMOS Analogue Front-End for Electrical Impedance Spectroscopy\", <i>Sensors</i>, vol. 16, pp. 1159, 2016.","links":{"crossRefLink":"https://doi.org/10.3390/s16081159"},"title":"Wideband Fully-Programmable Dual-Mode CMOS Analogue Front-End for Electrical Impedance Spectroscopy"},{"order":"28","displayText":"Drago Sticker, Mario Rothbauer, Verena Charwat, Jan Steinkühler, Ole Bethge, Emmerich Bertagnolli, Heinz D. Wanzenboeck, Peter Ertl, \"Zirconium dioxide nanolayer passivated impedimetric sensors for cell-based assays\", <i>Sensors and Actuators B: Chemical</i>, vol. 213, pp. 35, 2015.","links":{"crossRefLink":"https://doi.org/10.1016/j.snb.2015.02.018"},"title":"Zirconium dioxide nanolayer passivated impedimetric sensors for cell-based assays"},{"order":"29","displayText":"Song-Bin Huang, Yang Zhao, Deyong Chen, Hsin-Chieh Lee, Yana Luo, Tzu-Keng Chiu, Junbo Wang, Jian Chen, Min-Hsien Wu, \"A clogging-free microfluidic platform with an incorporated pneumatically driven membrane-based active valve enabling specific membrane capacitance and cytoplasm conductivity characterization of single cells\", <i>Sensors and Actuators B: Chemical</i>, vol. 190, pp. 928, 2014.","links":{"crossRefLink":"https://doi.org/10.1016/j.snb.2013.09.070"},"title":"A clogging-free microfluidic platform with an incorporated pneumatically driven membrane-based active valve enabling specific membrane capacitance and cytoplasm conductivity characterization of single cells"},{"order":"30","displayText":"Hamed Abiri, Mohammad Abdolahad, Milad Gharooni, Seyed Ali Hosseini, Mohsen Janmaleki, Soheil Azimi, Mohammad Hosseini, Shams Mohajerzadeh, \"Monitoring the spreading stage of lung cells by silicon nanowire electrical cell impedance sensor for cancer detection purposes\", <i>Biosensors and Bioelectronics</i>, vol. 68, pp. 577, 2015.","links":{"crossRefLink":"https://doi.org/10.1016/j.bios.2015.01.057"},"title":"Monitoring the spreading stage of lung cells by silicon nanowire electrical cell impedance sensor for cancer detection purposes"}]},"formulaStrippedArticleTitle":"Whole-Cell Impedance Analysis for Highly and Poorly Metastatic Cancer Cells","nonIeeeCitationCount":"45","contentTypeDisplay":"Journals","patentCitationCount":"0","mlTime":"PT0.577143S","lastupdate":"2021-11-07","title":"Whole-Cell Impedance Analysis for Highly and Poorly Metastatic Cancer Cells","contentType":"periodicals","ieeeCitationCount":"7","publicationNumber":"84"},{"_id":5129873,"paperCitations":{"ieee":[{"order":"1","displayText":"Ching Chuen Chan, Linni Jian, Dan Tu, \"Smart charging of electric vehicles – integration of energy and information\", <i>Electrical Systems in Transportation IET</i>, vol. 4, no. 4, pp. 89-96, 2014.","links":{"crossRefLink":"https://doi.org/10.1049/iet-est.2013.0025","pdfSize":"623KB"},"title":"Smart charging of electric vehicles – integration of energy and information"},{"order":"2","displayText":"Jing Huang, Vijay Gupta, Yih-Fang Huang, \"Scheduling algorithms for PHEV charging in shared parking lots\", <i>American Control Conference (ACC) 2012</i>, pp. 276-281, 2012.","links":{"documentLink":"/document/6314939","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6314939","pdfSize":"162KB"},"title":"Scheduling algorithms for PHEV charging in shared parking lots"},{"order":"3","displayText":"Saptarshi Bhattacharya, Koushik Kar, Joe H. Chow, Aparna Gupta, \"Extended second price auctions for Plug-in Electric Vehicle (PEV) charging in smart distribution grids\", <i>American Control Conference (ACC) 2014</i>, pp. 908-913, 2014.","links":{"documentLink":"/document/6859300","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6859300","pdfSize":"263KB"},"title":"Extended second price auctions for Plug-in Electric Vehicle (PEV) charging in smart distribution grids"},{"order":"4","displayText":"Peng-Yong Kong, George K. Karagiannidis, \"Charging Schemes for Plug-In Hybrid Electric Vehicles in Smart Grid: A Survey\", <i>Access IEEE</i>, vol. 4, pp. 6846-6875, 2016.","links":{"documentLink":"/document/7586042","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7586042","pdfSize":"9515KB"},"title":"Charging Schemes for Plug-In Hybrid Electric Vehicles in Smart Grid: A Survey"},{"order":"5","displayText":"Serkan Dusmez, Alireza Khaligh, \"Cost effective solutions to level 3 on-board battery chargers\", <i>Applied Power Electronics Conference and Exposition (APEC) 2012 Twenty-Seventh Annual IEEE</i>, pp. 2121-2127, 2012.","links":{"documentLink":"/document/6166114","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6166114","pdfSize":"1381KB"},"title":"Cost effective solutions to level 3 on-board battery chargers"},{"order":"6","displayText":"Serkan Dusmez, Alireza Khaligh, \"A novel low cost integrated on-board charger topology for electric vehicles and plug-in hybrid electric vehicles\", <i>Applied Power Electronics Conference and Exposition (APEC) 2012 Twenty-Seventh Annual IEEE</i>, pp. 2611-2616, 2012.","links":{"documentLink":"/document/6166191","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6166191","pdfSize":"1445KB"},"title":"A novel low cost integrated on-board charger topology for electric vehicles and plug-in hybrid electric vehicles"},{"order":"7","displayText":"Di Wu, Chengrui Cai, Dionysios C. Aliprantis, \"Potential impacts of aggregator-controlled plug-in electric vehicles on distribution systems\", <i>Computational Advances in Multi-Sensor Adaptive Processing (CAMSAP) 2011 4th IEEE International Workshop on</i>, pp. 105-108, 2011.","links":{"documentLink":"/document/6135898","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6135898","pdfSize":"315KB"},"title":"Potential impacts of aggregator-controlled plug-in electric vehicles on distribution systems"},{"order":"8","displayText":"Renshi Luo, Romain Bourdais, Ton J.J. van den Boom, Bart De Schutter, \"Integration of resource allocation coordination and branch-and-bound\", <i>Decision and Control (CDC) 2015 IEEE 54th Annual Conference on</i>, pp. 4272-4277, 2015.","links":{"documentLink":"/document/7402885","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7402885","pdfSize":"153KB"},"title":"Integration of resource allocation coordination and branch-and-bound"},{"order":"9","displayText":"Abouzar Ghavami, Koushik Kar, Saptarshi Bhattacharya, Aparna Gupta, \"Price-driven charging of Plug-in Electric Vehicles: Nash equilibrium social optimality and best-response convergence\", <i>Information Sciences and Systems (CISS) 2013 47th Annual Conference on</i>, pp. 1-6, 2013.","links":{"documentLink":"/document/6552326","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6552326","pdfSize":"592KB"},"title":"Price-driven charging of Plug-in Electric Vehicles: Nash equilibrium, social optimality and best-response convergence"},{"order":"10","displayText":"Abouzar Ghavami, Koushik Kar, \"Nonlinear pricing for social optimality of PEV charging under uncertain user preferences\", <i>Information Sciences and Systems (CISS) 2014 48th Annual Conference on</i>, pp. 1-6, 2014.","links":{"documentLink":"/document/6814154","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6814154","pdfSize":"666KB"},"title":"Nonlinear pricing for social optimality of PEV charging under uncertain user preferences"},{"order":"11","displayText":"Samaneh Pazouki, Amin Mohsenzadeh, Shahab Ardalan, Mahmoud-Reza Haghifam, \"Simultaneous Planning of PEV Charging Stations and DGs Considering Financial Technicaland Environmental Effects\", <i>Electrical and Computer Engineering Canadian Journal of</i>, vol. 38, no. 3, pp. 238-245, 2015.","links":{"documentLink":"/document/7270415","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7270415","pdfSize":"2087KB"},"title":"Simultaneous Planning of PEV Charging Stations and DGs Considering Financial, Technical,and Environmental Effects"},{"order":"12","displayText":"Bowei Feng, Rong Yu, Yue Lai, \"Efficient and fair scheduling of PHEV charging with neuro dynamic programming\", <i>Communications and Networking in China (CHINACOM) 2013 8th International ICST Conference on</i>, pp. 930-935, 2013.","links":{"documentLink":"/document/6694728","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6694728","pdfSize":"458KB"},"title":"Efficient and fair scheduling of PHEV charging with neuro dynamic programming"},{"order":"13","displayText":"Qi Zuo, Ming Zhou, Hailei He, Caihao Liang, Qinyong Zhou, Wenjie He, \"Research on quantitatively evaluating system acceptance capacity of electric vehicles considering coordinated strategy\", <i>Electric Utility Deregulation and Restructuring and Power Technologies (DRPT) 2015 5th International Conference on</i>, pp. 2614-2619, 2015.","links":{"documentLink":"/document/7432690","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7432690","pdfSize":"333KB"},"title":"Research on quantitatively evaluating system acceptance capacity of electric vehicles considering coordinated strategy"},{"order":"14","displayText":"Wenjie Zhang, Hao Quan, Oktoviano Gandhi, Carlos D. Rodríguez-Gallegos, Dipti Srinivasan, Yang Weng, \"Dynamic and fast electric vehicle charging coordinating scheme considering V2G based var compensation\", <i>Energy Internet and Energy System Integration (EI2) 2017 IEEE Conference on</i>, pp. 1-6, 2017.","links":{"documentLink":"/document/8245686","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8245686","pdfSize":"347KB"},"title":"Dynamic and fast electric vehicle charging coordinating scheme, considering V2G based var compensation"},{"order":"15","displayText":"M. F. Shaabar, E. F. El-Saadany, \"Accommodating high penetration of PEV in distribution networks\", <i>Electrical Power & Energy Conference (EPEC) 2013 IEEE</i>, pp. 1-6, 2013.","links":{"documentLink":"/document/6802945","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6802945","pdfSize":"369KB"},"title":"Accommodating high penetration of PEV in distribution networks"},{"order":"16","displayText":"Sami M. Alshareef, Walid G. Morsi, \"Impact of fast charging stations on the voltage flicker in the electric power distribution systems\", <i>Electrical Power and Energy Conference (EPEC) 2017 IEEE</i>, pp. 1-6, 2017.","links":{"documentLink":"/document/8286226","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8286226","pdfSize":"1645KB"},"title":"Impact of fast charging stations on the voltage flicker in the electric power distribution systems"},{"order":"17","displayText":"M. Hossein Moayyed Jahromi, Behzad Asaei, Navid Haghdadi, \"Demand response program evaluation for plugin hybrid electric vehicles purchase encouragement\", <i>Electric Power and Energy Conversion Systems (EPECS) 2011 2nd International Conference on</i>, pp. 1-6, 2011.","links":{"documentLink":"/document/6126796","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6126796","pdfSize":"423KB"},"title":"Demand response program evaluation for plugin hybrid electric vehicles purchase encouragement"},{"order":"18","displayText":"M. Hossein Moayyed Jahromi, Behzad Asaei, Navid Haghdadi, \"Clustering power demand for feasibility study on transition to plugin hybrid electric vehicles\", <i>Electric Power and Energy Conversion Systems (EPECS) 2011 2nd International Conference on</i>, pp. 1-6, 2011.","links":{"documentLink":"/document/6126824","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6126824","pdfSize":"422KB"},"title":"Clustering power demand for feasibility study on transition to plugin hybrid electric vehicles"},{"order":"19","displayText":"M. F. Shaaban, E. F. El-Saadany, \"Probabilistic modeling of PHEV charging load in distribution systems\", <i>Electric Power and Energy Conversion Systems (EPECS) 2013 3rd International Conference on</i>, pp. 1-6, 2013.","links":{"documentLink":"/document/6712981","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6712981","pdfSize":"942KB"},"title":"Probabilistic modeling of PHEV charging load in distribution systems"},{"order":"20","displayText":"Lei Yang, Junshan Zhang, Dajun Qian, \"Risk-aware day-ahead scheduling and real-time dispatch for plug-in electric vehicles\", <i>Global Communications Conference (GLOBECOM) 2012 IEEE</i>, pp. 3026-3031, 2012.","links":{"documentLink":"/document/6503578","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6503578","pdfSize":"297KB"},"title":"Risk-aware day-ahead scheduling and real-time dispatch for plug-in electric vehicles"},{"order":"21","displayText":"Weifeng Zhong, Rong Yu, Yan Zhang, \"Fair energy scheduling in vehicle-to-grid networks in the smart grid\", <i>Communications (ICC) 2014 IEEE International Conference on</i>, pp. 4246-4251, 2014.","links":{"documentLink":"/document/6883987","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6883987","pdfSize":"232KB"},"title":"Fair energy scheduling in vehicle-to-grid networks in the smart grid"},{"order":"22","displayText":"Adel M. Sharaf, Mustafa E. Şahin, \"A novel photovoltaic PV-powered battery charging scheme for electric vehicles\", <i>Energy Automation and Signal (ICEAS) 2011 International Conference on</i>, pp. 1-5, 2011.","links":{"documentLink":"/document/6147212","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6147212","pdfSize":"419KB"},"title":"A novel photovoltaic PV-powered battery charging scheme for electric vehicles"},{"order":"23","displayText":"A. M. Sharaf, B. Khaki, \"Power quality enhancement using FACTS neutral point filter compensator for EV-battery charging schemes\", <i>Energy Automation and Signal (ICEAS) 2011 International Conference on</i>, pp. 1-7, 2011.","links":{"documentLink":"/document/6147213","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6147213","pdfSize":"483KB"},"title":"Power quality enhancement using FACTS neutral point filter compensator for EV-battery charging schemes"},{"order":"24","displayText":"Han Xiao, Yuan Huimei, Wei Chen, Li Hongjun, \"A survey of influence of electrics vehicle charging on power grid\", <i>Industrial Electronics and Applications (ICIEA) 2014 IEEE 9th Conference on</i>, pp. 121-126, 2014.","links":{"documentLink":"/document/6931143","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6931143","pdfSize":"157KB"},"title":"A survey of influence of electrics vehicle charging on power grid"},{"order":"25","displayText":"Weifeng Zhong, Chuan Lu, Rong Yu, \"Adaptive price control for electric vehicle charging in smart grid\", <i>Information Science and Technology (ICIST) 2015 5th International Conference on</i>, pp. 292-296, 2015.","links":{"documentLink":"/document/7288985","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7288985","pdfSize":"634KB"},"title":"Adaptive price control for electric vehicle charging in smart grid"},{"order":"26","displayText":"Anas Tahir, Ahmed Massoud, \"Load shedding and forecasting in distribution systems with PV-based distributed generation and electric vehicles\", <i>Information Technology Computer and Electrical Engineering (ICITACEE) 2017 4th International Conference on</i>, pp. 71-76, 2017.","links":{"documentLink":"/document/8257678","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8257678","pdfSize":"518KB"},"title":"Load shedding and forecasting in distribution systems with PV-based distributed generation and electric vehicles"},{"order":"27","displayText":"K. Nandha Kumar, B. Sivaneasan, P. L. So, D. Z. W. Wang, \"Methodology for optimizing the number of electric vehicles deployed under a smart grid\", <i>Industrial Electronics Society IECON 2013 - 39th Annual Conference of the IEEE</i>, pp. 4647-4652, 2013.","links":{"documentLink":"/document/6699885","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6699885","pdfSize":"474KB"},"title":"Methodology for optimizing the number of electric vehicles deployed under a smart grid"},{"order":"28","displayText":"Shintaro Tanaka, \"Off-time control that reduces boost current imbalance for a bi-directional isolated parallel DC-DC converter\", <i>Future Energy Electronics Conference (IFEEC) 2015 IEEE 2nd International</i>, pp. 1-6, 2015.","links":{"documentLink":"/document/7361469","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7361469","pdfSize":"492KB"},"title":"Off-time control that reduces boost current imbalance for a bi-directional isolated parallel DC-DC converter"},{"order":"29","displayText":"Seonghye Kim, Feel-soon Kang, \"Hybrid battery charging system combining OBC with LDC for electric vehicles\", <i>Power Electronics Conference (IPEC-Hiroshima 2014 - ECCE-ASIA) 2014 International</i>, pp. 2260-2265, 2014.","links":{"documentLink":"/document/6869904","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6869904","pdfSize":"3122KB"},"title":"Hybrid battery charging system combining OBC with LDC for electric vehicles"},{"order":"30","displayText":"S Sathish Kumar, G Kanimozhi, \"A nonlinear control technique for interleaved boost converter\", <i>Intelligent Systems and Control (ISCO) 2016 10th International Conference on</i>, pp. 1-6, 2016.","links":{"documentLink":"/document/7726926","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7726926","pdfSize":"556KB"},"title":"A nonlinear control technique for interleaved boost converter"}],"nonIeee":[{"order":"1","displayText":"Mohamed M. Aly, Emad Abdelkarim, Mamdouh Abdel-Akher, \"Mitigation of photovoltaic power generation fluctuations using plug-in hybrid electric vehicles storage batteries\", <i>International Transactions on Electrical Energy Systems</i>, vol. 25, pp. 3720, 2015.","links":{"crossRefLink":"https://doi.org/10.1002/etep.2062"},"title":"Mitigation of photovoltaic power generation fluctuations using plug-in hybrid electric vehicles storage batteries"},{"order":"2","displayText":"Hamed Nafisi, Hossein Askarian Abyaneh, Mehrdad Abedi, \"Energy loss minimization using PHEVs as distributed active and reactive power resources: a convex quadratic local optimal solution\", <i>International Transactions on Electrical Energy Systems</i>, vol. 26, pp. 1287, 2016.","links":{"crossRefLink":"https://doi.org/10.1002/etep.2134"},"title":"Energy loss minimization using PHEVs as distributed active and reactive power resources: a convex quadratic local optimal solution"},{"order":"3","displayText":"Miao Wang, Ran Zhang, Xuemin Shen, <i>Mobile Electric Vehicles</i>, pp. 1, 2016.","links":{"crossRefLink":"https://doi.org/10.1007/978-3-319-25130-1_1"},"title":""},{"order":"4","displayText":"Mehdi Rahmani-Andebili, Mahmud Fotuhi Firuzabad, Moein Moeini-Aghtaie, <i>Electric Distribution Network Planning</i>, pp. 299, 2018.","links":{"crossRefLink":"https://doi.org/10.1007/978-981-10-7056-3_11"},"title":""},{"order":"5","displayText":"N. Ayoub, H.A. Gabbar, <i>Smart Energy Grid Engineering</i>, pp. 399, 2017.","links":{"crossRefLink":"https://doi.org/10.1016/B978-0-12-805343-0.00015-2"},"title":""},{"order":"6","displayText":"Hossam A. Gabbar, Raymond Bedard, Nasser Ayoub, \"Integrated modeling for optimized regional transportation with compressed natural gas fuel\", <i>Alexandria Engineering Journal</i>, 2015.","links":{"crossRefLink":"https://doi.org/10.1016/j.aej.2015.10.007"},"title":"Integrated modeling for optimized regional transportation with compressed natural gas fuel"},{"order":"7","displayText":"Hamed Hashemi-Dezaki, Mohsen Hamzeh, Hossein Askarian-Abyaneh, Homayoun Haeri-Khiavi, \"Risk management of smart grids based on managed charging of PHEVs and vehicle-to-grid strategy using Monte Carlo simulation\", <i>Energy Conversion and Management</i>, vol. 100, pp. 262, 2015.","links":{"crossRefLink":"https://doi.org/10.1016/j.enconman.2015.05.015"},"title":"Risk management of smart grids based on managed charging of PHEVs and vehicle-to-grid strategy using Monte Carlo simulation"},{"order":"8","displayText":"Abhishek Awasthi, Karthikeyan Venkitusamy,  SanjeevikumarPadmanaban, Rajasekar Selvamuthukumaran, Frede Blaabjerg, Asheesh.K. Singh, \"Optimal Planning of Electric Vehicle Charging Station at the Distribution System Using Hybrid Optimization Algorithm\", <i>Energy</i>, 2017.","links":{"crossRefLink":"https://doi.org/10.1016/j.energy.2017.05.094"},"title":"Optimal Planning of Electric Vehicle Charging Station at the Distribution System Using Hybrid Optimization Algorithm"},{"order":"9","displayText":"Sreten Davidov, Miloš Pantoš, \"Impact of Stochastic Driving Range on the Optimal Charging Infrastructure Expansion Planning\", <i>Energy</i>, 2017.","links":{"crossRefLink":"https://doi.org/10.1016/j.energy.2017.09.126"},"title":"Impact of Stochastic Driving Range on the Optimal Charging Infrastructure Expansion Planning"},{"order":"10","displayText":"Wu Jiekang, Wu Zhijiang, Wu Fan, Tang Huiling, Mao Xiaoming, \"CVaR Risk-Based Optimization Framework for Renewable Energy Management in Distribution Systems with DGs and EVs\", <i>Energy</i>, 2017.","links":{"crossRefLink":"https://doi.org/10.1016/j.energy.2017.10.083"},"title":"CVaR Risk-Based Optimization Framework for Renewable Energy Management in Distribution Systems with DGs and EVs"},{"order":"11","displayText":"Renshi Luo, Romain Bourdais, Ton J.J. van den Boom, Bart De Schutter, \"Multi-agent model predictive control based on resource allocation coordination for a class of hybrid systems with limited information sharing\", <i>Engineering Applications of Artificial Intelligence</i>, vol. 58, pp. 123, 2017.","links":{"crossRefLink":"https://doi.org/10.1016/j.engappai.2016.12.005"},"title":"Multi-agent model predictive control based on resource allocation coordination for a class of hybrid systems with limited information sharing"},{"order":"12","displayText":"Agathe Grenier, Shannon Page, \"The impact of electrified transport on local grid infrastructure: A comparison between electric cars and light rail\", <i>Energy Policy</i>, vol. 49, pp. 355, 2012.","links":{"crossRefLink":"https://doi.org/10.1016/j.enpol.2012.06.033"},"title":"The impact of electrified transport on local grid infrastructure: A comparison between electric cars and light rail"},{"order":"13","displayText":"Susana Carillo-Aparicio, Juan R. Heredia-Larrubia, Francisco Perez-Hidalgo, \"SmartCity Málaga a real-living lab and its adaptation to electric vehicles in cities\", <i>Energy Policy</i>, vol. 62, pp. 774, 2013.","links":{"crossRefLink":"https://doi.org/10.1016/j.enpol.2013.07.125"},"title":"SmartCity Málaga, a real-living lab and its adaptation to electric vehicles in cities"},{"order":"14","displayText":"Mehdi Rahmani-andebili, Ganesh K. Venayagamoorthy, \"SmartPark placement and operation for improving system reliability and market participation\", <i>Electric Power Systems Research</i>, vol. 123, pp. 21, 2015.","links":{"crossRefLink":"https://doi.org/10.1016/j.epsr.2015.01.016"},"title":"SmartPark placement and operation for improving system reliability and market participation"},{"order":"15","displayText":"Nima H. Tehrani, Peng Wang, \"Probabilistic estimation of plug-in electric vehicles charging load profile\", <i>Electric Power Systems Research</i>, vol. 124, pp. 133, 2015.","links":{"crossRefLink":"https://doi.org/10.1016/j.epsr.2015.03.010"},"title":"Probabilistic estimation of plug-in electric vehicles charging load profile"},{"order":"16","displayText":"Aleksandar Janjic, Lazar Velimirovic, Miomir Stankovic, Andrija Petrusic, \"Commercial electric vehicle fleet scheduling for secondary frequency control\", <i>Electric Power Systems Research</i>, vol. 147, pp. 31, 2017.","links":{"crossRefLink":"https://doi.org/10.1016/j.epsr.2017.02.019"},"title":"Commercial electric vehicle fleet scheduling for secondary frequency control"},{"order":"17","displayText":"Azhar Ul-Haq, Carlo Cecati, Ehab El-Saadany, \"Probabilistic modeling of electric vehicle charging pattern in a residential distribution network\", <i>Electric Power Systems Research</i>, vol. 157, pp. 126, 2018.","links":{"crossRefLink":"https://doi.org/10.1016/j.epsr.2017.12.005"},"title":"Probabilistic modeling of electric vehicle charging pattern in a residential distribution network"},{"order":"18","displayText":"Yassir A. Alhazmi, Haytham A. Mostafa, Magdy M.A. Salama, \"Optimal allocation for electric vehicle charging stations using Trip Success Ratio\", <i>International Journal of Electrical Power & Energy Systems</i>, vol. 91, pp. 101, 2017.","links":{"crossRefLink":"https://doi.org/10.1016/j.ijepes.2017.03.009"},"title":"Optimal allocation for electric vehicle charging stations using Trip Success Ratio"},{"order":"19","displayText":"Amir H. Hajimiragha, Claudio A. Cañizares, Michael W. Fowler, Somayeh Moazeni, Ali Elkamel, Steven Wong, \"Sustainable convergence of electricity and transport sectors in the context of a hydrogen economy\", <i>International Journal of Hydrogen Energy</i>, vol. 36, pp. 6357, 2011.","links":{"crossRefLink":"https://doi.org/10.1016/j.ijhydene.2011.02.070"},"title":"Sustainable convergence of electricity and transport sectors in the context of a hydrogen economy"},{"order":"20","displayText":"Keenan Valentine, Jonathan Acquaviva, E.J. Foster, K. Max Zhang, \"Transmission network-based energy and environmental assessment of plug-in hybrid electric vehicles\", <i>Journal of Power Sources</i>, vol. 196, pp. 3378, 2011.","links":{"crossRefLink":"https://doi.org/10.1016/j.jpowsour.2010.11.110"},"title":"Transmission network-based energy and environmental assessment of plug-in hybrid electric vehicles"},{"order":"21","displayText":"David B. Richardson, \"Electric vehicles and the electric grid: A review of modeling approaches Impacts and renewable energy integration\", <i>Renewable and Sustainable Energy Reviews</i>, vol. 19, pp. 247, 2013.","links":{"crossRefLink":"https://doi.org/10.1016/j.rser.2012.11.042"},"title":"Electric vehicles and the electric grid: A review of modeling approaches, Impacts, and renewable energy integration"},{"order":"22","displayText":"Ehsan Rahimi, Abdorreza Rabiee, Jamshid Aghaei, Kashem M. Muttaqi, Ali Esmaeel Nezhad, \"On the management of wind power intermittency\", <i>Renewable and Sustainable Energy Reviews</i>, vol. 28, pp. 643, 2013.","links":{"crossRefLink":"https://doi.org/10.1016/j.rser.2013.08.034"},"title":"On the management of wind power intermittency"},{"order":"23","displayText":"Zhile Yang, Kang Li, Aoife Foley, \"Computational scheduling methods for integrating plug-in electric vehicles with power systems: A review\", <i>Renewable and Sustainable Energy Reviews</i>, vol. 51, pp. 396, 2015.","links":{"crossRefLink":"https://doi.org/10.1016/j.rser.2015.06.007"},"title":"Computational scheduling methods for integrating plug-in electric vehicles with power systems: A review"},{"order":"24","displayText":"Ilhami Colak, Gianluca Fulli, Sertac Bayhan, Stamatios Chondrogiannis, Sevki Demirbas, \"Critical aspects of wind energy systems in smart grid applications\", <i>Renewable and Sustainable Energy Reviews</i>, vol. 52, pp. 155, 2015.","links":{"crossRefLink":"https://doi.org/10.1016/j.rser.2015.07.062"},"title":"Critical aspects of wind energy systems in smart grid applications"},{"order":"25","displayText":"Jamshid Aghaei, Ali Esmaeel Nezhad, Abdorreza Rabiee, Ehsan Rahimi, \"Contribution of Plug-in Hybrid Electric Vehicles in power system uncertainty management\", <i>Renewable and Sustainable Energy Reviews</i>, vol. 59, pp. 450, 2016.","links":{"crossRefLink":"https://doi.org/10.1016/j.rser.2015.12.207"},"title":"Contribution of Plug-in Hybrid Electric Vehicles in power system uncertainty management"},{"order":"26","displayText":"Hussain Shareef, Md. Mainul Islam, Azah Mohamed, \"A review of the stage-of-the-art charging technologies placement methodologies and impacts of electric vehicles\", <i>Renewable and Sustainable Energy Reviews</i>, vol. 64, pp. 403, 2016.","links":{"crossRefLink":"https://doi.org/10.1016/j.rser.2016.06.033"},"title":"A review of the stage-of-the-art charging technologies, placement methodologies, and impacts of electric vehicles"},{"order":"27","displayText":"N. Shaukat, B. Khan, S.M. Ali, C.A. Mehmood, J. Khan, U. Farid, M. Majid, S.M. Anwar, M. Jawad, Z. Ullah, \"A survey on electric vehicle transportation within smart grid system\", <i>Renewable and Sustainable Energy Reviews</i>, vol. 81, pp. 1329, 2018.","links":{"crossRefLink":"https://doi.org/10.1016/j.rser.2017.05.092"},"title":"A survey on electric vehicle transportation within smart grid system"},{"order":"28","displayText":"Niels Leemput, Frederik Geth, Juan Van Roy, Jeroen Büscher, Johan Driesen, \"Reactive power support in residential LV distribution grids through electric vehicle charging\", <i>Sustainable Energy, Grids and Networks</i>, vol. 3, pp. 24, 2015.","links":{"crossRefLink":"https://doi.org/10.1016/j.segan.2015.05.002"},"title":"Reactive power support in residential LV distribution grids through electric vehicle charging"},{"order":"29","displayText":"Yassir A. Alhazmi, Magdy M.A. Salama, \"Economical staging plan for implementing electric vehicle charging stations\", <i>Sustainable Energy, Grids and Networks</i>, vol. 10, pp. 12, 2017.","links":{"crossRefLink":"https://doi.org/10.1016/j.segan.2017.02.001"},"title":"Economical staging plan for implementing electric vehicle charging stations"},{"order":"30","displayText":"Michael Wolinetz, Jonn Axsen, Jotham Peters, Curran Crawford, \"Simulating the value of electric-vehicle–grid integration using a behaviourally realistic model\", <i>Nature Energy</i>, vol. 3, pp. 132, 2018.","links":{"crossRefLink":"https://doi.org/10.1038/s41560-017-0077-9"},"title":"Simulating the value of electric-vehicle–grid integration using a behaviourally realistic model"}]},"formulaStrippedArticleTitle":"Optimal Transition to Plug-In Hybrid Electric Vehicles in Ontario, Canada, Considering the Electricity-Grid Limitations","nonIeeeCitationCount":"84","contentTypeDisplay":"Journals","patentCitationCount":"0","mlTime":"PT1.650248S","lastupdate":"2021-11-08","title":"Optimal Transition to Plug-In Hybrid Electric Vehicles in Ontario, Canada, Considering the Electricity-Grid Limitations","contentType":"periodicals","ieeeCitationCount":"138","publicationNumber":"41"},{"_id":5129956,"paperCitations":{"ieee":[{"order":"1","displayText":"Zubair Khalid, Salman Durrani, \"Connectivity of three dimensional wireless sensor networks using geometrical probability\", <i>Communications Theory Workshop (AusCTW) 2013 Australian</i>, pp. 47-51, 2013.","links":{"documentLink":"/document/6510043","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6510043","pdfSize":"291KB"},"title":"Connectivity of three dimensional wireless sensor networks using geometrical probability"},{"order":"2","displayText":"Daosen Zhai, Min Sheng, Xijun Wang, Yan Zhang, \"Local connectivity of cognitive radio Ad hoc networks\", <i>Global Communications Conference (GLOBECOM) 2014 IEEE</i>, pp. 1078-1083, 2014.","links":{"documentLink":"/document/7036952","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7036952","pdfSize":"257KB"},"title":"Local connectivity of cognitive radio Ad hoc networks"},{"order":"3","displayText":"Justin P. Coon, Peter J. Smith, \"Topological entropy in wireless networks subject to composite fading\", <i>Communications (ICC) 2017 IEEE International Conference on</i>, pp. 1-7, 2017.","links":{"documentLink":"/document/7996566","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7996566","pdfSize":"340KB"},"title":"Topological entropy in wireless networks subject to composite fading"},{"order":"4","displayText":"Xuran Li, Hong-Ning Dai, Qinglin Zhao, \"An analytical model on eavesdropping attacks in wireless networks\", <i>Communication Systems (ICCS) 2014 IEEE International Conference on</i>, pp. 538-542, 2014.","links":{"documentLink":"/document/7024861","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7024861","pdfSize":"220KB"},"title":"An analytical model on eavesdropping attacks in wireless networks"},{"order":"5","displayText":"Yuanyuan Wang, Qiu Wang, Hong-Ning Dai, Haibo Wang, Zibin Zheng, Jianqing Li, \"On local connectivity of cognitive radio ad hoc networks with directional antennas\", <i>Communication Systems (ICCS) 2016 IEEE International Conference on</i>, pp. 1-6, 2016.","links":{"documentLink":"/document/7833577","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7833577","pdfSize":"359KB"},"title":"On local connectivity of cognitive radio ad hoc networks with directional antennas"},{"order":"6","displayText":"Huiwen Xu, Hong-Ning Dai, Qinglin Zhao, \"On the connectivity of wireless networks with multiple directional antennas\", <i>Networks (ICON) 2012 18th IEEE International Conference on</i>, pp. 155-160, 2012.","links":{"documentLink":"/document/6506551","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6506551","pdfSize":"254KB"},"title":"On the connectivity of wireless networks with multiple directional antennas"},{"order":"7","displayText":"Le The Dung, Tran Dinh Hieu, Beongku An, Byung-Seo Kim, \"How Does Beamforming Influence the Connectivity of Cognitive Radio Ad-Hoc Networks?\", <i>Computer Consumer and Control (IS3C) 2016 International Symposium on</i>, pp. 227-230, 2016.","links":{"documentLink":"/document/7545178","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7545178","pdfSize":"776KB"},"title":"How Does Beamforming Influence the Connectivity of Cognitive Radio Ad-Hoc Networks?"},{"order":"8","displayText":"Justin P. Coon, Carl P. Dettmann, \"On the Connectivity of 2-D Random Networks with Anisotropically Radiating Nodes\", <i>Communications Letters IEEE</i>, vol. 17, no. 2, pp. 321-324, 2013.","links":{"documentLink":"/document/6397543","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6397543","pdfSize":"139KB"},"title":"On the Connectivity of 2-D Random Networks with Anisotropically Radiating Nodes"},{"order":"9","displayText":"Orestis Georgiou, Camly Nguyen, \"Multihop Connectivity of Ad Hoc Networks With Randomly Oriented Directional Antennas\", <i>Wireless Communications Letters IEEE</i>, vol. 4, no. 4, pp. 369-372, 2015.","links":{"documentLink":"/document/7084129","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7084129","pdfSize":"334KB"},"title":"Multihop Connectivity of Ad Hoc Networks With Randomly Oriented Directional Antennas"},{"order":"10","displayText":"Qiu Wang, Hong-Ning Dai, Qinglin Zhao, \"Connectivity of Wireless Ad Hoc Networks: Impacts of Antenna Models\", <i>Parallel and Distributed Computing Applications and Technologies (PDCAT) 2013 International Conference on</i>, pp. 298-303, 2013.","links":{"documentLink":"/document/6904270","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6904270","pdfSize":"728KB"},"title":"Connectivity of Wireless Ad Hoc Networks: Impacts of Antenna Models"},{"order":"11","displayText":"Yuanyuan Wang, Hong-Ning Dai, Qiu Wang, Xuran Li, Qinglin Zhao, Chak Fong Cheang, \"Local connectivity of wireless networks with directional antennas\", <i>Personal Indoor and Mobile Radio Communications (PIMRC) 2015 IEEE 26th Annual International Symposium on</i>, pp. 1481-1486, 2015.","links":{"documentLink":"/document/7343532","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7343532","pdfSize":"558KB"},"title":"Local connectivity of wireless networks with directional antennas"},{"order":"12","displayText":"Zubair Khalid, Salman Durrani, Jing Guo, \"A Tractable Framework for Exact Probability of Node Isolation and Minimum Node Degree Distribution in Finite Multihop Networks\", <i>Vehicular Technology IEEE Transactions on</i>, vol. 63, no. 6, pp. 2836-2847, 2014.","links":{"documentLink":"/document/6678301","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6678301","pdfSize":"1544KB"},"title":"A Tractable Framework for Exact Probability of Node Isolation and Minimum Node Degree Distribution in Finite Multihop Networks"},{"order":"13","displayText":"Orestis Georgiou, Carl P. Dettmann, Justin P. Coon, \"Connectivity of Confined 3D Networks With Anisotropically Radiating Nodes\", <i>Wireless Communications IEEE Transactions on</i>, vol. 13, no. 8, pp. 4534-4546, 2014.","links":{"documentLink":"/document/6779688","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6779688","pdfSize":"1186KB"},"title":"Connectivity of Confined 3D Networks With Anisotropically Radiating Nodes"},{"order":"14","displayText":"Qiu Wang, Hong-Ning Dai, Qinglin Zhao, \"Eavesdropping security in wireless ad hoc networks with directional antennas\", <i>Wireless and Optical Communication Conference (WOCC) 2013 22nd</i>, pp. 687-692, 2013.","links":{"documentLink":"/document/6676462","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6676462","pdfSize":"203KB"},"title":"Eavesdropping security in wireless ad hoc networks with directional antennas"},{"order":"15","displayText":"Qiu Wang, Hong-Ning Dai, Orestis Georgiou, Zhiguo Shi, Wei Zhang, \"Connectivity of Underlay Cognitive Radio Networks With Directional Antennas\", <i>Vehicular Technology IEEE Transactions on</i>, vol. 67, no. 8, pp. 7003-7017, 2018.","links":{"documentLink":"/document/8334605","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8334605","pdfSize":"1805KB"},"title":"Connectivity of Underlay Cognitive Radio Networks With Directional Antennas"},{"order":"16","displayText":"Le The Dung, Hoa T. K. Tran, Seong-Gon Choi, \"Connectivity of Wireless Multi-hop Stochastic Networks under the Security Constraints in Rayleigh Fading Environment\", <i>Advanced Communication Technology (ICACT) 2020 22nd International Conference on</i>, pp. 24-28, 2020.","links":{"documentLink":"/document/9061415","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=9061415","pdfSize":"360KB"},"title":"Connectivity of Wireless Multi-hop Stochastic Networks under the Security Constraints in Rayleigh Fading Environment"}],"nonIeee":[{"order":"1","displayText":"A.V. Babu, V.K. Muhammed Ajeer, \"Analytical model for connectivity of vehicular ad hoc networks in the presence of channel randomness\", <i>International Journal of Communication Systems</i>, vol. 26, pp. 927, 2013.","links":{"crossRefLink":"https://doi.org/10.1002/dac.1379"},"title":"Analytical model for connectivity of vehicular ad hoc networks in the presence of channel randomness"},{"order":"2","displayText":"Qiu Wang, Hong-Ning Dai, Chak Cheang, Hao Wang, \"Link Connectivity and Coverage of Underwater Cognitive Acoustic Networks under Spectrum Constraint\", <i>Sensors</i>, vol. 17, pp. 2839, 2017.","links":{"crossRefLink":"https://doi.org/10.3390/s17122839"},"title":"Link Connectivity and Coverage of Underwater Cognitive Acoustic Networks under Spectrum Constraint"},{"order":"3","displayText":"Yuanyuan Wang, Qiu Wang, Hong-Ning Dai, Haibo Wang, Zhiguo Shi, \"Connectivity of cognitive radio ad hoc networks with directional antennas\", <i>Wireless Networks</i>, vol. 24, pp. 3045, 2018.","links":{"crossRefLink":"https://doi.org/10.1007/s11276-017-1523-0"},"title":"Connectivity of cognitive radio ad hoc networks with directional antennas"},{"order":"4","displayText":"Hoang Thi Huyen Trang, Le The Dung, Seong Oun Hwang, \"Connectivity Analysis of Underground Sensors in Wireless Underground Sensor Networks\", <i>Ad Hoc Networks</i>, 2018.","links":{"crossRefLink":"https://doi.org/10.1016/j.adhoc.2018.01.002"},"title":"Connectivity Analysis of Underground Sensors in Wireless Underground Sensor Networks"},{"order":"5","displayText":"Xuran Li, Jianlong Xu, Hong-Ning Dai, Qinglin Zhao, Chak Fong Cheang, Qiu Wang, \"On modeling eavesdropping attacks in wireless networks\", <i>Journal of Computational Science</i>, vol. 11, pp. 196, 2015.","links":{"crossRefLink":"https://doi.org/10.1016/j.jocs.2014.10.006"},"title":"On modeling eavesdropping attacks in wireless networks"},{"order":"6","displayText":"Le The Dung, Tran Dinh Hieu, Seong-Gon Choi, \"Simulation modeling and analysis of the hop count distribution in cognitive radio ad-hoc networks with shadow fading\", <i>Simulation Modelling Practice and Theory</i>, vol. 69, pp. 43, 2016.","links":{"crossRefLink":"https://doi.org/10.1016/j.simpat.2016.09.003"},"title":"Simulation modeling and analysis of the hop count distribution in cognitive radio ad-hoc networks with shadow fading"},{"order":"7","displayText":"Le The Dung, Seong-Gon Choi, \"Simulation modeling and analysis of the hop count distribution in cognitive radio ad-hoc networks with beamforming\", <i>Simulation Modelling Practice and Theory</i>, vol. 84, pp. 1, 2018.","links":{"crossRefLink":"https://doi.org/10.1016/j.simpat.2018.01.003"},"title":"Simulation modeling and analysis of the hop count distribution in cognitive radio ad-hoc networks with beamforming"},{"order":"8","displayText":"Neelakantan Pattathil Chandrasekharamenon, Babu AnchareV, \"Connectivity analysis of one-dimensional vehicular ad hoc networks in fading channels\", <i>EURASIP Journal on Wireless Communications and Networking</i>, vol. 2012, 2012.","links":{"crossRefLink":"https://doi.org/10.1186/1687-1499-2012-1"},"title":"Connectivity analysis of one-dimensional vehicular ad hoc networks in fading channels"},{"order":"9","displayText":"Qiu Wang, Hong-Ning Dai, Zibin Zheng, Muhammad Imran, Athanasios Vasilakos, \"On Connectivity of Wireless Sensor Networks with Directional Antennas\", <i>Sensors</i>, vol. 17, pp. 134, 2017.","links":{"crossRefLink":"https://doi.org/10.3390/s17010134"},"title":"On Connectivity of Wireless Sensor Networks with Directional Antennas"},{"order":"10","displayText":"Le Dung, Tran Hieu, Seong-Gon Choi, Byung-Seo Kim, Beongku An, \"Impact of Beamforming on the Path Connectivity in Cognitive Radio Ad Hoc Networks\", <i>Sensors</i>, vol. 17, pp. 690, 2017.","links":{"crossRefLink":"https://doi.org/10.3390/s17040690"},"title":"Impact of Beamforming on the Path Connectivity in Cognitive Radio Ad Hoc Networks"},{"order":"11","displayText":"Le The Dung, Beongku An, \"A modeling framework for supporting and evaluating connectivity in cognitive radio ad hoc networks with beamforming\", <i>Wireless Networks</i>, 2016.","links":{"crossRefLink":"https://doi.org/10.1007/s11276-016-1252-9"},"title":"A modeling framework for supporting and evaluating connectivity in cognitive radio ad hoc networks with beamforming"},{"order":"12","displayText":"Le Dung, Seong-Gon Choi, \"Connectivity Analysis of Cognitive Radio Ad-Hoc Networks with Multi-Pair Primary Networks\", <i>Sensors</i>, vol. 19, pp. 565, 2019.","links":{"crossRefLink":"https://doi.org/10.3390/s19030565"},"title":"Connectivity Analysis of Cognitive Radio Ad-Hoc Networks with Multi-Pair Primary Networks"},{"order":"13","displayText":"Mohammed Zaki Hasan, Hussain Al-Rizzo, \"Beamforming Optimization in Internet of Things Applications Using Robust Swarm Algorithm in Conjunction with Connectable and Collaborative Sensors\", <i>Sensors</i>, vol. 20, pp. 2048, 2020.","links":{"crossRefLink":"https://doi.org/10.3390/s20072048"},"title":"Beamforming Optimization in Internet of Things Applications Using Robust Swarm Algorithm in Conjunction with Connectable and Collaborative Sensors"}]},"formulaStrippedArticleTitle":"Connectivity Analysis of Wireless Ad Hoc Networks With Beamforming","nonIeeeCitationCount":"13","contentTypeDisplay":"Journals","patentCitationCount":"0","mlTime":"PT0.323361S","lastupdate":"2021-11-07","title":"Connectivity Analysis of Wireless Ad Hoc Networks With Beamforming","contentType":"periodicals","ieeeCitationCount":"16","publicationNumber":"25"},{"_id":5129960,"paperCitations":{"ieee":[{"order":"1","displayText":"Chien-Hsing Liao, Chi-Chung Chen, Ing-Jiunn Su, Tai-Kuo Woo, \"A novel FPP-based channel assignment scheme\", <i>Communications (APCC) 2015 21st Asia-Pacific Conference on</i>, pp. 375-379, 2015.","links":{"documentLink":"/document/7412543","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7412543","pdfSize":"290KB"},"title":"A novel FPP-based channel assignment scheme"},{"order":"2","displayText":"Zakhia Abichar, J. Morris Chang, \"Group-Based Medium Access Control for IEEE 802.11n Wireless LANs\", <i>Mobile Computing IEEE Transactions on</i>, vol. 12, no. 2, pp. 304-317, 2013.","links":{"documentLink":"/document/6104056","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=6104056","pdfSize":"1019KB"},"title":"Group-Based Medium Access Control for IEEE 802.11n Wireless LANs"},{"order":"3","displayText":"Mohamed Elkourdi, Asim Mazin, Richard D. Gitlin, \"Slotted Aloha-NOMA with MIMO Beamforming for Massive M2M Communication in IoT Networks\", <i>Vehicular Technology Conference (VTC-Fall) 2018 IEEE 88th</i>, pp. 1-5, 2018.","links":{"documentLink":"/document/8690976","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8690976","pdfSize":"411KB"},"title":"Slotted Aloha-NOMA with MIMO Beamforming for Massive M2M Communication in IoT Networks"}],"nonIeee":[{"order":"1","displayText":"Vicente Milanés, Joshué Pérez, Jorge Godoy, Enrique Onieva, \"A fuzzy aid rear-end collision warning/avoidance system\", <i>Expert Systems with Applications</i>, vol. 39, pp. 9097, 2012.","links":{"crossRefLink":"https://doi.org/10.1016/j.eswa.2012.02.054"},"title":"A fuzzy aid rear-end collision warning/avoidance system"},{"order":"2","displayText":"Abduladhim Ashtaiwi, Ahmed Iyanda Sulyman, Hossam S. Hassanein, \"IEEE 802.11 medium access control enhancements based on simultaneous multiple-input multiple-output bandwidth sharing\", <i>Wireless Communications and Mobile Computing</i>, vol. 14, pp. 339, 2014.","links":{"crossRefLink":"https://doi.org/10.1002/wcm.1252"},"title":"IEEE 802.11 medium access control enhancements based on simultaneous multiple-input multiple-output bandwidth sharing"},{"order":"3","displayText":"Soma Umamaheshwar, Kommabatla Mahender, Maisagalla Gopal, \"Novel Hybrid MIMO Detector for Spatial Multiplexed MIMO System\", <i>IOP Conference Series: Materials Science and Engineering</i>, vol. 981, pp. 032039, 2020.","links":{"crossRefLink":"https://doi.org/10.1088/1757-899X/981/3/032039"},"title":"Novel Hybrid MIMO Detector for Spatial Multiplexed MIMO System"}]},"formulaStrippedArticleTitle":"MIMO-Based Collision Avoidance in IEEE 802.11e Networks","nonIeeeCitationCount":"3","contentTypeDisplay":"Journals","patentCitationCount":"0","mlTime":"PT0.070509S","lastupdate":"2021-10-15","title":"MIMO-Based Collision Avoidance in IEEE 802.11e Networks","contentType":"periodicals","ieeeCitationCount":"3","publicationNumber":"25"}]