[{"_id":7683978,"paperCitations":{"ieee":[{"order":"1","displayText":"Suh Joon Han, Jerker Kjellqvist, \"High salinity wet electrical ageing behavior of polyolefin blends\", <i>Electrical Insulation Conference (EIC) 2017 IEEE</i>, pp. 116-118, 2017.","links":{"documentLink":"/document/8004664","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8004664","pdfSize":"629KB"},"title":"High salinity wet electrical ageing behavior of polyolefin blends"},{"order":"2","displayText":"Xiantao Tao, Hua Li, Fuchang Lin, Jingyun Tu, \"Crystalline Destruction Caused by Water Tree Growth in Low-density Polyethylene\", <i>Dielectrics and Electrical Insulation IEEE Transactions on</i>, vol. 28, no. 1, pp. 167-174, 2021.","links":{"documentLink":"/document/9351863","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=9351863","pdfSize":"2120KB"},"title":"Crystalline Destruction Caused by Water Tree Growth in Low-density Polyethylene"}]},"formulaStrippedArticleTitle":"Properties of water treed and non-treed XLPE cable insulation","nonIeeeCitationCount":"0","contentTypeDisplay":"Conferences","patentCitationCount":"0","mlTime":"PT0.063977S","lastupdate":"2021-10-11","title":"Properties of water treed and non-treed XLPE cable insulation","contentType":"conferences","ieeeCitationCount":"2","publicationNumber":"7683954"},{"_id":7684062,"paperCitations":{"ieee":[{"order":"1","displayText":"Ivan Fateev, Valeri Timoshenkov, \"Highly reliable SEE hardened clock gating cells\", <i>Young Researchers in Electrical and Electronic Engineering (EIConRus) 2018 IEEE Conference of Russian</i>, pp. 1356-1359, 2018.","links":{"documentLink":"/document/8317348","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8317348","pdfSize":"223KB"},"title":"Highly reliable SEE hardened clock gating cells"},{"order":"2","displayText":"Qian He, Aibin Yan, Chaoping Lai, Yinlei Zhang, Chunming Liu, Zhile Chen, Zhen Wu, Jie Cui, Huaguo Liang, \"Novel low cost and DNU online self-recoverable RHBD latch design for nanoscale CMOS\", <i>Circuits and Systems (ISCAS) 2018 IEEE International Symposium on</i>, pp. 1-5, 2018.","links":{"documentLink":"/document/8351008","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8351008","pdfSize":"399KB"},"title":"Novel low cost and DNU online self-recoverable RHBD latch design for nanoscale CMOS"},{"order":"3","displayText":"Yuta Yamamoto, Kazuteru Namba, \"Construction of Latch Design with Complete Double Node Upset Tolerant Capability Using C-Element\", <i>Defect and Fault Tolerance in VLSI and Nanotechnology Systems (DFT) 2018 IEEE International Symposium on</i>, pp. 1-6, 2018.","links":{"documentLink":"/document/8602841","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8602841","pdfSize":"764KB"},"title":"Construction of Latch Design with Complete Double Node Upset Tolerant Capability Using C-Element"},{"order":"4","displayText":"Aibin Yan, Zhen Wu, Jing Guo, Jie Song, Xiaoqing Wen, \"Novel Double-Node-Upset-Tolerant Memory Cell Designs Through Radiation-Hardening-by-Design and Layout\", <i>Reliability IEEE Transactions on</i>, vol. 68, no. 1, pp. 354-363, 2019.","links":{"documentLink":"/document/8537998","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8537998","pdfSize":"1969KB"},"title":"Novel Double-Node-Upset-Tolerant Memory Cell Designs Through Radiation-Hardening-by-Design and Layout"},{"order":"5","displayText":"Xin Liu, \"Multiple Node Upset-Tolerant Latch Design\", <i>Device and Materials Reliability IEEE Transactions on</i>, vol. 19, no. 2, pp. 387-392, 2019.","links":{"documentLink":"/document/8695822","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8695822","pdfSize":"1278KB"},"title":"Multiple Node Upset-Tolerant Latch Design"},{"order":"6","displayText":"Aibin Yan, Zhile Chen, Zhengfeng Huang, Xiangsheng Fang, Maoxiang Yi, Jing Guo, \"Radiation Hardening by Design of a Novel Double-Node-Upset-Tolerant Latch Combined with Layout Technique\", <i>Test Conference in Asia (ITC-Asia) 2018 IEEE International</i>, pp. 49-54, 2018.","links":{"documentLink":"/document/8462947","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8462947","pdfSize":"1202KB"},"title":"Radiation Hardening by Design of a Novel Double-Node-Upset-Tolerant Latch Combined with Layout Technique"},{"order":"7","displayText":"Aibin Yan, Jun Zhou, Yuanjie Hu, Jie Cui, Zhengfeng Huang, Patrick Girard, Xiaoqing Wen, \"Novel Quadruple Cross-Coupled Memory Cell Designs With Protection Against Single Event Upsets and Double-Node Upsets\", <i>Access IEEE</i>, vol. 7, pp. 176188-176196, 2019.","links":{"documentLink":"/document/8926454","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8926454","pdfSize":"5415KB"},"title":"Novel Quadruple Cross-Coupled Memory Cell Designs With Protection Against Single Event Upsets and Double-Node Upsets"},{"order":"8","displayText":"Aibin Yan, Zhen Wu, Lu Lu, Zhili Chen, Jie Song, Zuobin Ying, Patrick Girard, Xiaoqing Wen, \"Novel Radiation Hardened Latch Design with Cost-Effectiveness for Safety-Critical Terrestrial Applications\", <i>Asian Test Symposium (ATS) 2019 IEEE 28th</i>, pp. 43-435, 2019.","links":{"documentLink":"/document/8949419","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8949419","pdfSize":"491KB"},"title":"Novel Radiation Hardened Latch Design with Cost-Effectiveness for Safety-Critical Terrestrial Applications"},{"order":"9","displayText":"Aibin Yan, Yuanjie Hu, Jie Cui, Zhili Chen, Zhengfeng Huang, Tianming Ni, Patrick Girard, Xiaoqing Wen, \"Information Assurance Through Redundant Design: A Novel TNU Error-Resilient Latch for Harsh Radiation Environment\", <i>Computers IEEE Transactions on</i>, vol. 69, no. 6, pp. 789-799, 2020.","links":{"documentLink":"/document/8960475","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8960475","pdfSize":"1398KB"},"title":"Information Assurance Through Redundant Design: A Novel TNU Error-Resilient Latch for Harsh Radiation Environment"},{"order":"10","displayText":"Adam Watkins, Spyros Tragoudas, \"Radiation Hardened Latch Designs for Double and Triple Node Upsets\", <i>Emerging Topics in Computing IEEE Transactions on</i>, vol. 8, no. 3, pp. 616-626, 2020.","links":{"documentLink":"/document/8118119","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8118119","pdfSize":"2243KB"},"title":"Radiation Hardened Latch Designs for Double and Triple Node Upsets"}],"nonIeee":[{"order":"1","displayText":"Kazuteru NAMBA, \"Master-Slave FF Using DICE Capable of Tolerating Soft Errors Occurring Around Clock Edge\", <i>IEICE Transactions on Information and Systems</i>, vol. E103.D, pp. 892, 2020.","links":{"crossRefLink":"https://doi.org/10.1587/transinf.2019EDL8175"},"title":"Master-Slave FF Using DICE Capable of Tolerating Soft Errors Occurring Around Clock Edge"},{"order":"2","displayText":"Yuta YAMAMOTO, Kazuteru NAMBA, \"Complete Double Node Upset Tolerant Latch Using C-Element\", <i>IEICE Transactions on Information and Systems</i>, vol. E103.D, pp. 2125, 2020.","links":{"crossRefLink":"https://doi.org/10.1587/transinf.2020EDP7103"},"title":"Complete Double Node Upset Tolerant Latch Using C-Element"},{"order":"3","displayText":"Aibin Yan, Aoran Cao, Zhelong Xu, Jie Cui, Tianming Ni, Patrick Girard, Xiaoqing Wen, \"Design of Radiation Hardened Latch and Flip-Flop with Cost-Effectiveness for Low-Orbit Aerospace Applications\", <i>Journal of Electronic Testing</i>, 2021.","links":{"crossRefLink":"https://doi.org/10.1007/s10836-021-05962-0"},"title":"Design of Radiation Hardened Latch and Flip-Flop with Cost-Effectiveness for Low-Orbit Aerospace Applications"},{"order":"4","displayText":"Zhengfeng Huang, Xiandong Li, Zhouyu Gong, Huaguo Liang, Yingchun Lu, Yiming Ouyang, Tianming Ni, \"Design of MNU-Resilient latches based on input-split C-elements\", <i>Microelectronics Journal</i>, pp. 105243, 2021.","links":{"crossRefLink":"https://doi.org/10.1016/j.mejo.2021.105243"},"title":"Design of MNU-Resilient latches based on input-split C-elements"},{"order":"5","displayText":"Hui Xu, Le Zhou, Huaguo Liang, Zhengfeng Huang, Cong Sun, Yafei Ning, \"High-Performance Double-Node-Upset-Tolerant and Triple-Node-Upset-Tolerant Latch Designs\", <i>Electronics</i>, vol. 10, pp. 2515, 2021.","links":{"crossRefLink":"https://doi.org/10.3390/electronics10202515"},"title":"High-Performance Double-Node-Upset-Tolerant and Triple-Node-Upset-Tolerant Latch Designs"}]},"formulaStrippedArticleTitle":"A Highly Robust Double Node Upset Tolerant latch","nonIeeeCitationCount":"5","contentTypeDisplay":"Conferences","patentCitationCount":"0","mlTime":"PT0.197213S","lastupdate":"2021-10-19","title":"A Highly Robust Double Node Upset Tolerant latch","contentType":"conferences","ieeeCitationCount":"10","publicationNumber":"7590261"},{"_id":7684063,"paperCitations":{"ieee":[{"order":"1","displayText":"Alexander Schöll, Claus Braun, Hans-Joachim Wunderlich, \"Energy-efficient and error-resilient iterative solvers for approximate computing\", <i>On-Line Testing and Robust System Design (IOLTS) 2017 IEEE 23rd International Symposium on</i>, pp. 237-239, 2017.","links":{"documentLink":"/document/8046244","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8046244","pdfSize":"196KB"},"title":"Energy-efficient and error-resilient iterative solvers for approximate computing"},{"order":"2","displayText":"Ilia Polian, \"Test and Reliability Challenges for Approximate Circuitry\", <i>Embedded Systems Letters IEEE</i>, vol. 10, no. 1, pp. 26-29, 2018.","links":{"documentLink":"/document/8046053","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8046053","pdfSize":"289KB"},"title":"Test and Reliability Challenges for Approximate Circuitry"},{"order":"3","displayText":"Michael Lass, Thomas D. Kühne, Christian Plessl, \"Using Approximate Computing for the Calculation of Inverse Matrix  $p$ th Roots\", <i>Embedded Systems Letters IEEE</i>, vol. 10, no. 2, pp. 33-36, 2018.","links":{"documentLink":"/document/8062784","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8062784","pdfSize":"639KB"},"title":"Using Approximate Computing for the Calculation of Inverse Matrix  $p$ th Roots"}],"nonIeee":[{"order":"1","displayText":"Michael Bromberger, Markus Hoffmann, Robin Rehrmann, <i>Architecture of Computing Systems – ARCS 2018</i>, vol. 10793, pp. 297, 2018.","links":{"crossRefLink":"https://doi.org/10.1007/978-3-319-77610-1_22"},"title":""}]},"formulaStrippedArticleTitle":"Applying efficient fault tolerance to enable the preconditioned conjugate gradient solver on approximate computing hardware","nonIeeeCitationCount":"1","contentTypeDisplay":"Conferences","patentCitationCount":"0","mlTime":"PT0.049237S","lastupdate":"2021-09-19","title":"Applying efficient fault tolerance to enable the preconditioned conjugate gradient solver on approximate computing hardware","contentType":"conferences","ieeeCitationCount":"3","publicationNumber":"7590261"},{"_id":7684069,"paperCitations":{"ieee":[{"order":"1","displayText":"Biao Hu, Zhengcai Cao, \"Minimizing Resource Consumption Cost of DAG Applications With Reliability Requirement on Heterogeneous Processor Systems\", <i>Industrial Informatics IEEE Transactions on</i>, vol. 16, no. 12, pp. 7437-7447, 2020.","links":{"documentLink":"/document/8931023","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8931023","pdfSize":"1103KB"},"title":"Minimizing Resource Consumption Cost of DAG Applications With Reliability Requirement on Heterogeneous Processor Systems"}],"nonIeee":[{"order":"1","displayText":"Hananeh Aliee, Emanuele Borgonovo, Michael Glaß, Jürgen Teich, \"On the Boolean extension of the Birnbaum importance to non-coherent systems\", <i>Reliability Engineering & System Safety</i>, vol. 160, pp. 191, 2017.","links":{"crossRefLink":"https://doi.org/10.1016/j.ress.2016.12.013"},"title":"On the Boolean extension of the Birnbaum importance to non-coherent systems"},{"order":"2","displayText":"Fedor Smirnov, Behnaz Pourmohseni, Michael Glaß, Jürgen Teich, \"IGOR Get Me the Optimum! Prioritizing Important Design Decisions During the DSE of Embedded Systems\", <i>ACM Transactions on Embedded Computing Systems</i>, vol. 18, pp. 1, 2019.","links":{},"title":"IGOR, Get Me the Optimum! Prioritizing Important Design Decisions During the DSE of Embedded Systems"}]},"formulaStrippedArticleTitle":"Guiding Genetic Algorithms using importance measures for reliable design of embedded systems","nonIeeeCitationCount":"2","contentTypeDisplay":"Conferences","patentCitationCount":"0","mlTime":"PT0.059371S","lastupdate":"2021-12-11","title":"Guiding Genetic Algorithms using importance measures for reliable design of embedded systems","contentType":"conferences","ieeeCitationCount":"1","publicationNumber":"7590261"},{"_id":7684073,"formulaStrippedArticleTitle":"Low cost resilient regular expression matching on FPGAs","paperCitations":{"ieee":[{"order":"1","displayText":"Wenming Li, Xiaochun Ye, Da Wang, Hao Zhang, Dongdong Wu, Zhimin Zhang, Dongrui Fan, \"WEAVER: An Energy Efficient General-Purpose Acceleration Architecture for String Operations in Big Data Applications\", <i>Parallel & Distributed Processing with Applications Ubiquitous Computing & Communications Big Data & Cloud Computing Social Computing & Networking Sustainable Computing & Communications (ISPA/IUCC/BDCloud/SocialCom/SustainCom) 2018 IEEE Intl Con</i>, pp. 47-54, 2018.","links":{"documentLink":"/document/8672255","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8672255","pdfSize":"452KB"},"title":"WEAVER: An Energy Efficient, General-Purpose Acceleration Architecture for String Operations in Big Data Applications"}],"nonIeee":[{"order":"1","displayText":"Marcos T. Leipnitz, Gabriel L. Nazar, \"Fault Tolerance Mechanisms for FPGA-Based Regular Expression Matching\", <i>Journal of Electronic Testing</i>, 2018.","links":{"crossRefLink":"https://doi.org/10.1007/s10836-018-5736-7"},"title":"Fault Tolerance Mechanisms for FPGA-Based Regular Expression Matching"},{"order":"2","displayText":"Wenming Li, Xiaochun Ye, Da Wang, Hao Zhang, Zhimin Tang, Dongrui Fan, Ninghui Sun, \"PIM-WEAVER: A High Energy-efficient General-purpose Acceleration Architecture for String Operations in Big Data Processing\", <i>Sustainable Computing: Informatics and Systems</i>, vol. 21, pp. 129, 2019.","links":{"crossRefLink":"https://doi.org/10.1016/j.suscom.2019.01.006"},"title":"PIM-WEAVER: A High Energy-efficient, General-purpose Acceleration Architecture for String Operations in Big Data Processing"}]},"nonIeeeCitationCount":"2","contentTypeDisplay":"Conferences","patentCitationCount":"0","mlTime":"PT0.087737S","lastupdate":"2021-10-11","title":"Low cost resilient regular expression matching on FPGAs","contentType":"conferences","ieeeCitationCount":"1","publicationNumber":"7590261"},{"_id":7684074,"paperCitations":{"nonIeee":[{"order":"1","displayText":"Wang Guohua, Tian Congsheng, Luo Dongming, \"An online fault injection method for the dynamic partial reconfiguration system based on a lightweight ICAP controller\", <i>IEICE Electronics Express</i>, vol. 15, pp. 20180720, 2018.","links":{"crossRefLink":"https://doi.org/10.1587/elex.15.20180720"},"title":"An online fault injection method for the dynamic partial reconfiguration system based on a lightweight ICAP controller"}]},"formulaStrippedArticleTitle":"In-place LUT polarity inVersion to mitigate soft errors for FPGAs","nonIeeeCitationCount":"1","contentTypeDisplay":"Conferences","patentCitationCount":"0","mlTime":"PT0.022926S","lastupdate":"2021-10-11","title":"In-place LUT polarity inVersion to mitigate soft errors for FPGAs","contentType":"conferences","ieeeCitationCount":"0","publicationNumber":"7590261"},{"_id":7684076,"paperCitations":{"ieee":[{"order":"1","displayText":"Athanasios Chatzidimitriou, Manolis Kaliorakis, Dimitris Gizopoulos, Maurizio Iacaruso, Mauro Pipponzi, Riccardo Mariani, Stefano Di Carlo, \"RT Level vs. Microarchitecture-Level Reliability Assessment: Case Study on ARM(R) Cortex(R)-A9 CPU\", <i>Dependable Systems and Networks Workshop (DSN-W) 2017 47th Annual IEEE/IFIP International Conference on</i>, pp. 117-120, 2017.","links":{"documentLink":"/document/8023713","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8023713","pdfSize":"199KB"},"title":"RT Level vs. Microarchitecture-Level Reliability Assessment: Case Study on ARM(R) Cortex(R)-A9 CPU"},{"order":"2","displayText":"Thierry Bonnoit, Alexandre Coelho, Nacer-Eddine Zergainoh, Raoul Velazco, \"SEU impact in processor's control-unit: Preliminary results obtained for LEON3 soft-core\", <i>Test Symposium (LATS) 2017 18th IEEE Latin American</i>, pp. 1-4, 2017.","links":{"documentLink":"/document/7906763","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7906763","pdfSize":"554KB"},"title":"SEU impact in processor's control-unit: Preliminary results obtained for LEON3 soft-core"},{"order":"3","displayText":"Xabier Iturbe, Balaji Venu, John Penton, Emre Ozer, \"Work-in-progress: a “high resilience” mode to minimize so\u0081 error vulnerabilities in ARM cortex-R CPU pipelines\", <i>Compilers Architectures and Synthesis For Embedded Systems (CASES) 2017 International Conference on</i>, pp. 1-2, 2017.","links":{"documentLink":"/document/8094843","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8094843","pdfSize":"426KB"},"title":"Work-in-progress: a “high resilience” mode to minimize so\u0081 error vulnerabilities in ARM cortex-R CPU pipelines"},{"order":"4","displayText":"Xabier Iturbe, Balaji Venu, Juergen Jagst, Emre Ozer, Peter Harrod, Chris Turner, John Penton, \"Addressing Functional Safety Challenges in Autonomous Vehicles with the Arm TCL S Architecture\", <i>Design & Test IEEE</i>, vol. 35, no. 3, pp. 7-14, 2018.","links":{"documentLink":"/document/8272372","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8272372","pdfSize":"276KB"},"title":"Addressing Functional Safety Challenges in Autonomous Vehicles with the Arm TCL S Architecture"},{"order":"5","displayText":"Emre Ozer, Balaji Venu, Xabier Iturbe, Shidhartha Das, Spyros Lyberis, John Biggs, Peter Harrod, John Penton, \"Error Correlation Prediction in Lockstep Processors for Safety-Critical Systems\", <i>Microarchitecture (MICRO) 2018 51st Annual IEEE/ACM International Symposium on</i>, pp. 737-748, 2018.","links":{"documentLink":"/document/8574582","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8574582","pdfSize":"1138KB"},"title":"Error Correlation Prediction in Lockstep Processors for Safety-Critical Systems"},{"order":"6","displayText":"Karel Szurman, Zdenek Kotasek, \"Run-Time Reconfigurable Fault Tolerant Architecture for Soft-Core Processor NEO430\", <i>Design and Diagnostics of Electronic Circuits & Systems (DDECS) 2019 IEEE 22nd International Symposium on</i>, pp. 1-4, 2019.","links":{"documentLink":"/document/8724636","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8724636","pdfSize":"322KB"},"title":"Run-Time Reconfigurable Fault Tolerant Architecture for Soft-Core Processor NEO430"},{"order":"7","displayText":"Athanasios Chatzidimitriou, Pablo Bodmann, George Papadimitriou, Dimitris Gizopoulos, Paolo Rech, \"Demystifying Soft Error Assessment Strategies on ARM CPUs: Microarchitectural Fault Injection vs. Neutron Beam Experiments\", <i>Dependable Systems and Networks (DSN) 2019 49th Annual IEEE/IFIP International Conference on</i>, pp. 26-38, 2019.","links":{"documentLink":"/document/8809532","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8809532","pdfSize":"938KB"},"title":"Demystifying Soft Error Assessment Strategies on ARM CPUs: Microarchitectural Fault Injection vs. Neutron Beam Experiments"},{"order":"8","displayText":"Ahmet Cagri Bagbaba, Maksim Jenihhin, Jaan Raik, Christian Sauer, \"Efficient Fault Injection based on Dynamic HDL Slicing Technique\", <i>On-Line Testing and Robust System Design (IOLTS ) 2019 IEEE 25th International Symposium on</i>, pp. 52-53, 2019.","links":{"documentLink":"/document/8854419","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8854419","pdfSize":"130KB"},"title":"Efficient Fault Injection based on Dynamic HDL Slicing Technique"},{"order":"9","displayText":"Stefano di Mascio, Alessandra Menicucci, Eberhard Gill, Gianluca Furano, Claudio Monteleone, \"On the Criticality of Caches in Fault-Tolerant Processors for Space\", <i>Defect and Fault Tolerance in VLSI and Nanotechnology Systems (DFT) 2019 IEEE International Symposium on</i>, pp. 1-4, 2019.","links":{"documentLink":"/document/8875424","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8875424","pdfSize":"233KB"},"title":"On the Criticality of Caches in Fault-Tolerant Processors for Space"},{"order":"10","displayText":"Ahmet Cagri Bagbaba, Maksim Jenihhin, Jaan Raik, Christian Sauer, \"Accelerating Transient Fault Injection Campaigns by using Dynamic HDL Slicing\", <i>Nordic Circuits and Systems Conference (NORCAS): NORCHIP and International Symposium of System-on-Chip (SoC) 2019 IEEE</i>, pp. 1-7, 2019.","links":{"documentLink":"/document/8906932","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8906932","pdfSize":"477KB"},"title":"Accelerating Transient Fault Injection Campaigns by using Dynamic HDL Slicing"},{"order":"11","displayText":"Aitzan Sari, Mihalis Psarakis, \"Scrubbing-Aware Placement for Reliable FPGA Systems\", <i>Emerging Topics in Computing IEEE Transactions on</i>, vol. 8, no. 3, pp. 564-576, 2020.","links":{"documentLink":"/document/8053788","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8053788","pdfSize":"2209KB"},"title":"Scrubbing-Aware Placement for Reliable FPGA Systems"},{"order":"12","displayText":"Fernando Fernandes dos Santos, Siva Kumar Sastry Hari, Pedro Martins Basso, Luigi Carro, Paolo Rech, \"Demystifying GPU Reliability: Comparing and Combining Beam Experiments Fault Simulation and Profiling\", <i>Parallel and Distributed Processing Symposium (IPDPS) 2021 IEEE International</i>, pp. 289-298, 2021.","links":{"documentLink":"/document/9460470","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=9460470","pdfSize":"314KB"},"title":"Demystifying GPU Reliability: Comparing and Combining Beam Experiments, Fault Simulation, and Profiling"},{"order":"13","displayText":"Augusto Hoppe, Jürgen Becker, Fernanda Lima Kastensmidt, \"High-speed Hardware Accelerator for Trace Decoding in Real-Time Program Monitoring\", <i>Circuits and System (LASCAS) 2021 IEEE 12th Latin America Symposium on</i>, pp. 1-4, 2021.","links":{"documentLink":"/document/9459137","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=9459137","pdfSize":"251KB"},"title":"High-speed Hardware Accelerator for Trace Decoding in Real-Time Program Monitoring"},{"order":"14","displayText":"George Papadimitriou, Dimitris Gizopoulos, \"Demystifying the System Vulnerability Stack: Transient Fault Effects Across the Layers\", <i>Computer Architecture (ISCA) 2021 ACM/IEEE 48th Annual International Symposium on</i>, pp. 902-915, 2021.","links":{"documentLink":"/document/9499847","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=9499847","pdfSize":"2879KB"},"title":"Demystifying the System Vulnerability Stack: Transient Fault Effects Across the Layers"},{"order":"15","displayText":"Augusto Hoppe, Jürgen Becker, Fernanda Lima Kastensmidt, \"Fine Grained Control Flow Checking with Dedicated FPGA Monitors\", <i>System-on-Chip Conference (SOCC) 2020 IEEE 33rd International</i>, pp. 219-224, 2020.","links":{"documentLink":"/document/9524751","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=9524751","pdfSize":"450KB"},"title":"Fine Grained Control Flow Checking with Dedicated FPGA Monitors"}],"nonIeee":[{"order":"1","displayText":"Xabier Iturbe, Balaji Venu, Emre Ozer, Jean-Luc Poupat, Gregoire Gimenez, Hans-Ulrich Zurek, \"The Arm Triple Core Lock-Step (TCLS) Processor\", <i>ACM Transactions on Computer Systems (TOCS)</i>, vol. 36, pp. 1, 2019.","links":{},"title":"The Arm Triple Core Lock-Step (TCLS) Processor"}]},"formulaStrippedArticleTitle":"Soft error vulnerability assessment of the real-time safety-related ARM Cortex-R5 CPU","nonIeeeCitationCount":"1","contentTypeDisplay":"Conferences","patentCitationCount":"0","mlTime":"PT0.367581S","lastupdate":"2021-10-11","title":"Soft error vulnerability assessment of the real-time safety-related ARM Cortex-R5 CPU","contentType":"conferences","ieeeCitationCount":"15","publicationNumber":"7590261"},{"_id":7684081,"paperCitations":{"ieee":[{"order":"1","displayText":"Amir Charif, Nacer-Eddine Zergainoh, Alexandre Coelho, Michael Nicolaidis, \"Rout3D: A lightweight adaptive routing algorithm for tolerating faulty vertical links in 3D-NoCs\", <i>Test Symposium (ETS) 2017 22nd IEEE</i>, pp. 1-6, 2017.","links":{"documentLink":"/document/7968219","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7968219","pdfSize":"1129KB"},"title":"Rout3D: A lightweight adaptive routing algorithm for tolerating faulty vertical links in 3D-NoCs"},{"order":"2","displayText":"Amir Charif, Alexandre Coelho, Masoumeh Ebrahimi, Nader Bagherzadeh, Nacer-Eddine Zergainoh, \"First-Last: A Cost-Effective Adaptive Routing Solution for TSV-Based Three-Dimensional Networks-on-Chip\", <i>Computers IEEE Transactions on</i>, vol. 67, no. 10, pp. 1430-1444, 2018.","links":{"documentLink":"/document/8333738","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8333738","pdfSize":"1338KB"},"title":"First-Last: A Cost-Effective Adaptive Routing Solution for TSV-Based Three-Dimensional Networks-on-Chip"},{"order":"3","displayText":"Alexandre Coelho, Amir Charif, Nacer-Eddine Zergainoh, Raoul Velazco, \"A Runtime Fault-Tolerant Routing Scheme for Partially Connected 3D Networks-on-Chip\", <i>Defect and Fault Tolerance in VLSI and Nanotechnology Systems (DFT) 2018 IEEE International Symposium on</i>, pp. 1-6, 2018.","links":{"documentLink":"/document/8602971","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8602971","pdfSize":"426KB"},"title":"A Runtime Fault-Tolerant Routing Scheme for Partially Connected 3D Networks-on-Chip"},{"order":"4","displayText":"Alexandre Coelho, Amir Charif, Nacer-Eddine Zergainoh, Raoul Velazco, \"FL-RuNS: A High-Performance and Runtime Reconfigurable Fault-Tolerant Routing Scheme for Partially Connected Three-Dimensional Networks on Chip\", <i>Nanotechnology IEEE Transactions on</i>, vol. 18, pp. 806-818, 2019.","links":{"documentLink":"/document/8782834","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8782834","pdfSize":"3594KB"},"title":"FL-RuNS: A High-Performance and Runtime Reconfigurable Fault-Tolerant Routing Scheme for Partially Connected Three-Dimensional Networks on Chip"},{"order":"5","displayText":"Keerthi Somraj, K. Kishore Kumar, B. Naresh Kumar Reddy, \"A Comparative Analysis of Fault Tolerance Methods in 3D-NoC\", <i>Wireless Communications Signal Processing and Networking (WiSPNET) 2021 Sixth International Conference on</i>, pp. 171-177, 2021.","links":{"documentLink":"/document/9419420","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=9419420","pdfSize":"262KB"},"title":"A Comparative Analysis of Fault Tolerance Methods in 3D-NoC"},{"order":"6","displayText":"Alexandre Almeida Da Silva, Leonel Maia E Silva Junior, Alexandre Coelho, Jarbas Silveira, César Marcon, \"Reflect3d: An Adaptive and Fault-Tolerant Routing Algorithm for Vertically-Partially-Connected 3D-NoC\", <i>Integrated Circuits and Systems Design (SBCCI) 2021 34th SBC/SBMicro/IEEE/ACM Symposium on</i>, pp. 1-6, 2021.","links":{"documentLink":"/document/9529996","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=9529996","pdfSize":"3022KB"},"title":"Reflect3d: An Adaptive and Fault-Tolerant Routing Algorithm for Vertically-Partially-Connected 3D-NoC"}]},"formulaStrippedArticleTitle":"CoBRA: Low cost compensation of TSV failures in 3D-NoC","nonIeeeCitationCount":"0","contentTypeDisplay":"Conferences","patentCitationCount":"0","mlTime":"PT0.156895S","lastupdate":"2021-10-11","title":"CoBRA: Low cost compensation of TSV failures in 3D-NoC","contentType":"conferences","ieeeCitationCount":"6","publicationNumber":"7590261"},{"_id":7684102,"paperCitations":{"ieee":[{"order":"1","displayText":"Yi Wang, Mahmoud M. Amin, Jian Fu, Heba B. Moussa, \"A Novel Data Analytical Approach for False Data Injection Cyber-Physical Attack Mitigation in Smart Grids\", <i>Access IEEE</i>, vol. 5, pp. 26022-26033, 2017.","links":{"documentLink":"/document/8093999","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8093999","pdfSize":"6358KB"},"title":"A Novel Data Analytical Approach for False Data Injection Cyber-Physical Attack Mitigation in Smart Grids"},{"order":"2","displayText":"Shuva Paul, Zhen Ni, \"Vulnerability analysis for simultaneous attack in smart grid security\", <i>Power & Energy Society Innovative Smart Grid Technologies Conference (ISGT) 2017 IEEE</i>, pp. 1-5, 2017.","links":{"documentLink":"/document/8086078","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8086078","pdfSize":"525KB"},"title":"Vulnerability analysis for simultaneous attack in smart grid security"},{"order":"3","displayText":"Youbiao He, Gihan J. Mendis, Jin Wei, \"Real-Time Detection of False Data Injection Attacks in Smart Grid: A Deep Learning-Based Intelligent Mechanism\", <i>Smart Grid IEEE Transactions on</i>, vol. 8, no. 5, pp. 2505-2516, 2017.","links":{"documentLink":"/document/7926429","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7926429","pdfSize":"1782KB"},"title":"Real-Time Detection of False Data Injection Attacks in Smart Grid: A Deep Learning-Based Intelligent Mechanism"},{"order":"4","displayText":"Ibtihaj Ahmad, Muhammad Kaab Zarrar, Takreem Saeed, Saad Rehman, \"Security Aspects of Cyber Physical Systems\", <i>Computer Applications & Information Security (ICCAIS) 2018 1st International Conference on</i>, pp. 1-6, 2018.","links":{"documentLink":"/document/8442009","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8442009","pdfSize":"393KB"},"title":"Security Aspects of Cyber Physical Systems"},{"order":"5","displayText":"Mohammad Ashrafuzzaman, Yacine Chakhchoukh, Ananth A. Jillepalli, Predrag T. Tosic, Daniel Conte de Leon, Frederick T. Sheldon, Brian K. Johnson, \"Detecting Stealthy False Data Injection Attacks in Power Grids Using Deep Learning\", <i>Wireless Communications & Mobile Computing Conference (IWCMC) 2018 14th International</i>, pp. 219-225, 2018.","links":{"documentLink":"/document/8450487","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8450487","pdfSize":"1782KB"},"title":"Detecting Stealthy False Data Injection Attacks in Power Grids Using Deep Learning"},{"order":"6","displayText":"Xiaoge Huang, Zhijun Qin, Hui Liu, \"A Survey on Power Grid Cyber Security: From Component-Wise Vulnerability Assessment to System-Wide Impact Analysis\", <i>Access IEEE</i>, vol. 6, pp. 69023-69035, 2018.","links":{"documentLink":"/document/8528321","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8528321","pdfSize":"4306KB"},"title":"A Survey on Power Grid Cyber Security: From Component-Wise Vulnerability Assessment to System-Wide Impact Analysis"},{"order":"7","displayText":"Erik M. Ferragut, Jason Laska, Mohammed M. Olama, Ozgur Ozmen, \"Real-Time Cyber-Physical False Data Attack Detection in Smart Grids Using Neural Networks\", <i>Computational Science and Computational Intelligence (CSCI) 2017 International Conference on</i>, pp. 1-6, 2017.","links":{"documentLink":"/document/8560712","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8560712","pdfSize":"703KB"},"title":"Real-Time Cyber-Physical False Data Attack Detection in Smart Grids Using Neural Networks"},{"order":"8","displayText":"Aslam Muhammad, Jae Myoung Lee, Sug Won Hong, Seung Jae Lee, Eui Hyang Lee, \"Deep Learning Application in Power System with a Case Study on Solar Irradiation Forecasting\", <i>Artificial Intelligence in Information and Communication (ICAIIC) 2019 International Conference on</i>, pp. 275-279, 2019.","links":{"documentLink":"/document/8668969","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8668969","pdfSize":"257KB"},"title":"Deep Learning Application in Power System with a Case Study on Solar Irradiation Forecasting"},{"order":"9","displayText":"Farzad Samie, Lars Bauer, Jörg Henkel, \"From Cloud Down to Things: An Overview of Machine Learning in Internet of Things\", <i>Internet of Things Journal IEEE</i>, vol. 6, no. 3, pp. 4921-4934, 2019.","links":{"documentLink":"/document/8616889","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8616889","pdfSize":"3112KB"},"title":"From Cloud Down to Things: An Overview of Machine Learning in Internet of Things"},{"order":"10","displayText":"Jiwei Tian, Tengyao Li, Fute Shang, Kunrui Cao, Jing Li, Mete Ozay, \"Adaptive Normalized Attacks for Learning Adversarial Attacks and Defenses in Power Systems\", <i>Communications Control and Computing Technologies for Smart Grids (SmartGridComm) 2019 IEEE International Conference on</i>, pp. 1-6, 2019.","links":{"documentLink":"/document/8909713","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8909713","pdfSize":"458KB"},"title":"Adaptive Normalized Attacks for Learning Adversarial Attacks and Defenses in Power Systems"},{"order":"11","displayText":"Yew Meng Khaw, Amir Abiri Jahromi, Arani Mohammadreza F. M., Deepa Kundur, Scott Sanner, Marthe Kassouf, \"Preventing False Tripping Cyberattacks Against Distance Relays: A Deep Learning Approach\", <i>Communications Control and Computing Technologies for Smart Grids (SmartGridComm) 2019 IEEE International Conference on</i>, pp. 1-6, 2019.","links":{"documentLink":"/document/8909810","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8909810","pdfSize":"830KB"},"title":"Preventing False Tripping Cyberattacks Against Distance Relays: A Deep Learning Approach"},{"order":"12","displayText":"Kaveri Mahapatra, Mahmoud Ashour, Nilanjan Ray Chaudhuri, Constantino M. Lagoa, \"Malicious Corruption Resilience in PMU Data and Wide-Area Damping Control\", <i>Smart Grid IEEE Transactions on</i>, vol. 11, no. 2, pp. 958-967, 2020.","links":{"documentLink":"/document/8760545","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8760545","pdfSize":"3568KB"},"title":"Malicious Corruption Resilience in PMU Data and Wide-Area Damping Control"},{"order":"13","displayText":"Zakaria El Mrabet, Daisy Flora Selvaraj, Prakash Ranganathan, \"Adaptive Hoeffding Tree with Transfer Learning for Streaming Synchrophasor Data Sets\", <i>Big Data (Big Data) 2019 IEEE International Conference on</i>, pp. 5697-5704, 2019.","links":{"documentLink":"/document/9005720","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=9005720","pdfSize":"353KB"},"title":"Adaptive Hoeffding Tree with Transfer Learning for Streaming Synchrophasor Data Sets"},{"order":"14","displayText":"Yuancheng Li, Wendan Huo, Rixuan Qiu, Jing Zeng, \"Efficient detection of false data injection attack with invertible automatic encoder and long-short-term memory\", <i>Cyber-Physical Systems: Theory & Applications IET</i>, vol. 5, no. 1, pp. 110-118, 2020.","links":{"crossRefLink":"https://doi.org/10.1049/iet-cps.2019.0010","pdfSize":"1811KB"},"title":"Efficient detection of false data injection attack with invertible automatic encoder and long-short-term memory"},{"order":"15","displayText":"Tien Nguyen, Shiyuan Wang, Mohannad Alhazmi, Mostafa Nazemi, Abouzar Estebsari, Payman Dehghanian, \"Electric Power Grid Resilience to Cyber Adversaries: State of the Art\", <i>Access IEEE</i>, vol. 8, pp. 87592-87608, 2020.","links":{"documentLink":"/document/9090140","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=9090140","pdfSize":"3714KB"},"title":"Electric Power Grid Resilience to Cyber Adversaries: State of the Art"},{"order":"16","displayText":"Ali Sayghe, Junbo Zhao, Charalambos Konstantinou, \"Evasion Attacks with Adversarial Deep Learning Against Power System State Estimation\", <i>Power & Energy Society General Meeting (PESGM) 2020 IEEE</i>, pp. 1-5, 2020.","links":{"documentLink":"/document/9281719","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=9281719","pdfSize":"394KB"},"title":"Evasion Attacks with Adversarial Deep Learning Against Power System State Estimation"},{"order":"17","displayText":"Aparna Kumari, Mohil Maheshkumar Patel, Arpit Shukla, Sudeep Tanwar, Neeraj Kumar, Joel J. P. C. Rodrigues, \"ArMor: A Data Analytics Scheme to identify malicious behaviors on Blockchain-based Smart Grid System\", <i>Global Communications Conference (GLOBECOM) 2020 IEEE</i>, pp. 1-6, 2020.","links":{"documentLink":"/document/9348061","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=9348061","pdfSize":"1006KB"},"title":"ArMor: A Data Analytics Scheme to identify malicious behaviors on Blockchain-based Smart Grid System"},{"order":"18","displayText":"Yew Meng Khaw, Amir Abiri Jahromi, Mohammadreza F. M. Arani, Scott Sanner, Deepa Kundur, Marthe Kassouf, \"A Deep Learning-Based Cyberattack Detection System for Transmission Protective Relays\", <i>Smart Grid IEEE Transactions on</i>, vol. 12, no. 3, pp. 2554-2565, 2021.","links":{"documentLink":"/document/9270592","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=9270592","pdfSize":"1852KB"},"title":"A Deep Learning-Based Cyberattack Detection System for Transmission Protective Relays"},{"order":"19","displayText":"Nur Imtiazul Haque, Md Hasan Shahriar, Md Golam Dastgir, Anjan Debnath, Imtiaz Parvez, Arif Sarwat, Mohammad Ashiqur Rahman, \"A Survey of Machine Learning-based Cyber-physical Attack Generation Detection and Mitigation in Smart-Grid\", <i>Power Symposium (NAPS) 2020 52nd North American</i>, pp. 1-6, 2021.","links":{"documentLink":"/document/9449635","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=9449635","pdfSize":"13138KB"},"title":"A Survey of Machine Learning-based Cyber-physical Attack Generation, Detection, and Mitigation in Smart-Grid"},{"order":"20","displayText":"Fayha Almutairy, Lazar Scekic, Ramadan Elmoudi, Safwan Wshah, \"Accurate Detection of False Data Injection Attacks in Renewable Power Systems Using Deep Learning\", <i>Access IEEE</i>, vol. 9, pp. 135774-135789, 2021.","links":{"documentLink":"/document/9557319","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=9557319","pdfSize":"2664KB"},"title":"Accurate Detection of False Data Injection Attacks in Renewable Power Systems Using Deep Learning"},{"order":"21","displayText":"Adedayo Aribisala, Mohammad S. Khan, Ghaith Husari, \"MACHINE LEARNING ALGORITHMS AND THEIR APPLICATIONS IN CLASSIFYING CYBER-ATTACKS ON A SMART GRID NETWORK\", <i>Information Technology Electronics and Mobile Communication Conference (IEMCON) 2021 IEEE 12th Annual</i>, pp. 0063-0069, 2021.","links":{"documentLink":"/document/9623067","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=9623067","pdfSize":"2298KB"},"title":"MACHINE LEARNING ALGORITHMS AND THEIR APPLICATIONS IN CLASSIFYING CYBER-ATTACKS ON A SMART GRID NETWORK"},{"order":"22","displayText":"Sheik M. Mohiuddin, Junjian Qi, Sasha Fung, Yu Huang, Yufei Tang, \"Deep Learning Based Multi-Label Attack Detection for Distributed Control of AC Microgrids\", <i>Communications Control and Computing Technologies for Smart Grids (SmartGridComm) 2021 IEEE International Conference on</i>, pp. 233-238, 2021.","links":{"documentLink":"/document/9631998","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=9631998","pdfSize":"4262KB"},"title":"Deep Learning Based Multi-Label Attack Detection for Distributed Control of AC Microgrids"}],"nonIeee":[{"order":"1","displayText":"Michele Scarpiniti, Enzo Baccarelli, Alireza Momenzadeh, Aurelio Uncini, \"SmartFog: Training the Fog for the Energy-Saving Analytics of Smart-Meter Data\", <i>Applied Sciences</i>, vol. 9, pp. 4193, 2019.","links":{"crossRefLink":"https://doi.org/10.3390/app9194193"},"title":"SmartFog: Training the Fog for the Energy-Saving Analytics of Smart-Meter Data"},{"order":"2","displayText":"A. M. Aleesa, B. B. Zaidan, A. A. Zaidan, Nan M. Sahar, \"Review of intrusion detection systems based on deep learning techniques: coherent taxonomy challenges motivations recommendations substantial analysis and future directions\", <i>Neural Computing and Applications</i>, 2019.","links":{"crossRefLink":"https://doi.org/10.1007/s00521-019-04557-3"},"title":"Review of intrusion detection systems based on deep learning techniques: coherent taxonomy, challenges, motivations, recommendations, substantial analysis and future directions"},{"order":"3","displayText":"Nikolaos Pitropakis, Marios Logothetis, Gennady Andrienko, Jason Stefanatos, Eirini Karapistoli, Costas Lambrinoudakis, <i>Computer Security</i>, vol. 11980, pp. 53, 2020.","links":{"crossRefLink":"https://doi.org/10.1007/978-3-030-42048-2_4"},"title":""},{"order":"4","displayText":"Liwei An, Guang-Hong Yang, \"Improved adaptive resilient control against sensor and actuator attacks\", <i>Information Sciences</i>, vol. 423, pp. 145, 2018.","links":{"crossRefLink":"https://doi.org/10.1016/j.ins.2017.09.042"},"title":"Improved adaptive resilient control against sensor and actuator attacks"},{"order":"5","displayText":"Anish Gupta, Ruchika Gupta, Gagan Kukreja, <i>Applications of Artificial Intelligence in Business, Education and Healthcare</i>, vol. 954, pp. 385, 2021.","links":{"crossRefLink":"https://doi.org/10.1007/978-3-030-72080-3_21"},"title":""},{"order":"6","displayText":"Yucheng Ding, Kang Ma, Tianjiao Pu, Xingying Wang, Ran Li, Dongxia Zhang, \"A deep learning‐based classification scheme for cyber‐attack detection in power system\", <i>IET Energy Systems Integration</i>, 2021.","links":{"crossRefLink":"https://doi.org/10.1049/esi2.12034"},"title":"A deep learning‐based classification scheme for cyber‐attack detection in power system"},{"order":"7","displayText":"Umit Cali, Murat Kuzlu, Manisa Pipattanasomporn, James Kempf, Linquan Bai, <i>Digitalization of Power Markets and Systems Using Energy Informatics</i>, pp. 139, 2021.","links":{"crossRefLink":"https://doi.org/10.1007/978-3-030-83301-5_7"},"title":""}]},"formulaStrippedArticleTitle":"A deep learning-based cyber-physical strategy to mitigate false data injection attack in smart grids","nonIeeeCitationCount":"7","contentTypeDisplay":"Conferences","patentCitationCount":"0","mlTime":"PT0.626197S","lastupdate":"2021-12-25","title":"A deep learning-based cyber-physical strategy to mitigate false data injection attack in smart grids","contentType":"conferences","ieeeCitationCount":"22","publicationNumber":"7590273"},{"_id":7684103,"paperCitations":{"ieee":[{"order":"1","displayText":"Anna Magdalena Kosek, Oliver Gehrke, \"Ensemble regression model-based anomaly detection for cyber-physical intrusion detection in smart grids\", <i>Electrical Power and Energy Conference (EPEC) 2016 IEEE</i>, pp. 1-7, 2016.","links":{"documentLink":"/document/7771704","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7771704","pdfSize":"713KB"},"title":"Ensemble regression model-based anomaly detection for cyber-physical intrusion detection in smart grids"},{"order":"2","displayText":"Pamela MacDougall, Anna Magdalena Kosek, Hendrik Bindner, Geert Deconinck, \"Applying machine learning techniques for forecasting flexibility of virtual power plants\", <i>Electrical Power and Energy Conference (EPEC) 2016 IEEE</i>, pp. 1-6, 2016.","links":{"documentLink":"/document/7771738","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7771738","pdfSize":"467KB"},"title":"Applying machine learning techniques for forecasting flexibility of virtual power plants"},{"order":"3","displayText":"Leonardo Babun, Hidayet Aksu, A. Selcuk Uluagac, \"Identifying counterfeit smart grid devices: A lightweight system level framework\", <i>Communications (ICC) 2017 IEEE International Conference on</i>, pp. 1-6, 2017.","links":{"documentLink":"/document/7996877","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7996877","pdfSize":"310KB"},"title":"Identifying counterfeit smart grid devices: A lightweight system level framework"},{"order":"4","displayText":"Kai Heussen, Emil Tyge, Anna Magdalena Kosek, \"Residential demand response behaviour modeling applied to cyber-physical intrusion detection\", <i>PowerTech 2017 IEEE Manchester</i>, pp. 1-6, 2017.","links":{"documentLink":"/document/7981209","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7981209","pdfSize":"839KB"},"title":"Residential demand response behaviour modeling applied to cyber-physical intrusion detection"},{"order":"5","displayText":"Mislav Findrik, Paul Smith, Jawad Haider Kazmi, Mario Faschang, Friederich Kupzog, \"Towards secure and resilient networked power distribution grids: Process and tool adoption\", <i>Smart Grid Communications (SmartGridComm) 2016 IEEE International Conference on</i>, pp. 435-440, 2016.","links":{"documentLink":"/document/7778800","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7778800","pdfSize":"754KB"},"title":"Towards secure and resilient networked power distribution grids: Process and tool adoption"},{"order":"6","displayText":"Justyna J. Chromik, Carina Pilch, Pascal Brackmann, Christof Duhme, Franziska Everinghoff, Artur Giberlein, Thomas Teodorowicz, Julian Wieland, Boudewijn R. Haverkort, Anne Remke, \"Context-aware local Intrusion Detection in SCADA systems: A testbed and two showcases\", <i>Smart Grid Communications (SmartGridComm) 2017 IEEE International Conference on</i>, pp. 467-472, 2017.","links":{"documentLink":"/document/8340672","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8340672","pdfSize":"781KB"},"title":"Context-aware local Intrusion Detection in SCADA systems: A testbed and two showcases"},{"order":"7","displayText":"Evgeny Pavlenko, Dmitry Zegzhda, \"Sustainability of cyber-physical systems in the context of targeted destructive influences\", <i>Industrial Cyber-Physical Systems (ICPS) 2018 IEEE</i>, pp. 830-834, 2018.","links":{"documentLink":"/document/8390814","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8390814","pdfSize":"383KB"},"title":"Sustainability of cyber-physical systems in the context of targeted destructive influences"},{"order":"8","displayText":"Cengiz Kaygusuz, Leonardo Babun, Hidayet Aksu, A. Selcuk Uluagac, \"Detection of Compromised Smart Grid Devices with Machine Learning and Convolution Techniques\", <i>Communications (ICC) 2018 IEEE International Conference on</i>, pp. 1-6, 2018.","links":{"documentLink":"/document/8423022","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8423022","pdfSize":"306KB"},"title":"Detection of Compromised Smart Grid Devices with Machine Learning and Convolution Techniques"},{"order":"9","displayText":"Ilsun You, Kangbin Yim, Vishal Sharma, Gaurav Choudhary, Ing-Ray Chen, Jin-Hee Cho, \"Misbehavior Detection of Embedded IoT Devices in Medical Cyber Physical Systems\", <i>Connected Health: Applications Systems and Engineering Technologies (CHASE) 2018 IEEE/ACM International Conference on</i>, pp. 88-93, 2018.","links":{"documentLink":"/document/8648672","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8648672","pdfSize":"441KB"},"title":"Misbehavior Detection of Embedded IoT Devices in Medical Cyber Physical Systems"},{"order":"10","displayText":"Sabeeh Ahmad Malik, Taimoor Muzaffar Gondal, Sadiq Ahmad, Muhammad Adil, Rizwan Qureshi, \"Towards Optimization Approaches in Smart Grid A Review*\", <i>Computing Mathematics and Engineering Technologies (iCoMET) 2019 2nd International Conference on</i>, pp. 1-5, 2019.","links":{"documentLink":"/document/8673392","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8673392","pdfSize":"738KB"},"title":"Towards Optimization Approaches in Smart Grid A Review*"},{"order":"11","displayText":"Vishal Sharma, Ilsun You, Kangbin Yim, Ing-Ray Chen, Jin-Hee Cho, \"BRIoT: Behavior Rule Specification-Based Misbehavior Detection for IoT-Embedded Cyber-Physical Systems\", <i>Access IEEE</i>, vol. 7, pp. 118556-118580, 2019.","links":{"documentLink":"/document/8715740","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8715740","pdfSize":"3627KB"},"title":"BRIoT: Behavior Rule Specification-Based Misbehavior Detection for IoT-Embedded Cyber-Physical Systems"},{"order":"12","displayText":"Vahid Ranjbar, Mostafa Salehi, Pegah Jandaghi, Mahdi Jalili, \"QANet: Tensor Decomposition Approach for Query-Based Anomaly Detection in Heterogeneous Information Networks\", <i>Knowledge and Data Engineering IEEE Transactions on</i>, vol. 31, no. 11, pp. 2178-2189, 2019.","links":{"documentLink":"/document/8488508","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8488508","pdfSize":"1621KB"},"title":"QANet: Tensor Decomposition Approach for Query-Based Anomaly Detection in Heterogeneous Information Networks"},{"order":"13","displayText":"Ciaran Roberts, Anna Scaglione, Mahdi Jamei, Reinhard Gentz, Sean Peisert, Emma M. Stewart, Chuck McParland, Alex McEachern, Daniel Arnold, \"Learning Behavior of Distribution System Discrete Control Devices for Cyber-Physical Security\", <i>Smart Grid IEEE Transactions on</i>, vol. 11, no. 1, pp. 749-761, 2020.","links":{"documentLink":"/document/8805153","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8805153","pdfSize":"2390KB"},"title":"Learning Behavior of Distribution System Discrete Control Devices for Cyber-Physical Security"},{"order":"14","displayText":"Theis Bo Rasmussen, Guangya Yang, Arne Hejde Nielsen, Zhao Yang Dong, \"Application of functional modelling for monitoring of WTG in a cyber-physical environment\", <i>Cyber-Physical Systems: Theory & Applications IET</i>, vol. 4, no. 1, pp. 79-87, 2019.","links":{"crossRefLink":"https://doi.org/10.1049/iet-cps.2017.0109","pdfSize":"2892KB"},"title":"Application of functional modelling for monitoring of WTG in a cyber-physical environment"},{"order":"15","displayText":"Giovanni Battista Gaggero, Mansueto Rossi, Paola Girdinio, Mario Marchese, \"Neural network architecture to detect system faults / cyberattacks anomalies within a photovoltaic system connected to the grid\", <i>Advanced Electrical and Communication Technologies (ISAECT) 2019 International Symposium on</i>, pp. 1-4, 2019.","links":{"documentLink":"/document/9069683","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=9069683","pdfSize":"282KB"},"title":"Neural network architecture to detect system faults / cyberattacks anomalies within a photovoltaic system connected to the grid"},{"order":"16","displayText":"Azwirman Gusrialdi, Ying Xu, Zhihua Qu, Marwan A. Simaan, \"Resilient Cooperative Voltage Control for Distribution Network with High Penetration Distributed Energy Resources\", <i>European Control Conference (ECC) 2020</i>, pp. 1533-1539, 2020.","links":{"documentLink":"/document/9143684","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=9143684","pdfSize":"461KB"},"title":"Resilient Cooperative Voltage Control for Distribution Network with High Penetration Distributed Energy Resources"},{"order":"17","displayText":"Gaurav Choudhary, Philip Virgil Astillo, Ilsun You, Kangbin Yim, Ing-Ray Chen, Jin-Hee Cho, \"Lightweight Misbehavior Detection Management of Embedded IoT Devices in Medical Cyber Physical Systems\", <i>Network and Service Management IEEE Transactions on</i>, vol. 17, no. 4, pp. 2496-2510, 2020.","links":{"documentLink":"/document/9138532","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=9138532","pdfSize":"2532KB"},"title":"Lightweight Misbehavior Detection Management of Embedded IoT Devices in Medical Cyber Physical Systems"},{"order":"18","displayText":"Deepti Saraswat, Pronaya Bhattacharya, Mohd Zuhair, Ashwin Verma, Ashwani Kumar, \"AnSMart: A SVM-based anomaly detection scheme via system profiling in Smart Grids\", <i>Intelligent Engineering and Management (ICIEM) 2021 2nd International Conference on</i>, pp. 417-422, 2021.","links":{"documentLink":"/document/9445353","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=9445353","pdfSize":"2200KB"},"title":"AnSMart: A SVM-based anomaly detection scheme via system profiling in Smart Grids"}],"nonIeee":[{"order":"1","displayText":"Yuting Kuang, Ritika Singh, Saumya Singh, Shri Prakash Singh, \"A novel macroeconomic forecasting model based on revised multimedia assisted BP neural network model and ant Colony algorithm\", <i>Multimedia Tools and Applications</i>, vol. 76, pp. 18749, 2017.","links":{"crossRefLink":"https://doi.org/10.1007/s11042-016-4319-9"},"title":"A novel macroeconomic forecasting model based on revised multimedia assisted BP neural network model and ant Colony algorithm"},{"order":"2","displayText":"P. Sivils, C. Rieger, K. Amarasinghe, M. Manic, <i>The Internet of Things for Smart Urban Ecosystems</i>, pp. 51, 2019.","links":{"crossRefLink":"https://doi.org/10.1007/978-3-319-96550-5_3"},"title":""},{"order":"3","displayText":"Leonardo Babun, Hidayet Aksu, A. Selcuk Uluagac, \"A System-level Behavioral Detection Framework for Compromised CPS Devices\", <i>ACM Transactions on Cyber-Physical Systems</i>, vol. 4, pp. 1, 2020.","links":{},"title":"A System-level Behavioral Detection Framework for Compromised CPS Devices"},{"order":"4","displayText":"David A. Wood, \"Predicting Stability of a Decentralized Power Grid Linking Electricity Price Formulation to Grid Frequency Applying an Optimized Data-Matching Learning Network to Simulated Data\", <i>Technology and Economics of Smart Grids and Sustainable Energy</i>, vol. 5, 2020.","links":{"crossRefLink":"https://doi.org/10.1007/s40866-019-0074-0"},"title":"Predicting Stability of a Decentralized Power Grid Linking Electricity Price Formulation to Grid Frequency Applying an Optimized Data-Matching Learning Network to Simulated Data"},{"order":"5","displayText":"Roberto Moro Visconti, Laura Martiniello, \"Smart hospitals and patient-centered governance\", <i>Corporate Ownership and Control</i>, vol. 16, pp. 83, 2019.","links":{"crossRefLink":"https://doi.org/10.22495/cocv16i2art9"},"title":"Smart hospitals and patient-centered governance"},{"order":"6","displayText":"Jakapan Suaboot, Adil Fahad, Zahir Tari, John Grundy, Abdun Naser Mahmood, Abdulmohsen Almalawi, Albert Y. Zomaya, Khalil Drira, \"A Taxonomy of Supervised Learning for IDSs in SCADA Environments\", <i>ACM Computing Surveys</i>, vol. 53, pp. 1, 2020.","links":{},"title":"A Taxonomy of Supervised Learning for IDSs in SCADA Environments"},{"order":"7","displayText":"Pooja Agarwal, <i>ICDSMLA 2019</i>, vol. 601, pp. 1, 2020.","links":{"crossRefLink":"https://doi.org/10.1007/978-981-15-1420-3_1"},"title":""},{"order":"8","displayText":"Richa Singh, Arunendra Singh, Pronaya Bhattacharya, <i>Advancements in Security and Privacy Initiatives for Multimedia Images</i>, pp. 199, 2021.","links":{"crossRefLink":"https://doi.org/10.4018/978-1-7998-2795-5.ch008"},"title":""},{"order":"9","displayText":"V. V. Semenov, M. E. Sukhoparov, I. S. Lebedev, <i>Internet of Things, Smart Spaces, and Next Generation Networks and Systems</i>, vol. 12525, pp. 3, 2020.","links":{"crossRefLink":"https://doi.org/10.1007/978-3-030-65726-0_1"},"title":""},{"order":"10","displayText":"Seoyoung Park, Siho Han, Simon S. Woo, <i>Machine Learning and Knowledge Discovery in Databases: Applied Data Science Track</i>, vol. 12460, pp. 157, 2021.","links":{"crossRefLink":"https://doi.org/10.1007/978-3-030-67667-4_10"},"title":""},{"order":"11","displayText":"Richa Singh, Arunendra Singh, Pronaya Bhattacharya, <i>Research Anthology on Smart Grid and Microgrid Development</i>, pp. 911, 2022.","links":{"crossRefLink":"https://doi.org/10.4018/978-1-6684-3666-0.ch040"},"title":""}]},"formulaStrippedArticleTitle":"Contextual anomaly detection for cyber-physical security in Smart Grids based on an artificial neural network model","nonIeeeCitationCount":"11","contentTypeDisplay":"Conferences","patentCitationCount":"0","mlTime":"PT0.668209S","lastupdate":"2021-10-11","title":"Contextual anomaly detection for cyber-physical security in Smart Grids based on an artificial neural network model","contentType":"conferences","ieeeCitationCount":"18","publicationNumber":"7590273"},{"_id":7684151,"paperCitations":{"ieee":[{"order":"1","displayText":"Kalpana Ettikyala, Yellasiri Vijayalata, M. Chandra Mohan, \"Efficient time shared task scheduler for cloud computing\", <i>Information Communication Instrumentation and Control (ICICIC) 2017 International Conference on</i>, pp. 1-4, 2017.","links":{"documentLink":"/document/8279012","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8279012","pdfSize":"194KB"},"title":"Efficient time shared task scheduler for cloud computing"},{"order":"2","displayText":"Kalpana Ettikyala, Yellasiri Vijayalata, M. Chandra Mohan, \"Virtual machine schedulers for cloud computing\", <i>Information Communication Instrumentation and Control (ICICIC) 2017 International Conference on</i>, pp. 1-4, 2017.","links":{"documentLink":"/document/8279013","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8279013","pdfSize":"191KB"},"title":"Virtual machine schedulers for cloud computing"},{"order":"3","displayText":"David Perez Abreu, Karima Velasquez, Marcio Roberto Miranda Assis, Luiz Fernando Bittencourt, Marilia Curado, Edmundo Monteiro, Edmundo Madeira, \"A Rank Scheduling Mechanism for Fog Environments\", <i>Future Internet of Things and Cloud (FiCloud) 2018 IEEE 6th International Conference on</i>, pp. 363-369, 2018.","links":{"documentLink":"/document/8458036","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8458036","pdfSize":"326KB"},"title":"A Rank Scheduling Mechanism for Fog Environments"},{"order":"4","displayText":"José Santos, Tim Wauters, Bruno Volckaert, Filip De Turck, \"Towards Network-Aware Resource Provisioning in Kubernetes for Fog Computing Applications\", <i>Network Softwarization (NetSoft) 2019 IEEE Conference on</i>, pp. 351-359, 2019.","links":{"documentLink":"/document/8806671","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8806671","pdfSize":"1562KB"},"title":"Towards Network-Aware Resource Provisioning in Kubernetes for Fog Computing Applications"},{"order":"5","displayText":"Marcus Vinicíus Souza Costa, Vitor Barbosa Souza, Sócrates S Araújo Júnior, \"Dynamic Control-as-a-Service provisioning in Fog computing\", <i>Software Telecommunications and Computer Networks (SoftCOM) 2019 International Conference on</i>, pp. 1-6, 2019.","links":{"documentLink":"/document/8903606","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8903606","pdfSize":"521KB"},"title":"Dynamic Control-as-a-Service provisioning in Fog computing"},{"order":"6","displayText":"Łukasz Wojciechowski, Krzysztof Opasiak, Jakub Latusek, Maciej Wereski, Victor Morales, Taewan Kim, Moonki Hong, \"NetMARKS: Network Metrics-AwaRe Kubernetes Scheduler Powered by Service Mesh\", <i>Computer Communications IEEE INFOCOM 2021 - IEEE Conference on</i>, pp. 1-9, 2021.","links":{"documentLink":"/document/9488670","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=9488670","pdfSize":"850KB"},"title":"NetMARKS: Network Metrics-AwaRe Kubernetes Scheduler Powered by Service Mesh"}],"nonIeee":[{"order":"1","displayText":"Linz Tom, V. R. Bindu, <i>Inventive Computation Technologies</i>, vol. 98, pp. 342, 2020.","links":{"crossRefLink":"https://doi.org/10.1007/978-3-030-33846-6_39"},"title":""},{"order":"2","displayText":"Linz Tom, V. R. Bindu, <i>Information and Communication Technology for Competitive Strategies (ICTCS 2020)</i>, vol. 190, pp. 359, 2021.","links":{"crossRefLink":"https://doi.org/10.1007/978-981-16-0882-7_30"},"title":""}]},"formulaStrippedArticleTitle":"Rank based efficient task scheduler for cloud computing","nonIeeeCitationCount":"2","contentTypeDisplay":"Conferences","patentCitationCount":"0","mlTime":"PT0.24285S","lastupdate":"2021-10-12","title":"Rank based efficient task scheduler for cloud computing","contentType":"conferences","ieeeCitationCount":"6","publicationNumber":"7590274"},{"_id":7684172,"formulaStrippedArticleTitle":"A study on Down syndrome detection based on Artificial Neural Network in Ultra sonogram images","nonIeeeCitationCount":"0","contentTypeDisplay":"Conferences","patentCitationCount":"0","mlTime":"PT0.02466S","lastupdate":"2021-10-12","title":"A study on Down syndrome detection based on Artificial Neural Network in Ultra sonogram images","contentType":"conferences","ieeeCitationCount":"0","publicationNumber":"7590274"},{"_id":7684706,"paperCitations":{"ieee":[{"order":"1","displayText":"Zhong-Qiu Zhao, Peng Zheng, Shou-Tao Xu, Xindong Wu, \"Object Detection With Deep Learning: A Review\", <i>Neural Networks and Learning Systems IEEE Transactions on</i>, vol. 30, no. 11, pp. 3212-3232, 2019.","links":{"documentLink":"/document/8627998","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8627998","pdfSize":"4767KB"},"title":"Object Detection With Deep Learning: A Review"},{"order":"2","displayText":"Juan Borrego-Carazo, David Castells-Rufas, Ernesto Biempica, Jordi Carrabina, \"Resource-Constrained Machine Learning for ADAS: A Systematic Review\", <i>Access IEEE</i>, vol. 8, pp. 40573-40598, 2020.","links":{"documentLink":"/document/9016213","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=9016213","pdfSize":"3238KB"},"title":"Resource-Constrained Machine Learning for ADAS: A Systematic Review"}],"nonIeee":[{"order":"1","displayText":"Liu Sicong, Zhou Zimu, Du Junzhao, Shangguan Longfei, Jun Han, Xin Wang, \"UbiEar: Bringing Location-independent Sound Awareness to the Hard-of-hearing People with Smartphones\", <i>Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies</i>, vol. 1, pp. 1, 2017.","links":{"documentLink":"/document/8021901","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8021901"},"title":"UbiEar: Bringing Location-independent Sound Awareness to the Hard-of-hearing People with Smartphones"},{"order":"2","displayText":"Junzhao Du, Sicong Liu, Yuheng Wei, Hui Liu, Xin Wang, Kaiming Nan, <i>Wireless Sensor Networks</i>, vol. 812, pp. 139, 2018.","links":{"crossRefLink":"https://doi.org/10.1007/978-981-10-8123-1_13"},"title":""},{"order":"3","displayText":"Eric Juwei Cheng, Mukesh Prasad, Jie Yang, Ding Rong Zheng, Xian Tao, Domingo Mery, Ku Young Young, Chin Teng Lin, \"A novel online self-learning system with automatic object detection model for multimedia applications\", <i>Multimedia Tools and Applications</i>, vol. 80, pp. 16659, 2021.","links":{"crossRefLink":"https://doi.org/10.1007/s11042-020-09055-6"},"title":"A novel online self-learning system with automatic object detection model for multimedia applications"}]},"formulaStrippedArticleTitle":"Reduced memory region based deep Convolutional Neural Network detection","nonIeeeCitationCount":"3","contentTypeDisplay":"Conferences","patentCitationCount":"0","mlTime":"PT0.093072S","lastupdate":"2021-10-11","title":"Reduced memory region based deep Convolutional Neural Network detection","contentType":"conferences","ieeeCitationCount":"2","publicationNumber":"7590260"},{"_id":7684711,"paperCitations":{"ieee":[{"order":"1","displayText":"D. Selvathi, V. Vishnu Sankar, H. Venkatasubramani, \"Embedded based automatic heart attack detector and intimator\", <i>Innovations in Information Embedded and Communication Systems (ICIIECS) 2017 International Conference on</i>, pp. 1-6, 2017.","links":{"documentLink":"/document/8275839","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8275839","pdfSize":"969KB"},"title":"Embedded based automatic heart attack detector and intimator"},{"order":"2","displayText":"Diana Batista, Hugo Plácido da Silva, Ana Fred, Carlos Moreira, Margarida Reis, Hugo Alexandre Ferreira, \"Benchmarking of the BITalino biomedical toolkit against an established gold standard\", <i></i>, vol. 6, no. 2, pp. 32-36, 2019.","links":{"crossRefLink":"https://doi.org/10.1049/htl.2018.5037","pdfSize":"421KB"},"title":"Benchmarking of the BITalino biomedical toolkit against an established gold standard"},{"order":"3","displayText":"Ahmed Bouzid, József Vásárhelyi, \"Implementation and Experimentation of an Embedded Data Acquisition/Preprocessing System Based on a Hybrid Reconfigurable Hardware Accelerator for Inertial Measurements\", <i>Industry Applications IEEE Transactions on</i>, vol. 56, no. 2, pp. 2012-2019, 2020.","links":{"documentLink":"/document/8957050","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8957050","pdfSize":"2632KB"},"title":"Implementation and Experimentation of an Embedded Data Acquisition/Preprocessing System Based on a Hybrid Reconfigurable Hardware Accelerator for Inertial Measurements"},{"order":"4","displayText":"Antonios Gotsinas, Konstantinos Kalovrektis, Apostolos Xenakis, Georgios Stamoulis, \"A ZigBee – based Lightweight Wireless Sensor System for measuring action potential bio signals in Agriculture IoT Applications\", <i>Information Intelligence Systems and Applications (IISA) 2020 11th International Conference on</i>, pp. 1-7, 2020.","links":{"documentLink":"/document/9284340","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=9284340","pdfSize":"463KB"},"title":"A ZigBee – based Lightweight Wireless Sensor System for measuring action potential bio signals in Agriculture IoT Applications"}],"nonIeee":[{"order":"1","displayText":"Priyanka Paka, Rajani Akula, <i>Advances in Decision Sciences, Image Processing, Security and Computer Vision</i>, vol. 4, pp. 139, 2020.","links":{"crossRefLink":"https://doi.org/10.1007/978-3-030-24318-0_17"},"title":""}]},"formulaStrippedArticleTitle":"A wireless biosignal measurement system using a SoC FPGA and Bluetooth Low Energy","nonIeeeCitationCount":"1","contentTypeDisplay":"Conferences","patentCitationCount":"0","mlTime":"PT0.269611S","lastupdate":"2021-10-11","title":"A wireless biosignal measurement system using a SoC FPGA and Bluetooth Low Energy","contentType":"conferences","ieeeCitationCount":"4","publicationNumber":"7590260"},{"_id":7684724,"paperCitations":{"ieee":[{"order":"1","displayText":"Alberto Paltrinieri, Riccardo Peloso, Guido Masera, Muhammad Shafique, Maurizio Martina, \"Approximate-Computing Architectures for Motion Estimation in HEVC\", <i>CAS (NGCAS) 2018 New Generation of</i>, pp. 190-193, 2018.","links":{"documentLink":"/document/8572080","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8572080","pdfSize":"1091KB"},"title":"Approximate-Computing Architectures for Motion Estimation in HEVC"},{"order":"2","displayText":"Felipe M. Sampaio, Bruno Zatt, Muhammad Shafique, Jörg Henkel, Sergio Bampi, \"Hybrid Scratchpad Video Memory Architecture for Energy-Efficient Parallel HEVC\", <i>Circuits and Systems for Video Technology IEEE Transactions on</i>, vol. 29, no. 10, pp. 3046-3060, 2019.","links":{"documentLink":"/document/8466911","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8466911","pdfSize":"4579KB"},"title":"Hybrid Scratchpad Video Memory Architecture for Energy-Efficient Parallel HEVC"}],"nonIeee":[{"order":"1","displayText":"Roger Porto, Murilo Perleberg, Vladimir Afonso, Bruno Zatt, Nuno Roma, Luciano Agostini, Marcelo Porto, \"Fast and energy-efficient approximate motion estimation architecture for real-time 4 K UHD processing\", <i>Journal of Real-Time Image Processing</i>, 2020.","links":{"crossRefLink":"https://doi.org/10.1007/s11554-020-01014-6"},"title":"Fast and energy-efficient approximate motion estimation architecture for real-time 4 K UHD processing"}]},"formulaStrippedArticleTitle":"An efficient motion estimation hardware architecture using Modified Reference Data Access(MRDAS) skip algorithm for high Efficiency Video Coding(HEVC) encoder","nonIeeeCitationCount":"1","contentTypeDisplay":"Conferences","patentCitationCount":"0","mlTime":"PT0.068502S","lastupdate":"2021-10-11","title":"An efficient motion estimation hardware architecture using Modified Reference Data Access(MRDAS) skip algorithm for high Efficiency Video Coding(HEVC) encoder","contentType":"conferences","ieeeCitationCount":"2","publicationNumber":"7590260"},{"_id":7684728,"paperCitations":{"ieee":[{"order":"1","displayText":"Fernando Martín, Juan Carballeira, Luis Moreno, Santiago Garrido, Pavel González, \"Using the Jensen-Shannon Density Power and Itakura-Saito Divergences to Implement an Evolutionary-Based Global Localization Filter for Mobile Robots\", <i>Access IEEE</i>, vol. 5, pp. 13922-13940, 2017.","links":{"documentLink":"/document/7971904","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=7971904","pdfSize":"6367KB"},"title":"Using the Jensen-Shannon, Density Power, and Itakura-Saito Divergences to Implement an Evolutionary-Based Global Localization Filter for Mobile Robots"},{"order":"2","displayText":"A. Ahilan, Gunasekaran Manogaran, C. Raja, Seifedine Kadry, S. N. Kumar, C. Agees Kumar, T. Jarin, Sujatha Krishnamoorthy, Priyan Malarvizhi Kumar, Gokulnath Chandra Babu, N. Senthil Murugan, Parthasarathy, \"Segmentation by Fractional Order Darwinian Particle Swarm Optimization Based Multilevel Thresholding and Improved Lossless Prediction Based Compression Algorithm for Medical Images\", <i>Access IEEE</i>, vol. 7, pp. 89570-89580, 2019.","links":{"documentLink":"/document/8761850","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8761850","pdfSize":"9763KB"},"title":"Segmentation by Fractional Order Darwinian Particle Swarm Optimization Based Multilevel Thresholding and Improved Lossless Prediction Based Compression Algorithm for Medical Images"},{"order":"3","displayText":"Fares Tarek Ali, Omar AbdulAziz Fahmy, Ayman A. El-Badawy, \"An Indoor Vision-Based Markov Localization Technique of a Quadrotor\", <i>Vehicular Electronics and Safety (ICVES) 2019 IEEE International Conference on</i>, pp. 1-6, 2019.","links":{"documentLink":"/document/8906468","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8906468","pdfSize":"3190KB"},"title":"An Indoor Vision-Based Markov Localization Technique of a Quadrotor"}],"nonIeee":[{"order":"1","displayText":"Qin Tang, Jing Liang, <i>Communications, Signal Processing, and Systems</i>, vol. 516, pp. 1339, 2020.","links":{"crossRefLink":"https://doi.org/10.1007/978-981-13-6504-1_159"},"title":""}]},"formulaStrippedArticleTitle":"Global localization of Monte Carlo localization based on multi-objective particle swarm optimization","nonIeeeCitationCount":"1","contentTypeDisplay":"Conferences","patentCitationCount":"0","mlTime":"PT0.221701S","lastupdate":"2021-12-11","title":"Global localization of Monte Carlo localization based on multi-objective particle swarm optimization","contentType":"conferences","ieeeCitationCount":"3","publicationNumber":"7590260"},{"_id":7684729,"paperCitations":{"ieee":[{"order":"1","displayText":"Michael O'Hara, Kaitlyn Mangano, Gilbert Lai, John Sebastian, Mario Montuori, Arman Molki, Tolga Kaya, \"Development of an Autonomous Indoor Robot for Mapping Applications\", <i>Engineering and Emerging Technologies (ICEET) 2021 International Conference on</i>, pp. 1-5, 2021.","links":{"documentLink":"/document/9659668","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=9659668","pdfSize":"951KB"},"title":"Development of an Autonomous Indoor Robot for Mapping Applications"}],"nonIeee":[{"order":"1","displayText":"V. S. Kalogeiton, K. Ioannidis, G. Ch. Sirakoulis, E. B. Kosmatopoulos, \"Real-Time Active SLAM and Obstacle Avoidance for an Autonomous Robot Based on Stereo Vision\", <i>Cybernetics and Systems</i>, pp. 1, 2019.","links":{"crossRefLink":"https://doi.org/10.1080/01969722.2018.1541599"},"title":"Real-Time Active SLAM and Obstacle Avoidance for an Autonomous Robot Based on Stereo Vision"}]},"formulaStrippedArticleTitle":"FPGA-implemented corner feature extracting simultaneous localization and mapping","nonIeeeCitationCount":"1","contentTypeDisplay":"Conferences","patentCitationCount":"0","mlTime":"PT0.09309S","lastupdate":"2022-01-07","title":"FPGA-implemented corner feature extracting simultaneous localization and mapping","contentType":"conferences","ieeeCitationCount":"1","publicationNumber":"7590260"},{"_id":7684733,"paperCitations":{"ieee":[{"order":"1","displayText":"Florian Jackisch, \"Spectral efficiency gains through the use of FBMC/OQAM for DOCSIS systems\", <i>Consumer Electronics (ICCE) 2018 IEEE International Conference on</i>, pp. 1-4, 2018.","links":{"documentLink":"/document/8326098","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8326098","pdfSize":"106KB"},"title":"Spectral efficiency gains through the use of FBMC/OQAM for DOCSIS systems"}]},"formulaStrippedArticleTitle":"A Software Defined Radio based DOCSIS 3.1 measurement receiver","nonIeeeCitationCount":"0","contentTypeDisplay":"Conferences","patentCitationCount":"1","mlTime":"PT0.052336S","lastupdate":"2021-10-11","title":"A Software Defined Radio based DOCSIS 3.1 measurement receiver","contentType":"conferences","ieeeCitationCount":"1","publicationNumber":"7590260"},{"_id":7684736,"paperCitations":{"ieee":[{"order":"1","displayText":"Joao Vieira, Erik Leitinger, Muris Sarajlic, Xuhong Li, Fredrik Tufvesson, \"Deep convolutional neural networks for massive MIMO fingerprint-based positioning\", <i>Personal Indoor and Mobile Radio Communications (PIMRC) 2017 IEEE 28th Annual International Symposium on</i>, pp. 1-6, 2017.","links":{"documentLink":"/document/8292280","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8292280","pdfSize":"932KB"},"title":"Deep convolutional neural networks for massive MIMO fingerprint-based positioning"},{"order":"2","displayText":"Sarmad Ahmed Shaikh, Andrea M. Tonello, \"EM lens-clustering based direction of arrival estimation in massive antenna systems\", <i>Smart Systems and Technologies (SST) 2017 International Conference on</i>, pp. 127-131, 2017.","links":{"documentLink":"/document/8188682","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8188682","pdfSize":"477KB"},"title":"EM lens-clustering based direction of arrival estimation in massive antenna systems"},{"order":"3","displayText":"K. N. R. Surya Vara Prasad, Ekram Hossain, Vijay K. Bhargava, Shankhanaad Mallick, \"Analytical Approximation-Based Machine Learning Methods for User Positioning in Distributed Massive MIMO\", <i>Access IEEE</i>, vol. 6, pp. 18431-18452, 2018.","links":{"documentLink":"/document/8290939","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8290939","pdfSize":"9066KB"},"title":"Analytical Approximation-Based Machine Learning Methods for User Positioning in Distributed Massive MIMO"},{"order":"4","displayText":"K. N. R. Surya Vara Prasad, Ekram Hossain, Vijay K. Bhargava, \"A numerical approximation method for RSS-based user positioning in distributed massive MIMO\", <i>Advanced Networks and Telecommunications Systems (ANTS) 2017 IEEE International Conference on</i>, pp. 1-6, 2017.","links":{"documentLink":"/document/8384093","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8384093","pdfSize":"166KB"},"title":"A numerical approximation method for RSS-based user positioning in distributed massive MIMO"},{"order":"5","displayText":"Francesco Guidi, \"AOA Estimation with EM Lens-Embedded Massive Arrays - Invited Paper\", <i>Vehicular Technology Conference (VTC Spring) 2018 IEEE 87th</i>, pp. 1-5, 2018.","links":{"documentLink":"/document/8417728","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8417728","pdfSize":"186KB"},"title":"AOA Estimation with EM Lens-Embedded Massive Arrays - Invited Paper"},{"order":"6","displayText":"K. N. R. Surya Vara Prasad, Ekram Hossain, Vijay K. Bhargava, \"Machine Learning Methods for RSS-Based User Positioning in Distributed Massive MIMO\", <i>Wireless Communications IEEE Transactions on</i>, vol. 17, no. 12, pp. 8402-8417, 2018.","links":{"documentLink":"/document/8509634","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8509634","pdfSize":"1712KB"},"title":"Machine Learning Methods for RSS-Based User Positioning in Distributed Massive MIMO"},{"order":"7","displayText":"Sarmad A. Shaikh, Andrea M. Tonello, \"Radio Source Localization in Multipath Channels Using EM Lens Assisted Massive Antennas Arrays\", <i>Access IEEE</i>, vol. 7, pp. 9001-9012, 2019.","links":{"documentLink":"/document/8603676","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8603676","pdfSize":"11126KB"},"title":"Radio Source Localization in Multipath Channels Using EM Lens Assisted Massive Antennas Arrays"},{"order":"8","displayText":"Kai Wu, Wei Ni, Tao Su, Ren Ping Liu, Y. Jay Guo, \"Exploiting Spatial-Wideband Effect for Fast AoA Estimation at Lens Antenna Array\", <i>Selected Topics in Signal Processing IEEE Journal of</i>, vol. 13, no. 5, pp. 902-917, 2019.","links":{"documentLink":"/document/8812956","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8812956","pdfSize":"2124KB"},"title":"Exploiting Spatial-Wideband Effect for Fast AoA Estimation at Lens Antenna Array"},{"order":"9","displayText":"Kai Wu, Wei Ni, J. Andrew Zhang, Ren Ping Liu, Jay Guo, \"Secrecy Rate Analysis for Millimeter-Wave Lens Antenna Array Transmission\", <i>Communications Letters IEEE</i>, vol. 24, no. 2, pp. 272-276, 2020.","links":{"documentLink":"/document/8903316","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8903316","pdfSize":"598KB"},"title":"Secrecy Rate Analysis for Millimeter-Wave Lens Antenna Array Transmission"},{"order":"10","displayText":"Seyedeh Samira Moosavi, Paul Fortier, \"Fingerprinting Localization Method Based on Clustering and Gaussian Process Regression in Distributed Massive MIMO Systems\", <i>Personal Indoor and Mobile Radio Communications 2020 IEEE 31st Annual International Symposium on</i>, pp. 1-7, 2020.","links":{"documentLink":"/document/9217356","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=9217356","pdfSize":"454KB"},"title":"Fingerprinting Localization Method Based on Clustering and Gaussian Process Regression in Distributed Massive MIMO Systems"},{"order":"11","displayText":"Aroland Kiring, Hoe Tung Yew, Yan Yan Farm, Seng Kheau Chung, Farrah Wong, Ali Chekima, \"Wi-Fi Radio Map Interpolation with Sparse and Correlated Received Signal Strength Measurements for Indoor Positioning\", <i>Artificial Intelligence in Engineering and Technology (IICAIET) 2020 IEEE 2nd International Conference on</i>, pp. 1-5, 2020.","links":{"documentLink":"/document/9257857","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=9257857","pdfSize":"255KB"},"title":"Wi-Fi Radio Map Interpolation with Sparse and Correlated Received Signal Strength Measurements for Indoor Positioning"},{"order":"12","displayText":"Jie Yang, Yong Zeng, Shi Jin, Chao-Kai Wen, Pingping Xu, \"Communication and Localization With Extremely Large Lens Antenna Array\", <i>Wireless Communications IEEE Transactions on</i>, vol. 20, no. 5, pp. 3031-3048, 2021.","links":{"documentLink":"/document/9314267","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=9314267","pdfSize":"2741KB"},"title":"Communication and Localization With Extremely Large Lens Antenna Array"},{"order":"13","displayText":"Xiaolu Zeng, Feng Zhang, Beibei Wang, K. J. Ray Liu, \"Massive MIMO for High-Accuracy Target Localization and Tracking\", <i>Internet of Things Journal IEEE</i>, vol. 8, no. 12, pp. 10131-10145, 2021.","links":{"documentLink":"/document/9319173","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=9319173","pdfSize":"4919KB"},"title":"Massive MIMO for High-Accuracy Target Localization and Tracking"}],"nonIeee":[{"order":"1","displayText":"L. Sathish, Y. Satya Bhuvaneswari, B. Satya Sri Devi, Durgesh Nandan, <i>Advances in Smart Grid and Renewable Energy</i>, vol. 691, pp. 249, 2021.","links":{"crossRefLink":"https://doi.org/10.1007/978-981-15-7511-2_22"},"title":""},{"order":"2","displayText":"Mohammed Ismail Mohammed, Tsehaye Redae Adhena, \"Angle of arrival estimation using hybrid rat race coupler for X-band applications\", <i>The European Physical Journal Plus</i>, vol. 135, 2020.","links":{"crossRefLink":"https://doi.org/10.1140/epjp/s13360-020-00658-4"},"title":"Angle of arrival estimation using hybrid rat race coupler for X-band applications"},{"order":"3","displayText":"Seyedeh Samira Moosavi, Paul Fortier, \"Fingerprinting Positioning in Distributed Massive MIMO Systems Using Affinity Propagation Clustering and Gaussian Process Regression\", <i>Wireless Personal Communications</i>, 2021.","links":{"crossRefLink":"https://doi.org/10.1007/s11277-021-08741-4"},"title":"Fingerprinting Positioning in Distributed Massive MIMO Systems Using Affinity Propagation Clustering and Gaussian Process Regression"}]},"formulaStrippedArticleTitle":"Localization based on angle of arrival in EM lens-focusing massive MIMO","nonIeeeCitationCount":"3","contentTypeDisplay":"Conferences","patentCitationCount":"0","mlTime":"PT0.705842S","lastupdate":"2021-10-11","title":"Localization based on angle of arrival in EM lens-focusing massive MIMO","contentType":"conferences","ieeeCitationCount":"13","publicationNumber":"7590260"},{"_id":7684745,"paperCitations":{"ieee":[{"order":"1","displayText":"Belal Mohamed, Amr Elsayed, Omar Amin, Eslam Khafagy, Maher Abdelrasoul, Ahmed Shalaby, Mohammed S. Sayed, \"High-level synthesis hardware implementation and verification of HEVC DCT on SoC-FPGA\", <i>Computer Engineering Conference (ICENCO) 2017 13th International</i>, pp. 361-365, 2017.","links":{"documentLink":"/document/8289815","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8289815","pdfSize":"687KB"},"title":"High-level synthesis hardware implementation and verification of HEVC DCT on SoC-FPGA"},{"order":"2","displayText":"T N Swamy, K Ramesha, K R Diwakar, \"An efficient algorithm for intra prediction in HEVC/H.265 standard for 16×16 pixels\", <i>Electrical Electronics Communication Computer and Optimization Techniques (ICEECCOT) 2017 International Conference on</i>, pp. 226-233, 2017.","links":{"documentLink":"/document/8284674","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8284674","pdfSize":"1135KB"},"title":"An efficient algorithm for intra prediction in HEVC/H.265 standard for 16×16 pixels"},{"order":"3","displayText":"Sławomir Cichoń, Marek Gorgoń, \"H.265 inverse transform FPGA implementation in Impulse C\", <i>Computer Science and Information Systems (FedCSIS) 2017 Federated Conference on</i>, pp. 607-611, 2017.","links":{"documentLink":"/document/8104609","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8104609","pdfSize":"518KB"},"title":"H.265 inverse transform FPGA implementation in Impulse C"},{"order":"4","displayText":"Sakari Lahti, Panu Sjövall, Jarno Vanne, Timo D. Hämäläinen, \"Are We There Yet? A Study on the State of High-Level Synthesis\", <i>Computer-Aided Design of Integrated Circuits and Systems IEEE Transactions on</i>, vol. 38, no. 5, pp. 898-911, 2019.","links":{"documentLink":"/document/8356004","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8356004","pdfSize":"2377KB"},"title":"Are We There Yet? A Study on the State of High-Level Synthesis"},{"order":"5","displayText":"Mahmoud Salah, BahaaEldin El-Shweky, Karim ElKholy, Amr Helmy, Yehea Ismail, Khaled Salah, \"HEVC Implementation for IoT Applications\", <i>Microelectronics (ICM) 2018 30th International Conference on</i>, pp. 295-298, 2018.","links":{"documentLink":"/document/8704034","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8704034","pdfSize":"3732KB"},"title":"HEVC Implementation for IoT Applications"},{"order":"6","displayText":"Ahmed Ben Atitallah, Manel Kammoun, \"High-level design of HEVC intra prediction algorithm\", <i>Advanced Technologies for Signal and Image Processing (ATSIP) 2020 5th International Conference on</i>, pp. 1-6, 2020.","links":{"documentLink":"/document/9231677","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=9231677","pdfSize":"246KB"},"title":"High-level design of HEVC intra prediction algorithm"}],"nonIeee":[{"order":"1","displayText":"Manel Kammoun, Ahmed Ben Atitallah, Karim M. A. Ali, Rabie Ben Atitallah, \"Case study of an HEVC decoder application using high-level synthesis: intraprediction dequantization and inverse transform blocks\", <i>Journal of Electronic Imaging</i>, vol. 28, pp. 1, 2019.","links":{"crossRefLink":"https://doi.org/10.1117/1.JEI.28.3.033010"},"title":"Case study of an HEVC decoder application using high-level synthesis: intraprediction, dequantization, and inverse transform blocks"},{"order":"2","displayText":"Ahmed Ben Atitallah, Manel Kammoun, Karim M.A. Ali, Rabie Ben Atitallah, \"An FPGA comparative study of high-level and low-level combined designs for HEVC intra inverse quantization and IDCT/IDST 2D modules\", <i>International Journal of Circuit Theory and Applications</i>, 2020.","links":{"crossRefLink":"https://doi.org/10.1002/cta.2790"},"title":"An FPGA comparative study of high-level and low-level combined designs for HEVC intra, inverse quantization, and IDCT/IDST 2D modules"}]},"formulaStrippedArticleTitle":"FPGA implementation of HEVC intra prediction using high-level synthesis","nonIeeeCitationCount":"2","contentTypeDisplay":"Conferences","patentCitationCount":"0","mlTime":"PT0.108584S","lastupdate":"2021-10-11","title":"FPGA implementation of HEVC intra prediction using high-level synthesis","contentType":"conferences","ieeeCitationCount":"6","publicationNumber":"7590260"},{"_id":7684766,"paperCitations":{"nonIeee":[{"order":"1","displayText":"Shi Qiu, Xuemei Li, Yongdong Huang, Zhengzhou Li, Xun Chen, Yuyang Chen, \"New Algorithm of Response Curve for Fitting HDR Image\", <i>International Journal of Pattern Recognition and Artificial Intelligence</i>, vol. 34, pp. 2054001, 2020.","links":{"crossRefLink":"https://doi.org/10.1142/S0218001420540014"},"title":"New Algorithm of Response Curve for Fitting HDR Image"}]},"formulaStrippedArticleTitle":"High Dynamic Range video streams based on inexpensive image sensors","nonIeeeCitationCount":"1","contentTypeDisplay":"Conferences","patentCitationCount":"0","mlTime":"PT0.019749S","lastupdate":"2021-10-11","title":"High Dynamic Range video streams based on inexpensive image sensors","contentType":"conferences","ieeeCitationCount":"0","publicationNumber":"7590260"},{"_id":7685589,"formulaStrippedArticleTitle":"Automatic Recommendation Technology for Learning Resources with Convolutional Neural Network","paperCitations":{"ieee":[{"order":"1","displayText":"Xiu Wang, Xuejun Liu, Xinyan Xu, \"A recommendation algorithm for collaborative denoising auto-encoders based on user preference diffusion\", <i>Software Engineering and Service Science (ICSESS) 2017 8th IEEE International Conference on</i>, pp. 447-450, 2017.","links":{"documentLink":"/document/8342952","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8342952","pdfSize":"593KB"},"title":"A recommendation algorithm for collaborative denoising auto-encoders based on user preference diffusion"},{"order":"2","displayText":"Zhenyan Ji, Huaiyu Pi, Wei Wei, Bo Xiong, Marcin Woźniak, Robertas Damasevicius, \"Recommendation Based on Review Texts and Social Communities: A Hybrid Model\", <i>Access IEEE</i>, vol. 7, pp. 40416-40427, 2019.","links":{"documentLink":"/document/8635542","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8635542","pdfSize":"6079KB"},"title":"Recommendation Based on Review Texts and Social Communities: A Hybrid Model"},{"order":"3","displayText":"Abdessamad Chanaa, Nour-eddine El Faddouli, \"Deep learning for a smart e-Iearning system\", <i>Cloud Computing Technologies and Applications (Cloudtech) 2018 4th International Conference on</i>, pp. 1-8, 2018.","links":{"documentLink":"/document/8713335","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8713335","pdfSize":"375KB"},"title":"Deep learning for a smart e-Iearning system"},{"order":"4","displayText":"Xinhua Wang, Xinxin Yang, Lei Guo, Yu Han, Fangai Liu, Baozhong Gao, \"Exploiting Social Review-Enhanced Convolutional Matrix Factorization for Social Recommendation\", <i>Access IEEE</i>, vol. 7, pp. 82826-82837, 2019.","links":{"documentLink":"/document/8744217","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8744217","pdfSize":"2170KB"},"title":"Exploiting Social Review-Enhanced Convolutional Matrix Factorization for Social Recommendation"},{"order":"5","displayText":"Rahul Shrivastava, Dilip Singh Sisodia, \"Product Recommendations Using Textual Similarity Based Learning Models\", <i>Computer Communication and Informatics (ICCCI) 2019 International Conference on</i>, pp. 1-7, 2019.","links":{"documentLink":"/document/8821893","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=8821893","pdfSize":"292KB"},"title":"Product Recommendations Using Textual Similarity Based Learning Models"},{"order":"6","displayText":"Zhizhou Duan, Yuan Gao, Jun Feng, Xiaoxi Zhang, Jie Wang, \"Personalized tourism route recommendation based on user’s active interests*\", <i>Mobile Data Management (MDM) 2020 21st IEEE International Conference on</i>, pp. 729-734, 2020.","links":{"documentLink":"/document/9162322","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=9162322","pdfSize":"776KB"},"title":"Personalized tourism route recommendation based on user’s active interests*"},{"order":"7","displayText":"Zongkai Yang, Juan Yang, Kerry Rice, Jui-Long Hung, Xu Du, \"Using Convolutional Neural Network to Recognize Learning Images for Early Warning of At-Risk Students\", <i>Learning Technologies IEEE Transactions on</i>, vol. 13, no. 3, pp. 617-630, 2020.","links":{"documentLink":"/document/9072352","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=9072352","pdfSize":"2826KB"},"title":"Using Convolutional Neural Network to Recognize Learning Images for Early Warning of At-Risk Students"},{"order":"8","displayText":"Lin Shi, Meifeng Han, Dan Wei, \"Online Curriculum Management of Higher Education Under Mobile Platform\", <i>Computer Technology and Media Convergence Design (CTMCD) 2021 International Conference on</i>, pp. 76-81, 2021.","links":{"documentLink":"/document/9463337","pdfLink":"/stamp/stamp.jsp?tp=&arnumber=9463337","pdfSize":"1572KB"},"title":"Online Curriculum Management of Higher Education Under Mobile Platform"}],"nonIeee":[{"order":"1","displayText":"Zeynep Batmaz, Ali Yurekli, Alper Bilge, Cihan Kaleli, \"A review on deep learning for recommender systems: challenges and remedies\", <i>Artificial Intelligence Review</i>, 2018.","links":{"crossRefLink":"https://doi.org/10.1007/s10462-018-9654-y"},"title":"A review on deep learning for recommender systems: challenges and remedies"},{"order":"2","displayText":"Shuai Zhang, Lina Yao, Aixin Sun, Yi Tay, \"Deep Learning Based Recommender System\", <i>ACM Computing Surveys</i>, vol. 52, pp. 1, 2019.","links":{},"title":"Deep Learning Based Recommender System"},{"order":"3","displayText":"Zhicheng Wu, Huafeng Liu, Yanyan Xu, Liping Jing, \"Collaboration Matrix Factorization on Rate and Review for Recommendation\", <i>Journal of Database Management</i>, vol. 30, pp. 27, 2019.","links":{"crossRefLink":"https://doi.org/10.4018/JDM.2019040102"},"title":"Collaboration Matrix Factorization on Rate and Review for Recommendation"},{"order":"4","displayText":"Aminu Da’u, Naomie Salim, \"Recommendation system based on deep learning methods: a systematic review and new directions\", <i>Artificial Intelligence Review</i>, 2019.","links":{"crossRefLink":"https://doi.org/10.1007/s10462-019-09744-1"},"title":"Recommendation system based on deep learning methods: a systematic review and new directions"},{"order":"5","displayText":"Christos Troussas, Akrivi Krouska, Maria Virvou, \"A multilayer inference engine for individualized tutoring model: adapting learning material and its granularity\", <i>Neural Computing and Applications</i>, 2021.","links":{"crossRefLink":"https://doi.org/10.1007/s00521-021-05740-1"},"title":"A multilayer inference engine for individualized tutoring model: adapting learning material and its granularity"},{"order":"6","displayText":"F. Giannakas, C. Troussas, I. Voyiatzis, C. Sgouropoulou, \"A deep learning classification framework for early prediction of team-based academic performance\", <i>Applied Soft Computing</i>, pp. 107355, 2021.","links":{"crossRefLink":"https://doi.org/10.1016/j.asoc.2021.107355"},"title":"A deep learning classification framework for early prediction of team-based academic performance"},{"order":"7","displayText":"Tailin Liang, John Glossner, Lei Wang, Shaobo Shi, Xiaotong Zhang, \"Pruning and quantization for deep neural network acceleration: A survey\", <i>Neurocomputing</i>, vol. 461, pp. 370, 2021.","links":{"crossRefLink":"https://doi.org/10.1016/j.neucom.2021.07.045"},"title":"Pruning and quantization for deep neural network acceleration: A survey"},{"order":"8","displayText":"T. Ramathulasi, M. Rajasekhar Babu, <i>Handbook of Research on Advances in Data Analytics and Complex Communication Networks</i>, pp. 131, 2022.","links":{"crossRefLink":"https://doi.org/10.4018/978-1-7998-7685-4.ch009"},"title":""},{"order":"9","displayText":"Sami Alshmrany, \"Adaptive learning style prediction in e-learning environment using levy flight distribution based CNN model\", <i>Cluster Computing</i>, 2021.","links":{"crossRefLink":"https://doi.org/10.1007/s10586-021-03403-3"},"title":"Adaptive learning style prediction in e-learning environment using levy flight distribution based CNN model"},{"order":"10","displayText":"William Lemus Leiva, Meng-Lin Li, Chieh-Yuan Tsai, \"A Two-Phase Deep Learning-Based Recommender System: Enhanced by a Data Quality Inspector\", <i>Applied Sciences</i>, vol. 11, pp. 9667, 2021.","links":{"crossRefLink":"https://doi.org/10.3390/app11209667"},"title":"A Two-Phase Deep Learning-Based Recommender System: Enhanced by a Data Quality Inspector"}]},"nonIeeeCitationCount":"10","contentTypeDisplay":"Conferences","patentCitationCount":"0","mlTime":"PT0.456229S","lastupdate":"2021-10-21","title":"Automatic Recommendation Technology for Learning Resources with Convolutional Neural Network","contentType":"conferences","ieeeCitationCount":"8","publicationNumber":"7636499"}]